GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: MD3CON0
#define MD3CON0 MD3CON0
MD3CON0                                  equ 021Bh
// bitfield definitions
MD3CON0_BIT_POSN                         equ 0000h
MD3CON0_BIT_POSITION                     equ 0000h
MD3CON0_BIT_SIZE                         equ 0001h
MD3CON0_BIT_LENGTH                       equ 0001h
MD3CON0_BIT_MASK                         equ 0001h
MD3CON0_OPOL_POSN                        equ 0004h
MD3CON0_OPOL_POSITION                    equ 0004h
MD3CON0_OPOL_SIZE                        equ 0001h
MD3CON0_OPOL_LENGTH                      equ 0001h
MD3CON0_OPOL_MASK                        equ 0010h
MD3CON0_OUT_POSN                         equ 0005h
MD3CON0_OUT_POSITION                     equ 0005h
MD3CON0_OUT_SIZE                         equ 0001h
MD3CON0_OUT_LENGTH                       equ 0001h
MD3CON0_OUT_MASK                         equ 0020h
MD3CON0_EN_POSN                          equ 0007h
MD3CON0_EN_POSITION                      equ 0007h
MD3CON0_EN_SIZE                          equ 0001h
MD3CON0_EN_LENGTH                        equ 0001h
MD3CON0_EN_MASK                          equ 0080h
MD3CON0_MD3BIT_POSN                      equ 0000h
MD3CON0_MD3BIT_POSITION                  equ 0000h
MD3CON0_MD3BIT_SIZE                      equ 0001h
MD3CON0_MD3BIT_LENGTH                    equ 0001h
MD3CON0_MD3BIT_MASK                      equ 0001h
MD3CON0_MD3OPOL_POSN                     equ 0004h
MD3CON0_MD3OPOL_POSITION                 equ 0004h
MD3CON0_MD3OPOL_SIZE                     equ 0001h
MD3CON0_MD3OPOL_LENGTH                   equ 0001h
MD3CON0_MD3OPOL_MASK                     equ 0010h
MD3CON0_MD3OUT_POSN                      equ 0005h
MD3CON0_MD3OUT_POSITION                  equ 0005h
MD3CON0_MD3OUT_SIZE                      equ 0001h
MD3CON0_MD3OUT_LENGTH                    equ 0001h
MD3CON0_MD3OUT_MASK                      equ 0020h
MD3CON0_MD3EN_POSN                       equ 0007h
MD3CON0_MD3EN_POSITION                   equ 0007h
MD3CON0_MD3EN_SIZE                       equ 0001h
MD3CON0_MD3EN_LENGTH                     equ 0001h
MD3CON0_MD3EN_MASK                       equ 0080h

// Register: MD3CON1
#define MD3CON1 MD3CON1
MD3CON1                                  equ 021Ch
// bitfield definitions
MD3CON1_CLSYNC_POSN                      equ 0000h
MD3CON1_CLSYNC_POSITION                  equ 0000h
MD3CON1_CLSYNC_SIZE                      equ 0001h
MD3CON1_CLSYNC_LENGTH                    equ 0001h
MD3CON1_CLSYNC_MASK                      equ 0001h
MD3CON1_CLPOL_POSN                       equ 0001h
MD3CON1_CLPOL_POSITION                   equ 0001h
MD3CON1_CLPOL_SIZE                       equ 0001h
MD3CON1_CLPOL_LENGTH                     equ 0001h
MD3CON1_CLPOL_MASK                       equ 0002h
MD3CON1_CHSYNC_POSN                      equ 0004h
MD3CON1_CHSYNC_POSITION                  equ 0004h
MD3CON1_CHSYNC_SIZE                      equ 0001h
MD3CON1_CHSYNC_LENGTH                    equ 0001h
MD3CON1_CHSYNC_MASK                      equ 0010h
MD3CON1_CHPOL_POSN                       equ 0005h
MD3CON1_CHPOL_POSITION                   equ 0005h
MD3CON1_CHPOL_SIZE                       equ 0001h
MD3CON1_CHPOL_LENGTH                     equ 0001h
MD3CON1_CHPOL_MASK                       equ 0020h
MD3CON1_MD3CLSYNC_POSN                   equ 0000h
MD3CON1_MD3CLSYNC_POSITION               equ 0000h
MD3CON1_MD3CLSYNC_SIZE                   equ 0001h
MD3CON1_MD3CLSYNC_LENGTH                 equ 0001h
MD3CON1_MD3CLSYNC_MASK                   equ 0001h
MD3CON1_MD3CLPOL_POSN                    equ 0001h
MD3CON1_MD3CLPOL_POSITION                equ 0001h
MD3CON1_MD3CLPOL_SIZE                    equ 0001h
MD3CON1_MD3CLPOL_LENGTH                  equ 0001h
MD3CON1_MD3CLPOL_MASK                    equ 0002h
MD3CON1_MD3CHSYNC_POSN                   equ 0004h
MD3CON1_MD3CHSYNC_POSITION               equ 0004h
MD3CON1_MD3CHSYNC_SIZE                   equ 0001h
MD3CON1_MD3CHSYNC_LENGTH                 equ 0001h
MD3CON1_MD3CHSYNC_MASK                   equ 0010h
MD3CON1_MD3CHPOL_POSN                    equ 0005h
MD3CON1_MD3CHPOL_POSITION                equ 0005h
MD3CON1_MD3CHPOL_SIZE                    equ 0001h
MD3CON1_MD3CHPOL_LENGTH                  equ 0001h
MD3CON1_MD3CHPOL_MASK                    equ 0020h

// Register: MD3SRC
#define MD3SRC MD3SRC
MD3SRC                                   equ 021Dh
// bitfield definitions
MD3SRC_MS_POSN                           equ 0000h
MD3SRC_MS_POSITION                       equ 0000h
MD3SRC_MS_SIZE                           equ 0005h
MD3SRC_MS_LENGTH                         equ 0005h
MD3SRC_MS_MASK                           equ 001Fh
MD3SRC_MS0_POSN                          equ 0000h
MD3SRC_MS0_POSITION                      equ 0000h
MD3SRC_MS0_SIZE                          equ 0001h
MD3SRC_MS0_LENGTH                        equ 0001h
MD3SRC_MS0_MASK                          equ 0001h
MD3SRC_MS1_POSN                          equ 0001h
MD3SRC_MS1_POSITION                      equ 0001h
MD3SRC_MS1_SIZE                          equ 0001h
MD3SRC_MS1_LENGTH                        equ 0001h
MD3SRC_MS1_MASK                          equ 0002h
MD3SRC_MS2_POSN                          equ 0002h
MD3SRC_MS2_POSITION                      equ 0002h
MD3SRC_MS2_SIZE                          equ 0001h
MD3SRC_MS2_LENGTH                        equ 0001h
MD3SRC_MS2_MASK                          equ 0004h
MD3SRC_MS3_POSN                          equ 0003h
MD3SRC_MS3_POSITION                      equ 0003h
MD3SRC_MS3_SIZE                          equ 0001h
MD3SRC_MS3_LENGTH                        equ 0001h
MD3SRC_MS3_MASK                          equ 0008h
MD3SRC_MS4_POSN                          equ 0004h
MD3SRC_MS4_POSITION                      equ 0004h
MD3SRC_MS4_SIZE                          equ 0001h
MD3SRC_MS4_LENGTH                        equ 0001h
MD3SRC_MS4_MASK                          equ 0010h
MD3SRC_MD3MS_POSN                        equ 0000h
MD3SRC_MD3MS_POSITION                    equ 0000h
MD3SRC_MD3MS_SIZE                        equ 0005h
MD3SRC_MD3MS_LENGTH                      equ 0005h
MD3SRC_MD3MS_MASK                        equ 001Fh
MD3SRC_MD3MS0_POSN                       equ 0000h
MD3SRC_MD3MS0_POSITION                   equ 0000h
MD3SRC_MD3MS0_SIZE                       equ 0001h
MD3SRC_MD3MS0_LENGTH                     equ 0001h
MD3SRC_MD3MS0_MASK                       equ 0001h
MD3SRC_MD3MS1_POSN                       equ 0001h
MD3SRC_MD3MS1_POSITION                   equ 0001h
MD3SRC_MD3MS1_SIZE                       equ 0001h
MD3SRC_MD3MS1_LENGTH                     equ 0001h
MD3SRC_MD3MS1_MASK                       equ 0002h
MD3SRC_MD3MS2_POSN                       equ 0002h
MD3SRC_MD3MS2_POSITION                   equ 0002h
MD3SRC_MD3MS2_SIZE                       equ 0001h
MD3SRC_MD3MS2_LENGTH                     equ 0001h
MD3SRC_MD3MS2_MASK                       equ 0004h
MD3SRC_MD3MS3_POSN                       equ 0003h
MD3SRC_MD3MS3_POSITION                   equ 0003h
MD3SRC_MD3MS3_SIZE                       equ 0001h
MD3SRC_MD3MS3_LENGTH                     equ 0001h
MD3SRC_MD3MS3_MASK                       equ 0008h
MD3SRC_MD3MS4_POSN                       equ 0004h
MD3SRC_MD3MS4_POSITION                   equ 0004h
MD3SRC_MD3MS4_SIZE                       equ 0001h
MD3SRC_MD3MS4_LENGTH                     equ 0001h
MD3SRC_MD3MS4_MASK                       equ 0010h

// Register: MD3CARL
#define MD3CARL MD3CARL
MD3CARL                                  equ 021Eh
// bitfield definitions
MD3CARL_CL_POSN                          equ 0000h
MD3CARL_CL_POSITION                      equ 0000h
MD3CARL_CL_SIZE                          equ 0005h
MD3CARL_CL_LENGTH                        equ 0005h
MD3CARL_CL_MASK                          equ 001Fh
MD3CARL_CL0_POSN                         equ 0000h
MD3CARL_CL0_POSITION                     equ 0000h
MD3CARL_CL0_SIZE                         equ 0001h
MD3CARL_CL0_LENGTH                       equ 0001h
MD3CARL_CL0_MASK                         equ 0001h
MD3CARL_CL1_POSN                         equ 0001h
MD3CARL_CL1_POSITION                     equ 0001h
MD3CARL_CL1_SIZE                         equ 0001h
MD3CARL_CL1_LENGTH                       equ 0001h
MD3CARL_CL1_MASK                         equ 0002h
MD3CARL_CL2_POSN                         equ 0002h
MD3CARL_CL2_POSITION                     equ 0002h
MD3CARL_CL2_SIZE                         equ 0001h
MD3CARL_CL2_LENGTH                       equ 0001h
MD3CARL_CL2_MASK                         equ 0004h
MD3CARL_CL3_POSN                         equ 0003h
MD3CARL_CL3_POSITION                     equ 0003h
MD3CARL_CL3_SIZE                         equ 0001h
MD3CARL_CL3_LENGTH                       equ 0001h
MD3CARL_CL3_MASK                         equ 0008h
MD3CARL_CL4_POSN                         equ 0004h
MD3CARL_CL4_POSITION                     equ 0004h
MD3CARL_CL4_SIZE                         equ 0001h
MD3CARL_CL4_LENGTH                       equ 0001h
MD3CARL_CL4_MASK                         equ 0010h
MD3CARL_MD3CL_POSN                       equ 0000h
MD3CARL_MD3CL_POSITION                   equ 0000h
MD3CARL_MD3CL_SIZE                       equ 0005h
MD3CARL_MD3CL_LENGTH                     equ 0005h
MD3CARL_MD3CL_MASK                       equ 001Fh
MD3CARL_MD3CL0_POSN                      equ 0000h
MD3CARL_MD3CL0_POSITION                  equ 0000h
MD3CARL_MD3CL0_SIZE                      equ 0001h
MD3CARL_MD3CL0_LENGTH                    equ 0001h
MD3CARL_MD3CL0_MASK                      equ 0001h
MD3CARL_MD3CL1_POSN                      equ 0001h
MD3CARL_MD3CL1_POSITION                  equ 0001h
MD3CARL_MD3CL1_SIZE                      equ 0001h
MD3CARL_MD3CL1_LENGTH                    equ 0001h
MD3CARL_MD3CL1_MASK                      equ 0002h
MD3CARL_MD3CL2_POSN                      equ 0002h
MD3CARL_MD3CL2_POSITION                  equ 0002h
MD3CARL_MD3CL2_SIZE                      equ 0001h
MD3CARL_MD3CL2_LENGTH                    equ 0001h
MD3CARL_MD3CL2_MASK                      equ 0004h
MD3CARL_MD3CL3_POSN                      equ 0003h
MD3CARL_MD3CL3_POSITION                  equ 0003h
MD3CARL_MD3CL3_SIZE                      equ 0001h
MD3CARL_MD3CL3_LENGTH                    equ 0001h
MD3CARL_MD3CL3_MASK                      equ 0008h
MD3CARL_MD3CL4_POSN                      equ 0004h
MD3CARL_MD3CL4_POSITION                  equ 0004h
MD3CARL_MD3CL4_SIZE                      equ 0001h
MD3CARL_MD3CL4_LENGTH                    equ 0001h
MD3CARL_MD3CL4_MASK                      equ 0010h

// Register: MD3CARH
#define MD3CARH MD3CARH
MD3CARH                                  equ 021Fh
// bitfield definitions
MD3CARH_CH_POSN                          equ 0000h
MD3CARH_CH_POSITION                      equ 0000h
MD3CARH_CH_SIZE                          equ 0005h
MD3CARH_CH_LENGTH                        equ 0005h
MD3CARH_CH_MASK                          equ 001Fh
MD3CARH_CH0_POSN                         equ 0000h
MD3CARH_CH0_POSITION                     equ 0000h
MD3CARH_CH0_SIZE                         equ 0001h
MD3CARH_CH0_LENGTH                       equ 0001h
MD3CARH_CH0_MASK                         equ 0001h
MD3CARH_CH1_POSN                         equ 0001h
MD3CARH_CH1_POSITION                     equ 0001h
MD3CARH_CH1_SIZE                         equ 0001h
MD3CARH_CH1_LENGTH                       equ 0001h
MD3CARH_CH1_MASK                         equ 0002h
MD3CARH_CH2_POSN                         equ 0002h
MD3CARH_CH2_POSITION                     equ 0002h
MD3CARH_CH2_SIZE                         equ 0001h
MD3CARH_CH2_LENGTH                       equ 0001h
MD3CARH_CH2_MASK                         equ 0004h
MD3CARH_CH3_POSN                         equ 0003h
MD3CARH_CH3_POSITION                     equ 0003h
MD3CARH_CH3_SIZE                         equ 0001h
MD3CARH_CH3_LENGTH                       equ 0001h
MD3CARH_CH3_MASK                         equ 0008h
MD3CARH_CH4_POSN                         equ 0004h
MD3CARH_CH4_POSITION                     equ 0004h
MD3CARH_CH4_SIZE                         equ 0001h
MD3CARH_CH4_LENGTH                       equ 0001h
MD3CARH_CH4_MASK                         equ 0010h
MD3CARH_MD3CH_POSN                       equ 0000h
MD3CARH_MD3CH_POSITION                   equ 0000h
MD3CARH_MD3CH_SIZE                       equ 0005h
MD3CARH_MD3CH_LENGTH                     equ 0005h
MD3CARH_MD3CH_MASK                       equ 001Fh
MD3CARH_MD3CH0_POSN                      equ 0000h
MD3CARH_MD3CH0_POSITION                  equ 0000h
MD3CARH_MD3CH0_SIZE                      equ 0001h
MD3CARH_MD3CH0_LENGTH                    equ 0001h
MD3CARH_MD3CH0_MASK                      equ 0001h
MD3CARH_MD3CH1_POSN                      equ 0001h
MD3CARH_MD3CH1_POSITION                  equ 0001h
MD3CARH_MD3CH1_SIZE                      equ 0001h
MD3CARH_MD3CH1_LENGTH                    equ 0001h
MD3CARH_MD3CH1_MASK                      equ 0002h
MD3CARH_MD3CH2_POSN                      equ 0002h
MD3CARH_MD3CH2_POSITION                  equ 0002h
MD3CARH_MD3CH2_SIZE                      equ 0001h
MD3CARH_MD3CH2_LENGTH                    equ 0001h
MD3CARH_MD3CH2_MASK                      equ 0004h
MD3CARH_MD3CH3_POSN                      equ 0003h
MD3CARH_MD3CH3_POSITION                  equ 0003h
MD3CARH_MD3CH3_SIZE                      equ 0001h
MD3CARH_MD3CH3_LENGTH                    equ 0001h
MD3CARH_MD3CH3_MASK                      equ 0008h
MD3CARH_MD3CH4_POSN                      equ 0004h
MD3CARH_MD3CH4_POSITION                  equ 0004h
MD3CARH_MD3CH4_SIZE                      equ 0001h
MD3CARH_MD3CH4_LENGTH                    equ 0001h
MD3CARH_MD3CH4_MASK                      equ 0010h

// Register: ODCONA
#define ODCONA ODCONA
ODCONA                                   equ 028Ch
// bitfield definitions
ODCONA_ODA0_POSN                         equ 0000h
ODCONA_ODA0_POSITION                     equ 0000h
ODCONA_ODA0_SIZE                         equ 0001h
ODCONA_ODA0_LENGTH                       equ 0001h
ODCONA_ODA0_MASK                         equ 0001h
ODCONA_ODA1_POSN                         equ 0001h
ODCONA_ODA1_POSITION                     equ 0001h
ODCONA_ODA1_SIZE                         equ 0001h
ODCONA_ODA1_LENGTH                       equ 0001h
ODCONA_ODA1_MASK                         equ 0002h
ODCONA_ODA2_POSN                         equ 0002h
ODCONA_ODA2_POSITION                     equ 0002h
ODCONA_ODA2_SIZE                         equ 0001h
ODCONA_ODA2_LENGTH                       equ 0001h
ODCONA_ODA2_MASK                         equ 0004h
ODCONA_ODA3_POSN                         equ 0003h
ODCONA_ODA3_POSITION                     equ 0003h
ODCONA_ODA3_SIZE                         equ 0001h
ODCONA_ODA3_LENGTH                       equ 0001h
ODCONA_ODA3_MASK                         equ 0008h
ODCONA_ODA4_POSN                         equ 0004h
ODCONA_ODA4_POSITION                     equ 0004h
ODCONA_ODA4_SIZE                         equ 0001h
ODCONA_ODA4_LENGTH                       equ 0001h
ODCONA_ODA4_MASK                         equ 0010h
ODCONA_ODA5_POSN                         equ 0005h
ODCONA_ODA5_POSITION                     equ 0005h
ODCONA_ODA5_SIZE                         equ 0001h
ODCONA_ODA5_LENGTH                       equ 0001h
ODCONA_ODA5_MASK                         equ 0020h
ODCONA_ODA6_POSN                         equ 0006h
ODCONA_ODA6_POSITION                     equ 0006h
ODCONA_ODA6_SIZE                         equ 0001h
ODCONA_ODA6_LENGTH                       equ 0001h
ODCONA_ODA6_MASK                         equ 0040h
ODCONA_ODA7_POSN                         equ 0007h
ODCONA_ODA7_POSITION                     equ 0007h
ODCONA_ODA7_SIZE                         equ 0001h
ODCONA_ODA7_LENGTH                       equ 0001h
ODCONA_ODA7_MASK                         equ 0080h

// Register: ODCONB
#define ODCONB ODCONB
ODCONB                                   equ 028Dh
// bitfield definitions
ODCONB_ODB0_POSN                         equ 0000h
ODCONB_ODB0_POSITION                     equ 0000h
ODCONB_ODB0_SIZE                         equ 0001h
ODCONB_ODB0_LENGTH                       equ 0001h
ODCONB_ODB0_MASK                         equ 0001h
ODCONB_ODB1_POSN                         equ 0001h
ODCONB_ODB1_POSITION                     equ 0001h
ODCONB_ODB1_SIZE                         equ 0001h
ODCONB_ODB1_LENGTH                       equ 0001h
ODCONB_ODB1_MASK                         equ 0002h
ODCONB_ODB2_POSN                         equ 0002h
ODCONB_ODB2_POSITION                     equ 0002h
ODCONB_ODB2_SIZE                         equ 0001h
ODCONB_ODB2_LENGTH                       equ 0001h
ODCONB_ODB2_MASK                         equ 0004h
ODCONB_ODB3_POSN                         equ 0003h
ODCONB_ODB3_POSITION                     equ 0003h
ODCONB_ODB3_SIZE                         equ 0001h
ODCONB_ODB3_LENGTH                       equ 0001h
ODCONB_ODB3_MASK                         equ 0008h
ODCONB_ODB4_POSN                         equ 0004h
ODCONB_ODB4_POSITION                     equ 0004h
ODCONB_ODB4_SIZE                         equ 0001h
ODCONB_ODB4_LENGTH                       equ 0001h
ODCONB_ODB4_MASK                         equ 0010h
ODCONB_ODB5_POSN                         equ 0005h
ODCONB_ODB5_POSITION                     equ 0005h
ODCONB_ODB5_SIZE                         equ 0001h
ODCONB_ODB5_LENGTH                       equ 0001h
ODCONB_ODB5_MASK                         equ 0020h
ODCONB_ODB6_POSN                         equ 0006h
ODCONB_ODB6_POSITION                     equ 0006h
ODCONB_ODB6_SIZE                         equ 0001h
ODCONB_ODB6_LENGTH                       equ 0001h
ODCONB_ODB6_MASK                         equ 0040h
ODCONB_ODB7_POSN                         equ 0007h
ODCONB_ODB7_POSITION                     equ 0007h
ODCONB_ODB7_SIZE                         equ 0001h
ODCONB_ODB7_LENGTH                       equ 0001h
ODCONB_ODB7_MASK                         equ 0080h

// Register: ODCONC
#define ODCONC ODCONC
ODCONC                                   equ 028Eh
// bitfield definitions
ODCONC_ODC0_POSN                         equ 0000h
ODCONC_ODC0_POSITION                     equ 0000h
ODCONC_ODC0_SIZE                         equ 0001h
ODCONC_ODC0_LENGTH                       equ 0001h
ODCONC_ODC0_MASK                         equ 0001h
ODCONC_ODC1_POSN                         equ 0001h
ODCONC_ODC1_POSITION                     equ 0001h
ODCONC_ODC1_SIZE                         equ 0001h
ODCONC_ODC1_LENGTH                       equ 0001h
ODCONC_ODC1_MASK                         equ 0002h
ODCONC_ODC2_POSN                         equ 0002h
ODCONC_ODC2_POSITION                     equ 0002h
ODCONC_ODC2_SIZE                         equ 0001h
ODCONC_ODC2_LENGTH                       equ 0001h
ODCONC_ODC2_MASK                         equ 0004h
ODCONC_ODC3_POSN                         equ 0003h
ODCONC_ODC3_POSITION                     equ 0003h
ODCONC_ODC3_SIZE                         equ 0001h
ODCONC_ODC3_LENGTH                       equ 0001h
ODCONC_ODC3_MASK                         equ 0008h
ODCONC_ODC4_POSN                         equ 0004h
ODCONC_ODC4_POSITION                     equ 0004h
ODCONC_ODC4_SIZE                         equ 0001h
ODCONC_ODC4_LENGTH                       equ 0001h
ODCONC_ODC4_MASK                         equ 0010h
ODCONC_ODC5_POSN                         equ 0005h
ODCONC_ODC5_POSITION                     equ 0005h
ODCONC_ODC5_SIZE                         equ 0001h
ODCONC_ODC5_LENGTH                       equ 0001h
ODCONC_ODC5_MASK                         equ 0020h
ODCONC_ODC6_POSN                         equ 0006h
ODCONC_ODC6_POSITION                     equ 0006h
ODCONC_ODC6_SIZE                         equ 0001h
ODCONC_ODC6_LENGTH                       equ 0001h
ODCONC_ODC6_MASK                         equ 0040h
ODCONC_ODC7_POSN                         equ 0007h
ODCONC_ODC7_POSITION                     equ 0007h
ODCONC_ODC7_SIZE                         equ 0001h
ODCONC_ODC7_LENGTH                       equ 0001h
ODCONC_ODC7_MASK                         equ 0080h

