GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: SLRCOND
#define SLRCOND SLRCOND
SLRCOND                                  equ 030Fh
// bitfield definitions
SLRCOND_SLRD0_POSN                       equ 0000h
SLRCOND_SLRD0_POSITION                   equ 0000h
SLRCOND_SLRD0_SIZE                       equ 0001h
SLRCOND_SLRD0_LENGTH                     equ 0001h
SLRCOND_SLRD0_MASK                       equ 0001h
SLRCOND_SLRD1_POSN                       equ 0001h
SLRCOND_SLRD1_POSITION                   equ 0001h
SLRCOND_SLRD1_SIZE                       equ 0001h
SLRCOND_SLRD1_LENGTH                     equ 0001h
SLRCOND_SLRD1_MASK                       equ 0002h
SLRCOND_SLRD2_POSN                       equ 0002h
SLRCOND_SLRD2_POSITION                   equ 0002h
SLRCOND_SLRD2_SIZE                       equ 0001h
SLRCOND_SLRD2_LENGTH                     equ 0001h
SLRCOND_SLRD2_MASK                       equ 0004h
SLRCOND_SLRD3_POSN                       equ 0003h
SLRCOND_SLRD3_POSITION                   equ 0003h
SLRCOND_SLRD3_SIZE                       equ 0001h
SLRCOND_SLRD3_LENGTH                     equ 0001h
SLRCOND_SLRD3_MASK                       equ 0008h
SLRCOND_SLRD4_POSN                       equ 0004h
SLRCOND_SLRD4_POSITION                   equ 0004h
SLRCOND_SLRD4_SIZE                       equ 0001h
SLRCOND_SLRD4_LENGTH                     equ 0001h
SLRCOND_SLRD4_MASK                       equ 0010h
SLRCOND_SLRD5_POSN                       equ 0005h
SLRCOND_SLRD5_POSITION                   equ 0005h
SLRCOND_SLRD5_SIZE                       equ 0001h
SLRCOND_SLRD5_LENGTH                     equ 0001h
SLRCOND_SLRD5_MASK                       equ 0020h
SLRCOND_SLRD6_POSN                       equ 0006h
SLRCOND_SLRD6_POSITION                   equ 0006h
SLRCOND_SLRD6_SIZE                       equ 0001h
SLRCOND_SLRD6_LENGTH                     equ 0001h
SLRCOND_SLRD6_MASK                       equ 0040h
SLRCOND_SLRD7_POSN                       equ 0007h
SLRCOND_SLRD7_POSITION                   equ 0007h
SLRCOND_SLRD7_SIZE                       equ 0001h
SLRCOND_SLRD7_LENGTH                     equ 0001h
SLRCOND_SLRD7_MASK                       equ 0080h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 0310h
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h

// Register: CCPR8L
#define CCPR8L CCPR8L
CCPR8L                                   equ 0311h
// bitfield definitions
CCPR8L_RL_POSN                           equ 0000h
CCPR8L_RL_POSITION                       equ 0000h
CCPR8L_RL_SIZE                           equ 0008h
CCPR8L_RL_LENGTH                         equ 0008h
CCPR8L_RL_MASK                           equ 00FFh

// Register: CCPR8H
#define CCPR8H CCPR8H
CCPR8H                                   equ 0312h
// bitfield definitions
CCPR8H_RH_POSN                           equ 0000h
CCPR8H_RH_POSITION                       equ 0000h
CCPR8H_RH_SIZE                           equ 0008h
CCPR8H_RH_LENGTH                         equ 0008h
CCPR8H_RH_MASK                           equ 00FFh

// Register: CCP8CON
#define CCP8CON CCP8CON
CCP8CON                                  equ 0313h
// bitfield definitions
CCP8CON_MODE_POSN                        equ 0000h
CCP8CON_MODE_POSITION                    equ 0000h
CCP8CON_MODE_SIZE                        equ 0004h
CCP8CON_MODE_LENGTH                      equ 0004h
CCP8CON_MODE_MASK                        equ 000Fh
CCP8CON_FMT_POSN                         equ 0004h
CCP8CON_FMT_POSITION                     equ 0004h
CCP8CON_FMT_SIZE                         equ 0001h
CCP8CON_FMT_LENGTH                       equ 0001h
CCP8CON_FMT_MASK                         equ 0010h
CCP8CON_OUT_POSN                         equ 0005h
CCP8CON_OUT_POSITION                     equ 0005h
CCP8CON_OUT_SIZE                         equ 0001h
CCP8CON_OUT_LENGTH                       equ 0001h
CCP8CON_OUT_MASK                         equ 0020h
CCP8CON_EN_POSN                          equ 0007h
CCP8CON_EN_POSITION                      equ 0007h
CCP8CON_EN_SIZE                          equ 0001h
CCP8CON_EN_LENGTH                        equ 0001h
CCP8CON_EN_MASK                          equ 0080h
CCP8CON_MODE0_POSN                       equ 0000h
CCP8CON_MODE0_POSITION                   equ 0000h
CCP8CON_MODE0_SIZE                       equ 0001h
CCP8CON_MODE0_LENGTH                     equ 0001h
CCP8CON_MODE0_MASK                       equ 0001h
CCP8CON_MODE1_POSN                       equ 0001h
CCP8CON_MODE1_POSITION                   equ 0001h
CCP8CON_MODE1_SIZE                       equ 0001h
CCP8CON_MODE1_LENGTH                     equ 0001h
CCP8CON_MODE1_MASK                       equ 0002h
CCP8CON_MODE2_POSN                       equ 0002h
CCP8CON_MODE2_POSITION                   equ 0002h
CCP8CON_MODE2_SIZE                       equ 0001h
CCP8CON_MODE2_LENGTH                     equ 0001h
CCP8CON_MODE2_MASK                       equ 0004h
CCP8CON_MODE3_POSN                       equ 0003h
CCP8CON_MODE3_POSITION                   equ 0003h
CCP8CON_MODE3_SIZE                       equ 0001h
CCP8CON_MODE3_LENGTH                     equ 0001h
CCP8CON_MODE3_MASK                       equ 0008h
CCP8CON_CCP8MODE_POSN                    equ 0000h
CCP8CON_CCP8MODE_POSITION                equ 0000h
CCP8CON_CCP8MODE_SIZE                    equ 0004h
CCP8CON_CCP8MODE_LENGTH                  equ 0004h
CCP8CON_CCP8MODE_MASK                    equ 000Fh
CCP8CON_CCP8FMT_POSN                     equ 0004h
CCP8CON_CCP8FMT_POSITION                 equ 0004h
CCP8CON_CCP8FMT_SIZE                     equ 0001h
CCP8CON_CCP8FMT_LENGTH                   equ 0001h
CCP8CON_CCP8FMT_MASK                     equ 0010h
CCP8CON_CCP8OUT_POSN                     equ 0005h
CCP8CON_CCP8OUT_POSITION                 equ 0005h
CCP8CON_CCP8OUT_SIZE                     equ 0001h
CCP8CON_CCP8OUT_LENGTH                   equ 0001h
CCP8CON_CCP8OUT_MASK                     equ 0020h
CCP8CON_CCP8EN_POSN                      equ 0007h
CCP8CON_CCP8EN_POSITION                  equ 0007h
CCP8CON_CCP8EN_SIZE                      equ 0001h
CCP8CON_CCP8EN_LENGTH                    equ 0001h
CCP8CON_CCP8EN_MASK                      equ 0080h
CCP8CON_CCP8MODE0_POSN                   equ 0000h
CCP8CON_CCP8MODE0_POSITION               equ 0000h
CCP8CON_CCP8MODE0_SIZE                   equ 0001h
CCP8CON_CCP8MODE0_LENGTH                 equ 0001h
CCP8CON_CCP8MODE0_MASK                   equ 0001h
CCP8CON_CCP8MODE1_POSN                   equ 0001h
CCP8CON_CCP8MODE1_POSITION               equ 0001h
CCP8CON_CCP8MODE1_SIZE                   equ 0001h
CCP8CON_CCP8MODE1_LENGTH                 equ 0001h
CCP8CON_CCP8MODE1_MASK                   equ 0002h
CCP8CON_CCP8MODE2_POSN                   equ 0002h
CCP8CON_CCP8MODE2_POSITION               equ 0002h
CCP8CON_CCP8MODE2_SIZE                   equ 0001h
CCP8CON_CCP8MODE2_LENGTH                 equ 0001h
CCP8CON_CCP8MODE2_MASK                   equ 0004h
CCP8CON_CCP8MODE3_POSN                   equ 0003h
CCP8CON_CCP8MODE3_POSITION               equ 0003h
CCP8CON_CCP8MODE3_SIZE                   equ 0001h
CCP8CON_CCP8MODE3_LENGTH                 equ 0001h
CCP8CON_CCP8MODE3_MASK                   equ 0008h

