GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: INLVLA
#define INLVLA INLVLA
INLVLA                                   equ 038Ch
// bitfield definitions
INLVLA_INLVLA0_POSN                      equ 0000h
INLVLA_INLVLA0_POSITION                  equ 0000h
INLVLA_INLVLA0_SIZE                      equ 0001h
INLVLA_INLVLA0_LENGTH                    equ 0001h
INLVLA_INLVLA0_MASK                      equ 0001h
INLVLA_INLVLA1_POSN                      equ 0001h
INLVLA_INLVLA1_POSITION                  equ 0001h
INLVLA_INLVLA1_SIZE                      equ 0001h
INLVLA_INLVLA1_LENGTH                    equ 0001h
INLVLA_INLVLA1_MASK                      equ 0002h
INLVLA_INLVLA2_POSN                      equ 0002h
INLVLA_INLVLA2_POSITION                  equ 0002h
INLVLA_INLVLA2_SIZE                      equ 0001h
INLVLA_INLVLA2_LENGTH                    equ 0001h
INLVLA_INLVLA2_MASK                      equ 0004h
INLVLA_INLVLA3_POSN                      equ 0003h
INLVLA_INLVLA3_POSITION                  equ 0003h
INLVLA_INLVLA3_SIZE                      equ 0001h
INLVLA_INLVLA3_LENGTH                    equ 0001h
INLVLA_INLVLA3_MASK                      equ 0008h
INLVLA_INLVLA4_POSN                      equ 0004h
INLVLA_INLVLA4_POSITION                  equ 0004h
INLVLA_INLVLA4_SIZE                      equ 0001h
INLVLA_INLVLA4_LENGTH                    equ 0001h
INLVLA_INLVLA4_MASK                      equ 0010h
INLVLA_INLVLA5_POSN                      equ 0005h
INLVLA_INLVLA5_POSITION                  equ 0005h
INLVLA_INLVLA5_SIZE                      equ 0001h
INLVLA_INLVLA5_LENGTH                    equ 0001h
INLVLA_INLVLA5_MASK                      equ 0020h
INLVLA_INLVLA6_POSN                      equ 0006h
INLVLA_INLVLA6_POSITION                  equ 0006h
INLVLA_INLVLA6_SIZE                      equ 0001h
INLVLA_INLVLA6_LENGTH                    equ 0001h
INLVLA_INLVLA6_MASK                      equ 0040h
INLVLA_INLVLA7_POSN                      equ 0007h
INLVLA_INLVLA7_POSITION                  equ 0007h
INLVLA_INLVLA7_SIZE                      equ 0001h
INLVLA_INLVLA7_LENGTH                    equ 0001h
INLVLA_INLVLA7_MASK                      equ 0080h
INLVLA_INLVA0_POSN                       equ 0000h
INLVLA_INLVA0_POSITION                   equ 0000h
INLVLA_INLVA0_SIZE                       equ 0001h
INLVLA_INLVA0_LENGTH                     equ 0001h
INLVLA_INLVA0_MASK                       equ 0001h
INLVLA_INLVA1_POSN                       equ 0001h
INLVLA_INLVA1_POSITION                   equ 0001h
INLVLA_INLVA1_SIZE                       equ 0001h
INLVLA_INLVA1_LENGTH                     equ 0001h
INLVLA_INLVA1_MASK                       equ 0002h
INLVLA_INLVA2_POSN                       equ 0002h
INLVLA_INLVA2_POSITION                   equ 0002h
INLVLA_INLVA2_SIZE                       equ 0001h
INLVLA_INLVA2_LENGTH                     equ 0001h
INLVLA_INLVA2_MASK                       equ 0004h
INLVLA_INLVA3_POSN                       equ 0003h
INLVLA_INLVA3_POSITION                   equ 0003h
INLVLA_INLVA3_SIZE                       equ 0001h
INLVLA_INLVA3_LENGTH                     equ 0001h
INLVLA_INLVA3_MASK                       equ 0008h
INLVLA_INLVA4_POSN                       equ 0004h
INLVLA_INLVA4_POSITION                   equ 0004h
INLVLA_INLVA4_SIZE                       equ 0001h
INLVLA_INLVA4_LENGTH                     equ 0001h
INLVLA_INLVA4_MASK                       equ 0010h
INLVLA_INLVA5_POSN                       equ 0005h
INLVLA_INLVA5_POSITION                   equ 0005h
INLVLA_INLVA5_SIZE                       equ 0001h
INLVLA_INLVA5_LENGTH                     equ 0001h
INLVLA_INLVA5_MASK                       equ 0020h
INLVLA_INLVA6_POSN                       equ 0006h
INLVLA_INLVA6_POSITION                   equ 0006h
INLVLA_INLVA6_SIZE                       equ 0001h
INLVLA_INLVA6_LENGTH                     equ 0001h
INLVLA_INLVA6_MASK                       equ 0040h
INLVLA_INLVA7_POSN                       equ 0007h
INLVLA_INLVA7_POSITION                   equ 0007h
INLVLA_INLVA7_SIZE                       equ 0001h
INLVLA_INLVA7_LENGTH                     equ 0001h
INLVLA_INLVA7_MASK                       equ 0080h

// Register: INLVLB
#define INLVLB INLVLB
INLVLB                                   equ 038Dh
// bitfield definitions
INLVLB_INLVLB0_POSN                      equ 0000h
INLVLB_INLVLB0_POSITION                  equ 0000h
INLVLB_INLVLB0_SIZE                      equ 0001h
INLVLB_INLVLB0_LENGTH                    equ 0001h
INLVLB_INLVLB0_MASK                      equ 0001h
INLVLB_INLVLB1_POSN                      equ 0001h
INLVLB_INLVLB1_POSITION                  equ 0001h
INLVLB_INLVLB1_SIZE                      equ 0001h
INLVLB_INLVLB1_LENGTH                    equ 0001h
INLVLB_INLVLB1_MASK                      equ 0002h
INLVLB_INLVLB2_POSN                      equ 0002h
INLVLB_INLVLB2_POSITION                  equ 0002h
INLVLB_INLVLB2_SIZE                      equ 0001h
INLVLB_INLVLB2_LENGTH                    equ 0001h
INLVLB_INLVLB2_MASK                      equ 0004h
INLVLB_INLVLB3_POSN                      equ 0003h
INLVLB_INLVLB3_POSITION                  equ 0003h
INLVLB_INLVLB3_SIZE                      equ 0001h
INLVLB_INLVLB3_LENGTH                    equ 0001h
INLVLB_INLVLB3_MASK                      equ 0008h
INLVLB_INLVLB4_POSN                      equ 0004h
INLVLB_INLVLB4_POSITION                  equ 0004h
INLVLB_INLVLB4_SIZE                      equ 0001h
INLVLB_INLVLB4_LENGTH                    equ 0001h
INLVLB_INLVLB4_MASK                      equ 0010h
INLVLB_INLVLB5_POSN                      equ 0005h
INLVLB_INLVLB5_POSITION                  equ 0005h
INLVLB_INLVLB5_SIZE                      equ 0001h
INLVLB_INLVLB5_LENGTH                    equ 0001h
INLVLB_INLVLB5_MASK                      equ 0020h
INLVLB_INLVLB6_POSN                      equ 0006h
INLVLB_INLVLB6_POSITION                  equ 0006h
INLVLB_INLVLB6_SIZE                      equ 0001h
INLVLB_INLVLB6_LENGTH                    equ 0001h
INLVLB_INLVLB6_MASK                      equ 0040h
INLVLB_INLVLB7_POSN                      equ 0007h
INLVLB_INLVLB7_POSITION                  equ 0007h
INLVLB_INLVLB7_SIZE                      equ 0001h
INLVLB_INLVLB7_LENGTH                    equ 0001h
INLVLB_INLVLB7_MASK                      equ 0080h
INLVLB_INLVB0_POSN                       equ 0000h
INLVLB_INLVB0_POSITION                   equ 0000h
INLVLB_INLVB0_SIZE                       equ 0001h
INLVLB_INLVB0_LENGTH                     equ 0001h
INLVLB_INLVB0_MASK                       equ 0001h
INLVLB_INLVB1_POSN                       equ 0001h
INLVLB_INLVB1_POSITION                   equ 0001h
INLVLB_INLVB1_SIZE                       equ 0001h
INLVLB_INLVB1_LENGTH                     equ 0001h
INLVLB_INLVB1_MASK                       equ 0002h
INLVLB_INLVB2_POSN                       equ 0002h
INLVLB_INLVB2_POSITION                   equ 0002h
INLVLB_INLVB2_SIZE                       equ 0001h
INLVLB_INLVB2_LENGTH                     equ 0001h
INLVLB_INLVB2_MASK                       equ 0004h
INLVLB_INLVB3_POSN                       equ 0003h
INLVLB_INLVB3_POSITION                   equ 0003h
INLVLB_INLVB3_SIZE                       equ 0001h
INLVLB_INLVB3_LENGTH                     equ 0001h
INLVLB_INLVB3_MASK                       equ 0008h
INLVLB_INLVB4_POSN                       equ 0004h
INLVLB_INLVB4_POSITION                   equ 0004h
INLVLB_INLVB4_SIZE                       equ 0001h
INLVLB_INLVB4_LENGTH                     equ 0001h
INLVLB_INLVB4_MASK                       equ 0010h
INLVLB_INLVB5_POSN                       equ 0005h
INLVLB_INLVB5_POSITION                   equ 0005h
INLVLB_INLVB5_SIZE                       equ 0001h
INLVLB_INLVB5_LENGTH                     equ 0001h
INLVLB_INLVB5_MASK                       equ 0020h
INLVLB_INLVB6_POSN                       equ 0006h
INLVLB_INLVB6_POSITION                   equ 0006h
INLVLB_INLVB6_SIZE                       equ 0001h
INLVLB_INLVB6_LENGTH                     equ 0001h
INLVLB_INLVB6_MASK                       equ 0040h
INLVLB_INLVB7_POSN                       equ 0007h
INLVLB_INLVB7_POSITION                   equ 0007h
INLVLB_INLVB7_SIZE                       equ 0001h
INLVLB_INLVB7_LENGTH                     equ 0001h
INLVLB_INLVB7_MASK                       equ 0080h

