GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: DAC5REFL
#define DAC5REFL DAC5REFL
DAC5REFL                                 equ 0599h
// bitfield definitions
DAC5REFL_REF0_POSN                       equ 0000h
DAC5REFL_REF0_POSITION                   equ 0000h
DAC5REFL_REF0_SIZE                       equ 0001h
DAC5REFL_REF0_LENGTH                     equ 0001h
DAC5REFL_REF0_MASK                       equ 0001h
DAC5REFL_REF1_POSN                       equ 0001h
DAC5REFL_REF1_POSITION                   equ 0001h
DAC5REFL_REF1_SIZE                       equ 0001h
DAC5REFL_REF1_LENGTH                     equ 0001h
DAC5REFL_REF1_MASK                       equ 0002h
DAC5REFL_REF2_POSN                       equ 0002h
DAC5REFL_REF2_POSITION                   equ 0002h
DAC5REFL_REF2_SIZE                       equ 0001h
DAC5REFL_REF2_LENGTH                     equ 0001h
DAC5REFL_REF2_MASK                       equ 0004h
DAC5REFL_REF3_POSN                       equ 0003h
DAC5REFL_REF3_POSITION                   equ 0003h
DAC5REFL_REF3_SIZE                       equ 0001h
DAC5REFL_REF3_LENGTH                     equ 0001h
DAC5REFL_REF3_MASK                       equ 0008h
DAC5REFL_REF4_POSN                       equ 0004h
DAC5REFL_REF4_POSITION                   equ 0004h
DAC5REFL_REF4_SIZE                       equ 0001h
DAC5REFL_REF4_LENGTH                     equ 0001h
DAC5REFL_REF4_MASK                       equ 0010h
DAC5REFL_REF5_POSN                       equ 0005h
DAC5REFL_REF5_POSITION                   equ 0005h
DAC5REFL_REF5_SIZE                       equ 0001h
DAC5REFL_REF5_LENGTH                     equ 0001h
DAC5REFL_REF5_MASK                       equ 0020h
DAC5REFL_REF6_POSN                       equ 0006h
DAC5REFL_REF6_POSITION                   equ 0006h
DAC5REFL_REF6_SIZE                       equ 0001h
DAC5REFL_REF6_LENGTH                     equ 0001h
DAC5REFL_REF6_MASK                       equ 0040h
DAC5REFL_REF7_POSN                       equ 0007h
DAC5REFL_REF7_POSITION                   equ 0007h
DAC5REFL_REF7_SIZE                       equ 0001h
DAC5REFL_REF7_LENGTH                     equ 0001h
DAC5REFL_REF7_MASK                       equ 0080h
DAC5REFL_DAC5REF0_POSN                   equ 0000h
DAC5REFL_DAC5REF0_POSITION               equ 0000h
DAC5REFL_DAC5REF0_SIZE                   equ 0001h
DAC5REFL_DAC5REF0_LENGTH                 equ 0001h
DAC5REFL_DAC5REF0_MASK                   equ 0001h
DAC5REFL_DAC5REF1_POSN                   equ 0001h
DAC5REFL_DAC5REF1_POSITION               equ 0001h
DAC5REFL_DAC5REF1_SIZE                   equ 0001h
DAC5REFL_DAC5REF1_LENGTH                 equ 0001h
DAC5REFL_DAC5REF1_MASK                   equ 0002h
DAC5REFL_DAC5REF2_POSN                   equ 0002h
DAC5REFL_DAC5REF2_POSITION               equ 0002h
DAC5REFL_DAC5REF2_SIZE                   equ 0001h
DAC5REFL_DAC5REF2_LENGTH                 equ 0001h
DAC5REFL_DAC5REF2_MASK                   equ 0004h
DAC5REFL_DAC5REF3_POSN                   equ 0003h
DAC5REFL_DAC5REF3_POSITION               equ 0003h
DAC5REFL_DAC5REF3_SIZE                   equ 0001h
DAC5REFL_DAC5REF3_LENGTH                 equ 0001h
DAC5REFL_DAC5REF3_MASK                   equ 0008h
DAC5REFL_DAC5REF4_POSN                   equ 0004h
DAC5REFL_DAC5REF4_POSITION               equ 0004h
DAC5REFL_DAC5REF4_SIZE                   equ 0001h
DAC5REFL_DAC5REF4_LENGTH                 equ 0001h
DAC5REFL_DAC5REF4_MASK                   equ 0010h
DAC5REFL_DAC5REF5_POSN                   equ 0005h
DAC5REFL_DAC5REF5_POSITION               equ 0005h
DAC5REFL_DAC5REF5_SIZE                   equ 0001h
DAC5REFL_DAC5REF5_LENGTH                 equ 0001h
DAC5REFL_DAC5REF5_MASK                   equ 0020h
DAC5REFL_DAC5REF6_POSN                   equ 0006h
DAC5REFL_DAC5REF6_POSITION               equ 0006h
DAC5REFL_DAC5REF6_SIZE                   equ 0001h
DAC5REFL_DAC5REF6_LENGTH                 equ 0001h
DAC5REFL_DAC5REF6_MASK                   equ 0040h
DAC5REFL_DAC5REF7_POSN                   equ 0007h
DAC5REFL_DAC5REF7_POSITION               equ 0007h
DAC5REFL_DAC5REF7_SIZE                   equ 0001h
DAC5REFL_DAC5REF7_LENGTH                 equ 0001h
DAC5REFL_DAC5REF7_MASK                   equ 0080h
DAC5REFL_R0_POSN                         equ 0000h
DAC5REFL_R0_POSITION                     equ 0000h
DAC5REFL_R0_SIZE                         equ 0001h
DAC5REFL_R0_LENGTH                       equ 0001h
DAC5REFL_R0_MASK                         equ 0001h
DAC5REFL_R1_POSN                         equ 0001h
DAC5REFL_R1_POSITION                     equ 0001h
DAC5REFL_R1_SIZE                         equ 0001h
DAC5REFL_R1_LENGTH                       equ 0001h
DAC5REFL_R1_MASK                         equ 0002h
DAC5REFL_R2_POSN                         equ 0002h
DAC5REFL_R2_POSITION                     equ 0002h
DAC5REFL_R2_SIZE                         equ 0001h
DAC5REFL_R2_LENGTH                       equ 0001h
DAC5REFL_R2_MASK                         equ 0004h
DAC5REFL_R3_POSN                         equ 0003h
DAC5REFL_R3_POSITION                     equ 0003h
DAC5REFL_R3_SIZE                         equ 0001h
DAC5REFL_R3_LENGTH                       equ 0001h
DAC5REFL_R3_MASK                         equ 0008h
DAC5REFL_R4_POSN                         equ 0004h
DAC5REFL_R4_POSITION                     equ 0004h
DAC5REFL_R4_SIZE                         equ 0001h
DAC5REFL_R4_LENGTH                       equ 0001h
DAC5REFL_R4_MASK                         equ 0010h
DAC5REFL_R5_POSN                         equ 0005h
DAC5REFL_R5_POSITION                     equ 0005h
DAC5REFL_R5_SIZE                         equ 0001h
DAC5REFL_R5_LENGTH                       equ 0001h
DAC5REFL_R5_MASK                         equ 0020h
DAC5REFL_R6_POSN                         equ 0006h
DAC5REFL_R6_POSITION                     equ 0006h
DAC5REFL_R6_SIZE                         equ 0001h
DAC5REFL_R6_LENGTH                       equ 0001h
DAC5REFL_R6_MASK                         equ 0040h
DAC5REFL_R7_POSN                         equ 0007h
DAC5REFL_R7_POSITION                     equ 0007h
DAC5REFL_R7_SIZE                         equ 0001h
DAC5REFL_R7_LENGTH                       equ 0001h
DAC5REFL_R7_MASK                         equ 0080h
DAC5REFL_DAC5R0_POSN                     equ 0000h
DAC5REFL_DAC5R0_POSITION                 equ 0000h
DAC5REFL_DAC5R0_SIZE                     equ 0001h
DAC5REFL_DAC5R0_LENGTH                   equ 0001h
DAC5REFL_DAC5R0_MASK                     equ 0001h
DAC5REFL_DAC5R1_POSN                     equ 0001h
DAC5REFL_DAC5R1_POSITION                 equ 0001h
DAC5REFL_DAC5R1_SIZE                     equ 0001h
DAC5REFL_DAC5R1_LENGTH                   equ 0001h
DAC5REFL_DAC5R1_MASK                     equ 0002h
DAC5REFL_DAC5R2_POSN                     equ 0002h
DAC5REFL_DAC5R2_POSITION                 equ 0002h
DAC5REFL_DAC5R2_SIZE                     equ 0001h
DAC5REFL_DAC5R2_LENGTH                   equ 0001h
DAC5REFL_DAC5R2_MASK                     equ 0004h
DAC5REFL_DAC5R3_POSN                     equ 0003h
DAC5REFL_DAC5R3_POSITION                 equ 0003h
DAC5REFL_DAC5R3_SIZE                     equ 0001h
DAC5REFL_DAC5R3_LENGTH                   equ 0001h
DAC5REFL_DAC5R3_MASK                     equ 0008h
DAC5REFL_DAC5R4_POSN                     equ 0004h
DAC5REFL_DAC5R4_POSITION                 equ 0004h
DAC5REFL_DAC5R4_SIZE                     equ 0001h
DAC5REFL_DAC5R4_LENGTH                   equ 0001h
DAC5REFL_DAC5R4_MASK                     equ 0010h
DAC5REFL_DAC5R5_POSN                     equ 0005h
DAC5REFL_DAC5R5_POSITION                 equ 0005h
DAC5REFL_DAC5R5_SIZE                     equ 0001h
DAC5REFL_DAC5R5_LENGTH                   equ 0001h
DAC5REFL_DAC5R5_MASK                     equ 0020h
DAC5REFL_DAC5R6_POSN                     equ 0006h
DAC5REFL_DAC5R6_POSITION                 equ 0006h
DAC5REFL_DAC5R6_SIZE                     equ 0001h
DAC5REFL_DAC5R6_LENGTH                   equ 0001h
DAC5REFL_DAC5R6_MASK                     equ 0040h
DAC5REFL_DAC5R7_POSN                     equ 0007h
DAC5REFL_DAC5R7_POSITION                 equ 0007h
DAC5REFL_DAC5R7_SIZE                     equ 0001h
DAC5REFL_DAC5R7_LENGTH                   equ 0001h
DAC5REFL_DAC5R7_MASK                     equ 0080h

// Register: DAC5REFH
#define DAC5REFH DAC5REFH
DAC5REFH                                 equ 059Ah
// bitfield definitions
DAC5REFH_REF8_POSN                       equ 0000h
DAC5REFH_REF8_POSITION                   equ 0000h
DAC5REFH_REF8_SIZE                       equ 0001h
DAC5REFH_REF8_LENGTH                     equ 0001h
DAC5REFH_REF8_MASK                       equ 0001h
DAC5REFH_REF9_POSN                       equ 0001h
DAC5REFH_REF9_POSITION                   equ 0001h
DAC5REFH_REF9_SIZE                       equ 0001h
DAC5REFH_REF9_LENGTH                     equ 0001h
DAC5REFH_REF9_MASK                       equ 0002h
DAC5REFH_REF10_POSN                      equ 0002h
DAC5REFH_REF10_POSITION                  equ 0002h
DAC5REFH_REF10_SIZE                      equ 0001h
DAC5REFH_REF10_LENGTH                    equ 0001h
DAC5REFH_REF10_MASK                      equ 0004h
DAC5REFH_REF11_POSN                      equ 0003h
DAC5REFH_REF11_POSITION                  equ 0003h
DAC5REFH_REF11_SIZE                      equ 0001h
DAC5REFH_REF11_LENGTH                    equ 0001h
DAC5REFH_REF11_MASK                      equ 0008h
DAC5REFH_REF12_POSN                      equ 0004h
DAC5REFH_REF12_POSITION                  equ 0004h
DAC5REFH_REF12_SIZE                      equ 0001h
DAC5REFH_REF12_LENGTH                    equ 0001h
DAC5REFH_REF12_MASK                      equ 0010h
DAC5REFH_REF13_POSN                      equ 0005h
DAC5REFH_REF13_POSITION                  equ 0005h
DAC5REFH_REF13_SIZE                      equ 0001h
DAC5REFH_REF13_LENGTH                    equ 0001h
DAC5REFH_REF13_MASK                      equ 0020h
DAC5REFH_REF14_POSN                      equ 0006h
DAC5REFH_REF14_POSITION                  equ 0006h
DAC5REFH_REF14_SIZE                      equ 0001h
DAC5REFH_REF14_LENGTH                    equ 0001h
DAC5REFH_REF14_MASK                      equ 0040h
DAC5REFH_REF15_POSN                      equ 0007h
DAC5REFH_REF15_POSITION                  equ 0007h
DAC5REFH_REF15_SIZE                      equ 0001h
DAC5REFH_REF15_LENGTH                    equ 0001h
DAC5REFH_REF15_MASK                      equ 0080h
DAC5REFH_DAC5REF8_POSN                   equ 0000h
DAC5REFH_DAC5REF8_POSITION               equ 0000h
DAC5REFH_DAC5REF8_SIZE                   equ 0001h
DAC5REFH_DAC5REF8_LENGTH                 equ 0001h
DAC5REFH_DAC5REF8_MASK                   equ 0001h
DAC5REFH_DAC5REF9_POSN                   equ 0001h
DAC5REFH_DAC5REF9_POSITION               equ 0001h
DAC5REFH_DAC5REF9_SIZE                   equ 0001h
DAC5REFH_DAC5REF9_LENGTH                 equ 0001h
DAC5REFH_DAC5REF9_MASK                   equ 0002h
DAC5REFH_DAC5REF10_POSN                  equ 0002h
DAC5REFH_DAC5REF10_POSITION              equ 0002h
DAC5REFH_DAC5REF10_SIZE                  equ 0001h
DAC5REFH_DAC5REF10_LENGTH                equ 0001h
DAC5REFH_DAC5REF10_MASK                  equ 0004h
DAC5REFH_DAC5REF11_POSN                  equ 0003h
DAC5REFH_DAC5REF11_POSITION              equ 0003h
DAC5REFH_DAC5REF11_SIZE                  equ 0001h
DAC5REFH_DAC5REF11_LENGTH                equ 0001h
DAC5REFH_DAC5REF11_MASK                  equ 0008h
DAC5REFH_DAC5REF12_POSN                  equ 0004h
DAC5REFH_DAC5REF12_POSITION              equ 0004h
DAC5REFH_DAC5REF12_SIZE                  equ 0001h
DAC5REFH_DAC5REF12_LENGTH                equ 0001h
DAC5REFH_DAC5REF12_MASK                  equ 0010h
DAC5REFH_DAC5REF13_POSN                  equ 0005h
DAC5REFH_DAC5REF13_POSITION              equ 0005h
DAC5REFH_DAC5REF13_SIZE                  equ 0001h
DAC5REFH_DAC5REF13_LENGTH                equ 0001h
DAC5REFH_DAC5REF13_MASK                  equ 0020h
DAC5REFH_DAC5REF14_POSN                  equ 0006h
DAC5REFH_DAC5REF14_POSITION              equ 0006h
DAC5REFH_DAC5REF14_SIZE                  equ 0001h
DAC5REFH_DAC5REF14_LENGTH                equ 0001h
DAC5REFH_DAC5REF14_MASK                  equ 0040h
DAC5REFH_DAC5REF15_POSN                  equ 0007h
DAC5REFH_DAC5REF15_POSITION              equ 0007h
DAC5REFH_DAC5REF15_SIZE                  equ 0001h
DAC5REFH_DAC5REF15_LENGTH                equ 0001h
DAC5REFH_DAC5REF15_MASK                  equ 0080h
DAC5REFH_R8_POSN                         equ 0000h
DAC5REFH_R8_POSITION                     equ 0000h
DAC5REFH_R8_SIZE                         equ 0001h
DAC5REFH_R8_LENGTH                       equ 0001h
DAC5REFH_R8_MASK                         equ 0001h
DAC5REFH_R9_POSN                         equ 0001h
DAC5REFH_R9_POSITION                     equ 0001h
DAC5REFH_R9_SIZE                         equ 0001h
DAC5REFH_R9_LENGTH                       equ 0001h
DAC5REFH_R9_MASK                         equ 0002h
DAC5REFH_R10_POSN                        equ 0002h
DAC5REFH_R10_POSITION                    equ 0002h
DAC5REFH_R10_SIZE                        equ 0001h
DAC5REFH_R10_LENGTH                      equ 0001h
DAC5REFH_R10_MASK                        equ 0004h
DAC5REFH_R11_POSN                        equ 0003h
DAC5REFH_R11_POSITION                    equ 0003h
DAC5REFH_R11_SIZE                        equ 0001h
DAC5REFH_R11_LENGTH                      equ 0001h
DAC5REFH_R11_MASK                        equ 0008h
DAC5REFH_R12_POSN                        equ 0004h
DAC5REFH_R12_POSITION                    equ 0004h
DAC5REFH_R12_SIZE                        equ 0001h
DAC5REFH_R12_LENGTH                      equ 0001h
DAC5REFH_R12_MASK                        equ 0010h
DAC5REFH_R13_POSN                        equ 0005h
DAC5REFH_R13_POSITION                    equ 0005h
DAC5REFH_R13_SIZE                        equ 0001h
DAC5REFH_R13_LENGTH                      equ 0001h
DAC5REFH_R13_MASK                        equ 0020h
DAC5REFH_R14_POSN                        equ 0006h
DAC5REFH_R14_POSITION                    equ 0006h
DAC5REFH_R14_SIZE                        equ 0001h
DAC5REFH_R14_LENGTH                      equ 0001h
DAC5REFH_R14_MASK                        equ 0040h
DAC5REFH_R15_POSN                        equ 0007h
DAC5REFH_R15_POSITION                    equ 0007h
DAC5REFH_R15_SIZE                        equ 0001h
DAC5REFH_R15_LENGTH                      equ 0001h
DAC5REFH_R15_MASK                        equ 0080h
DAC5REFH_DAC5R8_POSN                     equ 0000h
DAC5REFH_DAC5R8_POSITION                 equ 0000h
DAC5REFH_DAC5R8_SIZE                     equ 0001h
DAC5REFH_DAC5R8_LENGTH                   equ 0001h
DAC5REFH_DAC5R8_MASK                     equ 0001h
DAC5REFH_DAC5R9_POSN                     equ 0001h
DAC5REFH_DAC5R9_POSITION                 equ 0001h
DAC5REFH_DAC5R9_SIZE                     equ 0001h
DAC5REFH_DAC5R9_LENGTH                   equ 0001h
DAC5REFH_DAC5R9_MASK                     equ 0002h
DAC5REFH_DAC5R10_POSN                    equ 0002h
DAC5REFH_DAC5R10_POSITION                equ 0002h
DAC5REFH_DAC5R10_SIZE                    equ 0001h
DAC5REFH_DAC5R10_LENGTH                  equ 0001h
DAC5REFH_DAC5R10_MASK                    equ 0004h
DAC5REFH_DAC5R11_POSN                    equ 0003h
DAC5REFH_DAC5R11_POSITION                equ 0003h
DAC5REFH_DAC5R11_SIZE                    equ 0001h
DAC5REFH_DAC5R11_LENGTH                  equ 0001h
DAC5REFH_DAC5R11_MASK                    equ 0008h
DAC5REFH_DAC5R12_POSN                    equ 0004h
DAC5REFH_DAC5R12_POSITION                equ 0004h
DAC5REFH_DAC5R12_SIZE                    equ 0001h
DAC5REFH_DAC5R12_LENGTH                  equ 0001h
DAC5REFH_DAC5R12_MASK                    equ 0010h
DAC5REFH_DAC5R13_POSN                    equ 0005h
DAC5REFH_DAC5R13_POSITION                equ 0005h
DAC5REFH_DAC5R13_SIZE                    equ 0001h
DAC5REFH_DAC5R13_LENGTH                  equ 0001h
DAC5REFH_DAC5R13_MASK                    equ 0020h
DAC5REFH_DAC5R14_POSN                    equ 0006h
DAC5REFH_DAC5R14_POSITION                equ 0006h
DAC5REFH_DAC5R14_SIZE                    equ 0001h
DAC5REFH_DAC5R14_LENGTH                  equ 0001h
DAC5REFH_DAC5R14_MASK                    equ 0040h
DAC5REFH_DAC5R15_POSN                    equ 0007h
DAC5REFH_DAC5R15_POSITION                equ 0007h
DAC5REFH_DAC5R15_SIZE                    equ 0001h
DAC5REFH_DAC5R15_LENGTH                  equ 0001h
DAC5REFH_DAC5R15_MASK                    equ 0080h

