GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: DAC6CON0
#define DAC6CON0 DAC6CON0
DAC6CON0                                 equ 059Bh
// bitfield definitions
DAC6CON0_NSS_POSN                        equ 0000h
DAC6CON0_NSS_POSITION                    equ 0000h
DAC6CON0_NSS_SIZE                        equ 0002h
DAC6CON0_NSS_LENGTH                      equ 0002h
DAC6CON0_NSS_MASK                        equ 0003h
DAC6CON0_PSS_POSN                        equ 0002h
DAC6CON0_PSS_POSITION                    equ 0002h
DAC6CON0_PSS_SIZE                        equ 0002h
DAC6CON0_PSS_LENGTH                      equ 0002h
DAC6CON0_PSS_MASK                        equ 000Ch
DAC6CON0_OE2_POSN                        equ 0004h
DAC6CON0_OE2_POSITION                    equ 0004h
DAC6CON0_OE2_SIZE                        equ 0001h
DAC6CON0_OE2_LENGTH                      equ 0001h
DAC6CON0_OE2_MASK                        equ 0010h
DAC6CON0_OE1_POSN                        equ 0005h
DAC6CON0_OE1_POSITION                    equ 0005h
DAC6CON0_OE1_SIZE                        equ 0001h
DAC6CON0_OE1_LENGTH                      equ 0001h
DAC6CON0_OE1_MASK                        equ 0020h
DAC6CON0_FM_POSN                         equ 0006h
DAC6CON0_FM_POSITION                     equ 0006h
DAC6CON0_FM_SIZE                         equ 0001h
DAC6CON0_FM_LENGTH                       equ 0001h
DAC6CON0_FM_MASK                         equ 0040h
DAC6CON0_EN_POSN                         equ 0007h
DAC6CON0_EN_POSITION                     equ 0007h
DAC6CON0_EN_SIZE                         equ 0001h
DAC6CON0_EN_LENGTH                       equ 0001h
DAC6CON0_EN_MASK                         equ 0080h
DAC6CON0_NSS0_POSN                       equ 0000h
DAC6CON0_NSS0_POSITION                   equ 0000h
DAC6CON0_NSS0_SIZE                       equ 0001h
DAC6CON0_NSS0_LENGTH                     equ 0001h
DAC6CON0_NSS0_MASK                       equ 0001h
DAC6CON0_NSS1_POSN                       equ 0001h
DAC6CON0_NSS1_POSITION                   equ 0001h
DAC6CON0_NSS1_SIZE                       equ 0001h
DAC6CON0_NSS1_LENGTH                     equ 0001h
DAC6CON0_NSS1_MASK                       equ 0002h
DAC6CON0_PSS0_POSN                       equ 0002h
DAC6CON0_PSS0_POSITION                   equ 0002h
DAC6CON0_PSS0_SIZE                       equ 0001h
DAC6CON0_PSS0_LENGTH                     equ 0001h
DAC6CON0_PSS0_MASK                       equ 0004h
DAC6CON0_PSS1_POSN                       equ 0003h
DAC6CON0_PSS1_POSITION                   equ 0003h
DAC6CON0_PSS1_SIZE                       equ 0001h
DAC6CON0_PSS1_LENGTH                     equ 0001h
DAC6CON0_PSS1_MASK                       equ 0008h
DAC6CON0_OE_POSN                         equ 0005h
DAC6CON0_OE_POSITION                     equ 0005h
DAC6CON0_OE_SIZE                         equ 0001h
DAC6CON0_OE_LENGTH                       equ 0001h
DAC6CON0_OE_MASK                         equ 0020h
DAC6CON0_DACNSS_POSN                     equ 0000h
DAC6CON0_DACNSS_POSITION                 equ 0000h
DAC6CON0_DACNSS_SIZE                     equ 0002h
DAC6CON0_DACNSS_LENGTH                   equ 0002h
DAC6CON0_DACNSS_MASK                     equ 0003h
DAC6CON0_DACPSS_POSN                     equ 0002h
DAC6CON0_DACPSS_POSITION                 equ 0002h
DAC6CON0_DACPSS_SIZE                     equ 0002h
DAC6CON0_DACPSS_LENGTH                   equ 0002h
DAC6CON0_DACPSS_MASK                     equ 000Ch
DAC6CON0_DACOE2_POSN                     equ 0004h
DAC6CON0_DACOE2_POSITION                 equ 0004h
DAC6CON0_DACOE2_SIZE                     equ 0001h
DAC6CON0_DACOE2_LENGTH                   equ 0001h
DAC6CON0_DACOE2_MASK                     equ 0010h
DAC6CON0_DACOE1_POSN                     equ 0005h
DAC6CON0_DACOE1_POSITION                 equ 0005h
DAC6CON0_DACOE1_SIZE                     equ 0001h
DAC6CON0_DACOE1_LENGTH                   equ 0001h
DAC6CON0_DACOE1_MASK                     equ 0020h
DAC6CON0_DACFM_POSN                      equ 0006h
DAC6CON0_DACFM_POSITION                  equ 0006h
DAC6CON0_DACFM_SIZE                      equ 0001h
DAC6CON0_DACFM_LENGTH                    equ 0001h
DAC6CON0_DACFM_MASK                      equ 0040h
DAC6CON0_DACEN_POSN                      equ 0007h
DAC6CON0_DACEN_POSITION                  equ 0007h
DAC6CON0_DACEN_SIZE                      equ 0001h
DAC6CON0_DACEN_LENGTH                    equ 0001h
DAC6CON0_DACEN_MASK                      equ 0080h
DAC6CON0_DACNSS0_POSN                    equ 0000h
DAC6CON0_DACNSS0_POSITION                equ 0000h
DAC6CON0_DACNSS0_SIZE                    equ 0001h
DAC6CON0_DACNSS0_LENGTH                  equ 0001h
DAC6CON0_DACNSS0_MASK                    equ 0001h
DAC6CON0_DACNSS1_POSN                    equ 0001h
DAC6CON0_DACNSS1_POSITION                equ 0001h
DAC6CON0_DACNSS1_SIZE                    equ 0001h
DAC6CON0_DACNSS1_LENGTH                  equ 0001h
DAC6CON0_DACNSS1_MASK                    equ 0002h
DAC6CON0_DACPSS0_POSN                    equ 0002h
DAC6CON0_DACPSS0_POSITION                equ 0002h
DAC6CON0_DACPSS0_SIZE                    equ 0001h
DAC6CON0_DACPSS0_LENGTH                  equ 0001h
DAC6CON0_DACPSS0_MASK                    equ 0004h
DAC6CON0_DACPSS1_POSN                    equ 0003h
DAC6CON0_DACPSS1_POSITION                equ 0003h
DAC6CON0_DACPSS1_SIZE                    equ 0001h
DAC6CON0_DACPSS1_LENGTH                  equ 0001h
DAC6CON0_DACPSS1_MASK                    equ 0008h
DAC6CON0_DACOE_POSN                      equ 0005h
DAC6CON0_DACOE_POSITION                  equ 0005h
DAC6CON0_DACOE_SIZE                      equ 0001h
DAC6CON0_DACOE_LENGTH                    equ 0001h
DAC6CON0_DACOE_MASK                      equ 0020h
DAC6CON0_DAC6NSS_POSN                    equ 0000h
DAC6CON0_DAC6NSS_POSITION                equ 0000h
DAC6CON0_DAC6NSS_SIZE                    equ 0002h
DAC6CON0_DAC6NSS_LENGTH                  equ 0002h
DAC6CON0_DAC6NSS_MASK                    equ 0003h
DAC6CON0_DAC6PSS_POSN                    equ 0002h
DAC6CON0_DAC6PSS_POSITION                equ 0002h
DAC6CON0_DAC6PSS_SIZE                    equ 0002h
DAC6CON0_DAC6PSS_LENGTH                  equ 0002h
DAC6CON0_DAC6PSS_MASK                    equ 000Ch
DAC6CON0_DAC6OE2_POSN                    equ 0004h
DAC6CON0_DAC6OE2_POSITION                equ 0004h
DAC6CON0_DAC6OE2_SIZE                    equ 0001h
DAC6CON0_DAC6OE2_LENGTH                  equ 0001h
DAC6CON0_DAC6OE2_MASK                    equ 0010h
DAC6CON0_DAC6OE1_POSN                    equ 0005h
DAC6CON0_DAC6OE1_POSITION                equ 0005h
DAC6CON0_DAC6OE1_SIZE                    equ 0001h
DAC6CON0_DAC6OE1_LENGTH                  equ 0001h
DAC6CON0_DAC6OE1_MASK                    equ 0020h
DAC6CON0_DAC6FM_POSN                     equ 0006h
DAC6CON0_DAC6FM_POSITION                 equ 0006h
DAC6CON0_DAC6FM_SIZE                     equ 0001h
DAC6CON0_DAC6FM_LENGTH                   equ 0001h
DAC6CON0_DAC6FM_MASK                     equ 0040h
DAC6CON0_DAC6EN_POSN                     equ 0007h
DAC6CON0_DAC6EN_POSITION                 equ 0007h
DAC6CON0_DAC6EN_SIZE                     equ 0001h
DAC6CON0_DAC6EN_LENGTH                   equ 0001h
DAC6CON0_DAC6EN_MASK                     equ 0080h
DAC6CON0_DAC6NSS0_POSN                   equ 0000h
DAC6CON0_DAC6NSS0_POSITION               equ 0000h
DAC6CON0_DAC6NSS0_SIZE                   equ 0001h
DAC6CON0_DAC6NSS0_LENGTH                 equ 0001h
DAC6CON0_DAC6NSS0_MASK                   equ 0001h
DAC6CON0_DAC6NSS1_POSN                   equ 0001h
DAC6CON0_DAC6NSS1_POSITION               equ 0001h
DAC6CON0_DAC6NSS1_SIZE                   equ 0001h
DAC6CON0_DAC6NSS1_LENGTH                 equ 0001h
DAC6CON0_DAC6NSS1_MASK                   equ 0002h
DAC6CON0_DAC6PSS0_POSN                   equ 0002h
DAC6CON0_DAC6PSS0_POSITION               equ 0002h
DAC6CON0_DAC6PSS0_SIZE                   equ 0001h
DAC6CON0_DAC6PSS0_LENGTH                 equ 0001h
DAC6CON0_DAC6PSS0_MASK                   equ 0004h
DAC6CON0_DAC6PSS1_POSN                   equ 0003h
DAC6CON0_DAC6PSS1_POSITION               equ 0003h
DAC6CON0_DAC6PSS1_SIZE                   equ 0001h
DAC6CON0_DAC6PSS1_LENGTH                 equ 0001h
DAC6CON0_DAC6PSS1_MASK                   equ 0008h

