GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: DAC6REFL
#define DAC6REFL DAC6REFL
DAC6REFL                                 equ 059Ch
// bitfield definitions
DAC6REFL_REF0_POSN                       equ 0000h
DAC6REFL_REF0_POSITION                   equ 0000h
DAC6REFL_REF0_SIZE                       equ 0001h
DAC6REFL_REF0_LENGTH                     equ 0001h
DAC6REFL_REF0_MASK                       equ 0001h
DAC6REFL_REF1_POSN                       equ 0001h
DAC6REFL_REF1_POSITION                   equ 0001h
DAC6REFL_REF1_SIZE                       equ 0001h
DAC6REFL_REF1_LENGTH                     equ 0001h
DAC6REFL_REF1_MASK                       equ 0002h
DAC6REFL_REF2_POSN                       equ 0002h
DAC6REFL_REF2_POSITION                   equ 0002h
DAC6REFL_REF2_SIZE                       equ 0001h
DAC6REFL_REF2_LENGTH                     equ 0001h
DAC6REFL_REF2_MASK                       equ 0004h
DAC6REFL_REF3_POSN                       equ 0003h
DAC6REFL_REF3_POSITION                   equ 0003h
DAC6REFL_REF3_SIZE                       equ 0001h
DAC6REFL_REF3_LENGTH                     equ 0001h
DAC6REFL_REF3_MASK                       equ 0008h
DAC6REFL_REF4_POSN                       equ 0004h
DAC6REFL_REF4_POSITION                   equ 0004h
DAC6REFL_REF4_SIZE                       equ 0001h
DAC6REFL_REF4_LENGTH                     equ 0001h
DAC6REFL_REF4_MASK                       equ 0010h
DAC6REFL_REF5_POSN                       equ 0005h
DAC6REFL_REF5_POSITION                   equ 0005h
DAC6REFL_REF5_SIZE                       equ 0001h
DAC6REFL_REF5_LENGTH                     equ 0001h
DAC6REFL_REF5_MASK                       equ 0020h
DAC6REFL_REF6_POSN                       equ 0006h
DAC6REFL_REF6_POSITION                   equ 0006h
DAC6REFL_REF6_SIZE                       equ 0001h
DAC6REFL_REF6_LENGTH                     equ 0001h
DAC6REFL_REF6_MASK                       equ 0040h
DAC6REFL_REF7_POSN                       equ 0007h
DAC6REFL_REF7_POSITION                   equ 0007h
DAC6REFL_REF7_SIZE                       equ 0001h
DAC6REFL_REF7_LENGTH                     equ 0001h
DAC6REFL_REF7_MASK                       equ 0080h
DAC6REFL_DAC6REF0_POSN                   equ 0000h
DAC6REFL_DAC6REF0_POSITION               equ 0000h
DAC6REFL_DAC6REF0_SIZE                   equ 0001h
DAC6REFL_DAC6REF0_LENGTH                 equ 0001h
DAC6REFL_DAC6REF0_MASK                   equ 0001h
DAC6REFL_DAC6REF1_POSN                   equ 0001h
DAC6REFL_DAC6REF1_POSITION               equ 0001h
DAC6REFL_DAC6REF1_SIZE                   equ 0001h
DAC6REFL_DAC6REF1_LENGTH                 equ 0001h
DAC6REFL_DAC6REF1_MASK                   equ 0002h
DAC6REFL_DAC6REF2_POSN                   equ 0002h
DAC6REFL_DAC6REF2_POSITION               equ 0002h
DAC6REFL_DAC6REF2_SIZE                   equ 0001h
DAC6REFL_DAC6REF2_LENGTH                 equ 0001h
DAC6REFL_DAC6REF2_MASK                   equ 0004h
DAC6REFL_DAC6REF3_POSN                   equ 0003h
DAC6REFL_DAC6REF3_POSITION               equ 0003h
DAC6REFL_DAC6REF3_SIZE                   equ 0001h
DAC6REFL_DAC6REF3_LENGTH                 equ 0001h
DAC6REFL_DAC6REF3_MASK                   equ 0008h
DAC6REFL_DAC6REF4_POSN                   equ 0004h
DAC6REFL_DAC6REF4_POSITION               equ 0004h
DAC6REFL_DAC6REF4_SIZE                   equ 0001h
DAC6REFL_DAC6REF4_LENGTH                 equ 0001h
DAC6REFL_DAC6REF4_MASK                   equ 0010h
DAC6REFL_DAC6REF5_POSN                   equ 0005h
DAC6REFL_DAC6REF5_POSITION               equ 0005h
DAC6REFL_DAC6REF5_SIZE                   equ 0001h
DAC6REFL_DAC6REF5_LENGTH                 equ 0001h
DAC6REFL_DAC6REF5_MASK                   equ 0020h
DAC6REFL_DAC6REF6_POSN                   equ 0006h
DAC6REFL_DAC6REF6_POSITION               equ 0006h
DAC6REFL_DAC6REF6_SIZE                   equ 0001h
DAC6REFL_DAC6REF6_LENGTH                 equ 0001h
DAC6REFL_DAC6REF6_MASK                   equ 0040h
DAC6REFL_DAC6REF7_POSN                   equ 0007h
DAC6REFL_DAC6REF7_POSITION               equ 0007h
DAC6REFL_DAC6REF7_SIZE                   equ 0001h
DAC6REFL_DAC6REF7_LENGTH                 equ 0001h
DAC6REFL_DAC6REF7_MASK                   equ 0080h
DAC6REFL_R0_POSN                         equ 0000h
DAC6REFL_R0_POSITION                     equ 0000h
DAC6REFL_R0_SIZE                         equ 0001h
DAC6REFL_R0_LENGTH                       equ 0001h
DAC6REFL_R0_MASK                         equ 0001h
DAC6REFL_R1_POSN                         equ 0001h
DAC6REFL_R1_POSITION                     equ 0001h
DAC6REFL_R1_SIZE                         equ 0001h
DAC6REFL_R1_LENGTH                       equ 0001h
DAC6REFL_R1_MASK                         equ 0002h
DAC6REFL_R2_POSN                         equ 0002h
DAC6REFL_R2_POSITION                     equ 0002h
DAC6REFL_R2_SIZE                         equ 0001h
DAC6REFL_R2_LENGTH                       equ 0001h
DAC6REFL_R2_MASK                         equ 0004h
DAC6REFL_R3_POSN                         equ 0003h
DAC6REFL_R3_POSITION                     equ 0003h
DAC6REFL_R3_SIZE                         equ 0001h
DAC6REFL_R3_LENGTH                       equ 0001h
DAC6REFL_R3_MASK                         equ 0008h
DAC6REFL_R4_POSN                         equ 0004h
DAC6REFL_R4_POSITION                     equ 0004h
DAC6REFL_R4_SIZE                         equ 0001h
DAC6REFL_R4_LENGTH                       equ 0001h
DAC6REFL_R4_MASK                         equ 0010h
DAC6REFL_R5_POSN                         equ 0005h
DAC6REFL_R5_POSITION                     equ 0005h
DAC6REFL_R5_SIZE                         equ 0001h
DAC6REFL_R5_LENGTH                       equ 0001h
DAC6REFL_R5_MASK                         equ 0020h
DAC6REFL_R6_POSN                         equ 0006h
DAC6REFL_R6_POSITION                     equ 0006h
DAC6REFL_R6_SIZE                         equ 0001h
DAC6REFL_R6_LENGTH                       equ 0001h
DAC6REFL_R6_MASK                         equ 0040h
DAC6REFL_R7_POSN                         equ 0007h
DAC6REFL_R7_POSITION                     equ 0007h
DAC6REFL_R7_SIZE                         equ 0001h
DAC6REFL_R7_LENGTH                       equ 0001h
DAC6REFL_R7_MASK                         equ 0080h
DAC6REFL_DAC6R0_POSN                     equ 0000h
DAC6REFL_DAC6R0_POSITION                 equ 0000h
DAC6REFL_DAC6R0_SIZE                     equ 0001h
DAC6REFL_DAC6R0_LENGTH                   equ 0001h
DAC6REFL_DAC6R0_MASK                     equ 0001h
DAC6REFL_DAC6R1_POSN                     equ 0001h
DAC6REFL_DAC6R1_POSITION                 equ 0001h
DAC6REFL_DAC6R1_SIZE                     equ 0001h
DAC6REFL_DAC6R1_LENGTH                   equ 0001h
DAC6REFL_DAC6R1_MASK                     equ 0002h
DAC6REFL_DAC6R2_POSN                     equ 0002h
DAC6REFL_DAC6R2_POSITION                 equ 0002h
DAC6REFL_DAC6R2_SIZE                     equ 0001h
DAC6REFL_DAC6R2_LENGTH                   equ 0001h
DAC6REFL_DAC6R2_MASK                     equ 0004h
DAC6REFL_DAC6R3_POSN                     equ 0003h
DAC6REFL_DAC6R3_POSITION                 equ 0003h
DAC6REFL_DAC6R3_SIZE                     equ 0001h
DAC6REFL_DAC6R3_LENGTH                   equ 0001h
DAC6REFL_DAC6R3_MASK                     equ 0008h
DAC6REFL_DAC6R4_POSN                     equ 0004h
DAC6REFL_DAC6R4_POSITION                 equ 0004h
DAC6REFL_DAC6R4_SIZE                     equ 0001h
DAC6REFL_DAC6R4_LENGTH                   equ 0001h
DAC6REFL_DAC6R4_MASK                     equ 0010h
DAC6REFL_DAC6R5_POSN                     equ 0005h
DAC6REFL_DAC6R5_POSITION                 equ 0005h
DAC6REFL_DAC6R5_SIZE                     equ 0001h
DAC6REFL_DAC6R5_LENGTH                   equ 0001h
DAC6REFL_DAC6R5_MASK                     equ 0020h
DAC6REFL_DAC6R6_POSN                     equ 0006h
DAC6REFL_DAC6R6_POSITION                 equ 0006h
DAC6REFL_DAC6R6_SIZE                     equ 0001h
DAC6REFL_DAC6R6_LENGTH                   equ 0001h
DAC6REFL_DAC6R6_MASK                     equ 0040h
DAC6REFL_DAC6R7_POSN                     equ 0007h
DAC6REFL_DAC6R7_POSITION                 equ 0007h
DAC6REFL_DAC6R7_SIZE                     equ 0001h
DAC6REFL_DAC6R7_LENGTH                   equ 0001h
DAC6REFL_DAC6R7_MASK                     equ 0080h

// Register: DAC6REFH
#define DAC6REFH DAC6REFH
DAC6REFH                                 equ 059Dh
// bitfield definitions
DAC6REFH_REF8_POSN                       equ 0000h
DAC6REFH_REF8_POSITION                   equ 0000h
DAC6REFH_REF8_SIZE                       equ 0001h
DAC6REFH_REF8_LENGTH                     equ 0001h
DAC6REFH_REF8_MASK                       equ 0001h
DAC6REFH_REF9_POSN                       equ 0001h
DAC6REFH_REF9_POSITION                   equ 0001h
DAC6REFH_REF9_SIZE                       equ 0001h
DAC6REFH_REF9_LENGTH                     equ 0001h
DAC6REFH_REF9_MASK                       equ 0002h
DAC6REFH_REF10_POSN                      equ 0002h
DAC6REFH_REF10_POSITION                  equ 0002h
DAC6REFH_REF10_SIZE                      equ 0001h
DAC6REFH_REF10_LENGTH                    equ 0001h
DAC6REFH_REF10_MASK                      equ 0004h
DAC6REFH_REF11_POSN                      equ 0003h
DAC6REFH_REF11_POSITION                  equ 0003h
DAC6REFH_REF11_SIZE                      equ 0001h
DAC6REFH_REF11_LENGTH                    equ 0001h
DAC6REFH_REF11_MASK                      equ 0008h
DAC6REFH_REF12_POSN                      equ 0004h
DAC6REFH_REF12_POSITION                  equ 0004h
DAC6REFH_REF12_SIZE                      equ 0001h
DAC6REFH_REF12_LENGTH                    equ 0001h
DAC6REFH_REF12_MASK                      equ 0010h
DAC6REFH_REF13_POSN                      equ 0005h
DAC6REFH_REF13_POSITION                  equ 0005h
DAC6REFH_REF13_SIZE                      equ 0001h
DAC6REFH_REF13_LENGTH                    equ 0001h
DAC6REFH_REF13_MASK                      equ 0020h
DAC6REFH_REF14_POSN                      equ 0006h
DAC6REFH_REF14_POSITION                  equ 0006h
DAC6REFH_REF14_SIZE                      equ 0001h
DAC6REFH_REF14_LENGTH                    equ 0001h
DAC6REFH_REF14_MASK                      equ 0040h
DAC6REFH_REF15_POSN                      equ 0007h
DAC6REFH_REF15_POSITION                  equ 0007h
DAC6REFH_REF15_SIZE                      equ 0001h
DAC6REFH_REF15_LENGTH                    equ 0001h
DAC6REFH_REF15_MASK                      equ 0080h
DAC6REFH_DAC6REF8_POSN                   equ 0000h
DAC6REFH_DAC6REF8_POSITION               equ 0000h
DAC6REFH_DAC6REF8_SIZE                   equ 0001h
DAC6REFH_DAC6REF8_LENGTH                 equ 0001h
DAC6REFH_DAC6REF8_MASK                   equ 0001h
DAC6REFH_DAC6REF9_POSN                   equ 0001h
DAC6REFH_DAC6REF9_POSITION               equ 0001h
DAC6REFH_DAC6REF9_SIZE                   equ 0001h
DAC6REFH_DAC6REF9_LENGTH                 equ 0001h
DAC6REFH_DAC6REF9_MASK                   equ 0002h
DAC6REFH_DAC6REF10_POSN                  equ 0002h
DAC6REFH_DAC6REF10_POSITION              equ 0002h
DAC6REFH_DAC6REF10_SIZE                  equ 0001h
DAC6REFH_DAC6REF10_LENGTH                equ 0001h
DAC6REFH_DAC6REF10_MASK                  equ 0004h
DAC6REFH_DAC6REF11_POSN                  equ 0003h
DAC6REFH_DAC6REF11_POSITION              equ 0003h
DAC6REFH_DAC6REF11_SIZE                  equ 0001h
DAC6REFH_DAC6REF11_LENGTH                equ 0001h
DAC6REFH_DAC6REF11_MASK                  equ 0008h
DAC6REFH_DAC6REF12_POSN                  equ 0004h
DAC6REFH_DAC6REF12_POSITION              equ 0004h
DAC6REFH_DAC6REF12_SIZE                  equ 0001h
DAC6REFH_DAC6REF12_LENGTH                equ 0001h
DAC6REFH_DAC6REF12_MASK                  equ 0010h
DAC6REFH_DAC6REF13_POSN                  equ 0005h
DAC6REFH_DAC6REF13_POSITION              equ 0005h
DAC6REFH_DAC6REF13_SIZE                  equ 0001h
DAC6REFH_DAC6REF13_LENGTH                equ 0001h
DAC6REFH_DAC6REF13_MASK                  equ 0020h
DAC6REFH_DAC6REF14_POSN                  equ 0006h
DAC6REFH_DAC6REF14_POSITION              equ 0006h
DAC6REFH_DAC6REF14_SIZE                  equ 0001h
DAC6REFH_DAC6REF14_LENGTH                equ 0001h
DAC6REFH_DAC6REF14_MASK                  equ 0040h
DAC6REFH_DAC6REF15_POSN                  equ 0007h
DAC6REFH_DAC6REF15_POSITION              equ 0007h
DAC6REFH_DAC6REF15_SIZE                  equ 0001h
DAC6REFH_DAC6REF15_LENGTH                equ 0001h
DAC6REFH_DAC6REF15_MASK                  equ 0080h
DAC6REFH_R8_POSN                         equ 0000h
DAC6REFH_R8_POSITION                     equ 0000h
DAC6REFH_R8_SIZE                         equ 0001h
DAC6REFH_R8_LENGTH                       equ 0001h
DAC6REFH_R8_MASK                         equ 0001h
DAC6REFH_R9_POSN                         equ 0001h
DAC6REFH_R9_POSITION                     equ 0001h
DAC6REFH_R9_SIZE                         equ 0001h
DAC6REFH_R9_LENGTH                       equ 0001h
DAC6REFH_R9_MASK                         equ 0002h
DAC6REFH_R10_POSN                        equ 0002h
DAC6REFH_R10_POSITION                    equ 0002h
DAC6REFH_R10_SIZE                        equ 0001h
DAC6REFH_R10_LENGTH                      equ 0001h
DAC6REFH_R10_MASK                        equ 0004h
DAC6REFH_R11_POSN                        equ 0003h
DAC6REFH_R11_POSITION                    equ 0003h
DAC6REFH_R11_SIZE                        equ 0001h
DAC6REFH_R11_LENGTH                      equ 0001h
DAC6REFH_R11_MASK                        equ 0008h
DAC6REFH_R12_POSN                        equ 0004h
DAC6REFH_R12_POSITION                    equ 0004h
DAC6REFH_R12_SIZE                        equ 0001h
DAC6REFH_R12_LENGTH                      equ 0001h
DAC6REFH_R12_MASK                        equ 0010h
DAC6REFH_R13_POSN                        equ 0005h
DAC6REFH_R13_POSITION                    equ 0005h
DAC6REFH_R13_SIZE                        equ 0001h
DAC6REFH_R13_LENGTH                      equ 0001h
DAC6REFH_R13_MASK                        equ 0020h
DAC6REFH_R14_POSN                        equ 0006h
DAC6REFH_R14_POSITION                    equ 0006h
DAC6REFH_R14_SIZE                        equ 0001h
DAC6REFH_R14_LENGTH                      equ 0001h
DAC6REFH_R14_MASK                        equ 0040h
DAC6REFH_R15_POSN                        equ 0007h
DAC6REFH_R15_POSITION                    equ 0007h
DAC6REFH_R15_SIZE                        equ 0001h
DAC6REFH_R15_LENGTH                      equ 0001h
DAC6REFH_R15_MASK                        equ 0080h
DAC6REFH_DAC6R8_POSN                     equ 0000h
DAC6REFH_DAC6R8_POSITION                 equ 0000h
DAC6REFH_DAC6R8_SIZE                     equ 0001h
DAC6REFH_DAC6R8_LENGTH                   equ 0001h
DAC6REFH_DAC6R8_MASK                     equ 0001h
DAC6REFH_DAC6R9_POSN                     equ 0001h
DAC6REFH_DAC6R9_POSITION                 equ 0001h
DAC6REFH_DAC6R9_SIZE                     equ 0001h
DAC6REFH_DAC6R9_LENGTH                   equ 0001h
DAC6REFH_DAC6R9_MASK                     equ 0002h
DAC6REFH_DAC6R10_POSN                    equ 0002h
DAC6REFH_DAC6R10_POSITION                equ 0002h
DAC6REFH_DAC6R10_SIZE                    equ 0001h
DAC6REFH_DAC6R10_LENGTH                  equ 0001h
DAC6REFH_DAC6R10_MASK                    equ 0004h
DAC6REFH_DAC6R11_POSN                    equ 0003h
DAC6REFH_DAC6R11_POSITION                equ 0003h
DAC6REFH_DAC6R11_SIZE                    equ 0001h
DAC6REFH_DAC6R11_LENGTH                  equ 0001h
DAC6REFH_DAC6R11_MASK                    equ 0008h
DAC6REFH_DAC6R12_POSN                    equ 0004h
DAC6REFH_DAC6R12_POSITION                equ 0004h
DAC6REFH_DAC6R12_SIZE                    equ 0001h
DAC6REFH_DAC6R12_LENGTH                  equ 0001h
DAC6REFH_DAC6R12_MASK                    equ 0010h
DAC6REFH_DAC6R13_POSN                    equ 0005h
DAC6REFH_DAC6R13_POSITION                equ 0005h
DAC6REFH_DAC6R13_SIZE                    equ 0001h
DAC6REFH_DAC6R13_LENGTH                  equ 0001h
DAC6REFH_DAC6R13_MASK                    equ 0020h
DAC6REFH_DAC6R14_POSN                    equ 0006h
DAC6REFH_DAC6R14_POSITION                equ 0006h
DAC6REFH_DAC6R14_SIZE                    equ 0001h
DAC6REFH_DAC6R14_LENGTH                  equ 0001h
DAC6REFH_DAC6R14_MASK                    equ 0040h
DAC6REFH_DAC6R15_POSN                    equ 0007h
DAC6REFH_DAC6R15_POSITION                equ 0007h
DAC6REFH_DAC6R15_SIZE                    equ 0001h
DAC6REFH_DAC6R15_LENGTH                  equ 0001h
DAC6REFH_DAC6R15_MASK                    equ 0080h

// Register: DAC7CON0
#define DAC7CON0 DAC7CON0
DAC7CON0                                 equ 059Eh
// bitfield definitions
DAC7CON0_NSS_POSN                        equ 0000h
DAC7CON0_NSS_POSITION                    equ 0000h
DAC7CON0_NSS_SIZE                        equ 0002h
DAC7CON0_NSS_LENGTH                      equ 0002h
DAC7CON0_NSS_MASK                        equ 0003h
DAC7CON0_PSS_POSN                        equ 0002h
DAC7CON0_PSS_POSITION                    equ 0002h
DAC7CON0_PSS_SIZE                        equ 0002h
DAC7CON0_PSS_LENGTH                      equ 0002h
DAC7CON0_PSS_MASK                        equ 000Ch
DAC7CON0_OE2_POSN                        equ 0004h
DAC7CON0_OE2_POSITION                    equ 0004h
DAC7CON0_OE2_SIZE                        equ 0001h
DAC7CON0_OE2_LENGTH                      equ 0001h
DAC7CON0_OE2_MASK                        equ 0010h
DAC7CON0_OE1_POSN                        equ 0005h
DAC7CON0_OE1_POSITION                    equ 0005h
DAC7CON0_OE1_SIZE                        equ 0001h
DAC7CON0_OE1_LENGTH                      equ 0001h
DAC7CON0_OE1_MASK                        equ 0020h
DAC7CON0_EN_POSN                         equ 0007h
DAC7CON0_EN_POSITION                     equ 0007h
DAC7CON0_EN_SIZE                         equ 0001h
DAC7CON0_EN_LENGTH                       equ 0001h
DAC7CON0_EN_MASK                         equ 0080h
DAC7CON0_NSS0_POSN                       equ 0000h
DAC7CON0_NSS0_POSITION                   equ 0000h
DAC7CON0_NSS0_SIZE                       equ 0001h
DAC7CON0_NSS0_LENGTH                     equ 0001h
DAC7CON0_NSS0_MASK                       equ 0001h
DAC7CON0_NSS1_POSN                       equ 0001h
DAC7CON0_NSS1_POSITION                   equ 0001h
DAC7CON0_NSS1_SIZE                       equ 0001h
DAC7CON0_NSS1_LENGTH                     equ 0001h
DAC7CON0_NSS1_MASK                       equ 0002h
DAC7CON0_PSS0_POSN                       equ 0002h
DAC7CON0_PSS0_POSITION                   equ 0002h
DAC7CON0_PSS0_SIZE                       equ 0001h
DAC7CON0_PSS0_LENGTH                     equ 0001h
DAC7CON0_PSS0_MASK                       equ 0004h
DAC7CON0_PSS1_POSN                       equ 0003h
DAC7CON0_PSS1_POSITION                   equ 0003h
DAC7CON0_PSS1_SIZE                       equ 0001h
DAC7CON0_PSS1_LENGTH                     equ 0001h
DAC7CON0_PSS1_MASK                       equ 0008h
DAC7CON0_DACNSS_POSN                     equ 0000h
DAC7CON0_DACNSS_POSITION                 equ 0000h
DAC7CON0_DACNSS_SIZE                     equ 0002h
DAC7CON0_DACNSS_LENGTH                   equ 0002h
DAC7CON0_DACNSS_MASK                     equ 0003h
DAC7CON0_DACPSS_POSN                     equ 0002h
DAC7CON0_DACPSS_POSITION                 equ 0002h
DAC7CON0_DACPSS_SIZE                     equ 0002h
DAC7CON0_DACPSS_LENGTH                   equ 0002h
DAC7CON0_DACPSS_MASK                     equ 000Ch
DAC7CON0_DACOE2_POSN                     equ 0004h
DAC7CON0_DACOE2_POSITION                 equ 0004h
DAC7CON0_DACOE2_SIZE                     equ 0001h
DAC7CON0_DACOE2_LENGTH                   equ 0001h
DAC7CON0_DACOE2_MASK                     equ 0010h
DAC7CON0_DACOE1_POSN                     equ 0005h
DAC7CON0_DACOE1_POSITION                 equ 0005h
DAC7CON0_DACOE1_SIZE                     equ 0001h
DAC7CON0_DACOE1_LENGTH                   equ 0001h
DAC7CON0_DACOE1_MASK                     equ 0020h
DAC7CON0_DACEN_POSN                      equ 0007h
DAC7CON0_DACEN_POSITION                  equ 0007h
DAC7CON0_DACEN_SIZE                      equ 0001h
DAC7CON0_DACEN_LENGTH                    equ 0001h
DAC7CON0_DACEN_MASK                      equ 0080h
DAC7CON0_DACNSS0_POSN                    equ 0000h
DAC7CON0_DACNSS0_POSITION                equ 0000h
DAC7CON0_DACNSS0_SIZE                    equ 0001h
DAC7CON0_DACNSS0_LENGTH                  equ 0001h
DAC7CON0_DACNSS0_MASK                    equ 0001h
DAC7CON0_DACNSS1_POSN                    equ 0001h
DAC7CON0_DACNSS1_POSITION                equ 0001h
DAC7CON0_DACNSS1_SIZE                    equ 0001h
DAC7CON0_DACNSS1_LENGTH                  equ 0001h
DAC7CON0_DACNSS1_MASK                    equ 0002h
DAC7CON0_DACPSS0_POSN                    equ 0002h
DAC7CON0_DACPSS0_POSITION                equ 0002h
DAC7CON0_DACPSS0_SIZE                    equ 0001h
DAC7CON0_DACPSS0_LENGTH                  equ 0001h
DAC7CON0_DACPSS0_MASK                    equ 0004h
DAC7CON0_DACPSS1_POSN                    equ 0003h
DAC7CON0_DACPSS1_POSITION                equ 0003h
DAC7CON0_DACPSS1_SIZE                    equ 0001h
DAC7CON0_DACPSS1_LENGTH                  equ 0001h
DAC7CON0_DACPSS1_MASK                    equ 0008h
DAC7CON0_DAC7NSS_POSN                    equ 0000h
DAC7CON0_DAC7NSS_POSITION                equ 0000h
DAC7CON0_DAC7NSS_SIZE                    equ 0002h
DAC7CON0_DAC7NSS_LENGTH                  equ 0002h
DAC7CON0_DAC7NSS_MASK                    equ 0003h
DAC7CON0_DAC7PSS_POSN                    equ 0002h
DAC7CON0_DAC7PSS_POSITION                equ 0002h
DAC7CON0_DAC7PSS_SIZE                    equ 0002h
DAC7CON0_DAC7PSS_LENGTH                  equ 0002h
DAC7CON0_DAC7PSS_MASK                    equ 000Ch
DAC7CON0_DAC7OE2_POSN                    equ 0004h
DAC7CON0_DAC7OE2_POSITION                equ 0004h
DAC7CON0_DAC7OE2_SIZE                    equ 0001h
DAC7CON0_DAC7OE2_LENGTH                  equ 0001h
DAC7CON0_DAC7OE2_MASK                    equ 0010h
DAC7CON0_DAC7OE1_POSN                    equ 0005h
DAC7CON0_DAC7OE1_POSITION                equ 0005h
DAC7CON0_DAC7OE1_SIZE                    equ 0001h
DAC7CON0_DAC7OE1_LENGTH                  equ 0001h
DAC7CON0_DAC7OE1_MASK                    equ 0020h
DAC7CON0_DAC7EN_POSN                     equ 0007h
DAC7CON0_DAC7EN_POSITION                 equ 0007h
DAC7CON0_DAC7EN_SIZE                     equ 0001h
DAC7CON0_DAC7EN_LENGTH                   equ 0001h
DAC7CON0_DAC7EN_MASK                     equ 0080h
DAC7CON0_DAC7NSS0_POSN                   equ 0000h
DAC7CON0_DAC7NSS0_POSITION               equ 0000h
DAC7CON0_DAC7NSS0_SIZE                   equ 0001h
DAC7CON0_DAC7NSS0_LENGTH                 equ 0001h
DAC7CON0_DAC7NSS0_MASK                   equ 0001h
DAC7CON0_DAC7NSS1_POSN                   equ 0001h
DAC7CON0_DAC7NSS1_POSITION               equ 0001h
DAC7CON0_DAC7NSS1_SIZE                   equ 0001h
DAC7CON0_DAC7NSS1_LENGTH                 equ 0001h
DAC7CON0_DAC7NSS1_MASK                   equ 0002h
DAC7CON0_DAC7PSS0_POSN                   equ 0002h
DAC7CON0_DAC7PSS0_POSITION               equ 0002h
DAC7CON0_DAC7PSS0_SIZE                   equ 0001h
DAC7CON0_DAC7PSS0_LENGTH                 equ 0001h
DAC7CON0_DAC7PSS0_MASK                   equ 0004h
DAC7CON0_DAC7PSS1_POSN                   equ 0003h
DAC7CON0_DAC7PSS1_POSITION               equ 0003h
DAC7CON0_DAC7PSS1_SIZE                   equ 0001h
DAC7CON0_DAC7PSS1_LENGTH                 equ 0001h
DAC7CON0_DAC7PSS1_MASK                   equ 0008h

