GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: COG2FIS0
#define COG2FIS0 COG2FIS0
COG2FIS0                                 equ 0719h
// bitfield definitions
COG2FIS0_FIS0_POSN                       equ 0000h
COG2FIS0_FIS0_POSITION                   equ 0000h
COG2FIS0_FIS0_SIZE                       equ 0001h
COG2FIS0_FIS0_LENGTH                     equ 0001h
COG2FIS0_FIS0_MASK                       equ 0001h
COG2FIS0_FIS1_POSN                       equ 0001h
COG2FIS0_FIS1_POSITION                   equ 0001h
COG2FIS0_FIS1_SIZE                       equ 0001h
COG2FIS0_FIS1_LENGTH                     equ 0001h
COG2FIS0_FIS1_MASK                       equ 0002h
COG2FIS0_FIS2_POSN                       equ 0002h
COG2FIS0_FIS2_POSITION                   equ 0002h
COG2FIS0_FIS2_SIZE                       equ 0001h
COG2FIS0_FIS2_LENGTH                     equ 0001h
COG2FIS0_FIS2_MASK                       equ 0004h
COG2FIS0_FIS3_POSN                       equ 0003h
COG2FIS0_FIS3_POSITION                   equ 0003h
COG2FIS0_FIS3_SIZE                       equ 0001h
COG2FIS0_FIS3_LENGTH                     equ 0001h
COG2FIS0_FIS3_MASK                       equ 0008h
COG2FIS0_FIS4_POSN                       equ 0004h
COG2FIS0_FIS4_POSITION                   equ 0004h
COG2FIS0_FIS4_SIZE                       equ 0001h
COG2FIS0_FIS4_LENGTH                     equ 0001h
COG2FIS0_FIS4_MASK                       equ 0010h
COG2FIS0_FIS5_POSN                       equ 0005h
COG2FIS0_FIS5_POSITION                   equ 0005h
COG2FIS0_FIS5_SIZE                       equ 0001h
COG2FIS0_FIS5_LENGTH                     equ 0001h
COG2FIS0_FIS5_MASK                       equ 0020h
COG2FIS0_FIS6_POSN                       equ 0006h
COG2FIS0_FIS6_POSITION                   equ 0006h
COG2FIS0_FIS6_SIZE                       equ 0001h
COG2FIS0_FIS6_LENGTH                     equ 0001h
COG2FIS0_FIS6_MASK                       equ 0040h
COG2FIS0_FIS7_POSN                       equ 0007h
COG2FIS0_FIS7_POSITION                   equ 0007h
COG2FIS0_FIS7_SIZE                       equ 0001h
COG2FIS0_FIS7_LENGTH                     equ 0001h
COG2FIS0_FIS7_MASK                       equ 0080h
COG2FIS0_G2FIS0_POSN                     equ 0000h
COG2FIS0_G2FIS0_POSITION                 equ 0000h
COG2FIS0_G2FIS0_SIZE                     equ 0001h
COG2FIS0_G2FIS0_LENGTH                   equ 0001h
COG2FIS0_G2FIS0_MASK                     equ 0001h
COG2FIS0_G2FIS1_POSN                     equ 0001h
COG2FIS0_G2FIS1_POSITION                 equ 0001h
COG2FIS0_G2FIS1_SIZE                     equ 0001h
COG2FIS0_G2FIS1_LENGTH                   equ 0001h
COG2FIS0_G2FIS1_MASK                     equ 0002h
COG2FIS0_G2FIS2_POSN                     equ 0002h
COG2FIS0_G2FIS2_POSITION                 equ 0002h
COG2FIS0_G2FIS2_SIZE                     equ 0001h
COG2FIS0_G2FIS2_LENGTH                   equ 0001h
COG2FIS0_G2FIS2_MASK                     equ 0004h
COG2FIS0_G2FIS3_POSN                     equ 0003h
COG2FIS0_G2FIS3_POSITION                 equ 0003h
COG2FIS0_G2FIS3_SIZE                     equ 0001h
COG2FIS0_G2FIS3_LENGTH                   equ 0001h
COG2FIS0_G2FIS3_MASK                     equ 0008h
COG2FIS0_G2FIS4_POSN                     equ 0004h
COG2FIS0_G2FIS4_POSITION                 equ 0004h
COG2FIS0_G2FIS4_SIZE                     equ 0001h
COG2FIS0_G2FIS4_LENGTH                   equ 0001h
COG2FIS0_G2FIS4_MASK                     equ 0010h
COG2FIS0_G2FIS5_POSN                     equ 0005h
COG2FIS0_G2FIS5_POSITION                 equ 0005h
COG2FIS0_G2FIS5_SIZE                     equ 0001h
COG2FIS0_G2FIS5_LENGTH                   equ 0001h
COG2FIS0_G2FIS5_MASK                     equ 0020h
COG2FIS0_G2FIS6_POSN                     equ 0006h
COG2FIS0_G2FIS6_POSITION                 equ 0006h
COG2FIS0_G2FIS6_SIZE                     equ 0001h
COG2FIS0_G2FIS6_LENGTH                   equ 0001h
COG2FIS0_G2FIS6_MASK                     equ 0040h
COG2FIS0_G2FIS7_POSN                     equ 0007h
COG2FIS0_G2FIS7_POSITION                 equ 0007h
COG2FIS0_G2FIS7_SIZE                     equ 0001h
COG2FIS0_G2FIS7_LENGTH                   equ 0001h
COG2FIS0_G2FIS7_MASK                     equ 0080h

// Register: COG2FIS1
#define COG2FIS1 COG2FIS1
COG2FIS1                                 equ 071Ah
// bitfield definitions
COG2FIS1_FIS8_POSN                       equ 0000h
COG2FIS1_FIS8_POSITION                   equ 0000h
COG2FIS1_FIS8_SIZE                       equ 0001h
COG2FIS1_FIS8_LENGTH                     equ 0001h
COG2FIS1_FIS8_MASK                       equ 0001h
COG2FIS1_FIS9_POSN                       equ 0001h
COG2FIS1_FIS9_POSITION                   equ 0001h
COG2FIS1_FIS9_SIZE                       equ 0001h
COG2FIS1_FIS9_LENGTH                     equ 0001h
COG2FIS1_FIS9_MASK                       equ 0002h
COG2FIS1_FIS10_POSN                      equ 0002h
COG2FIS1_FIS10_POSITION                  equ 0002h
COG2FIS1_FIS10_SIZE                      equ 0001h
COG2FIS1_FIS10_LENGTH                    equ 0001h
COG2FIS1_FIS10_MASK                      equ 0004h
COG2FIS1_FIS11_POSN                      equ 0003h
COG2FIS1_FIS11_POSITION                  equ 0003h
COG2FIS1_FIS11_SIZE                      equ 0001h
COG2FIS1_FIS11_LENGTH                    equ 0001h
COG2FIS1_FIS11_MASK                      equ 0008h
COG2FIS1_FIS12_POSN                      equ 0004h
COG2FIS1_FIS12_POSITION                  equ 0004h
COG2FIS1_FIS12_SIZE                      equ 0001h
COG2FIS1_FIS12_LENGTH                    equ 0001h
COG2FIS1_FIS12_MASK                      equ 0010h
COG2FIS1_FIS13_POSN                      equ 0005h
COG2FIS1_FIS13_POSITION                  equ 0005h
COG2FIS1_FIS13_SIZE                      equ 0001h
COG2FIS1_FIS13_LENGTH                    equ 0001h
COG2FIS1_FIS13_MASK                      equ 0020h
COG2FIS1_FIS14_POSN                      equ 0006h
COG2FIS1_FIS14_POSITION                  equ 0006h
COG2FIS1_FIS14_SIZE                      equ 0001h
COG2FIS1_FIS14_LENGTH                    equ 0001h
COG2FIS1_FIS14_MASK                      equ 0040h
COG2FIS1_FIS15_POSN                      equ 0007h
COG2FIS1_FIS15_POSITION                  equ 0007h
COG2FIS1_FIS15_SIZE                      equ 0001h
COG2FIS1_FIS15_LENGTH                    equ 0001h
COG2FIS1_FIS15_MASK                      equ 0080h
COG2FIS1_G2FIS8_POSN                     equ 0000h
COG2FIS1_G2FIS8_POSITION                 equ 0000h
COG2FIS1_G2FIS8_SIZE                     equ 0001h
COG2FIS1_G2FIS8_LENGTH                   equ 0001h
COG2FIS1_G2FIS8_MASK                     equ 0001h
COG2FIS1_G2FIS9_POSN                     equ 0001h
COG2FIS1_G2FIS9_POSITION                 equ 0001h
COG2FIS1_G2FIS9_SIZE                     equ 0001h
COG2FIS1_G2FIS9_LENGTH                   equ 0001h
COG2FIS1_G2FIS9_MASK                     equ 0002h
COG2FIS1_G2FIS10_POSN                    equ 0002h
COG2FIS1_G2FIS10_POSITION                equ 0002h
COG2FIS1_G2FIS10_SIZE                    equ 0001h
COG2FIS1_G2FIS10_LENGTH                  equ 0001h
COG2FIS1_G2FIS10_MASK                    equ 0004h
COG2FIS1_G2FIS11_POSN                    equ 0003h
COG2FIS1_G2FIS11_POSITION                equ 0003h
COG2FIS1_G2FIS11_SIZE                    equ 0001h
COG2FIS1_G2FIS11_LENGTH                  equ 0001h
COG2FIS1_G2FIS11_MASK                    equ 0008h
COG2FIS1_G2FIS12_POSN                    equ 0004h
COG2FIS1_G2FIS12_POSITION                equ 0004h
COG2FIS1_G2FIS12_SIZE                    equ 0001h
COG2FIS1_G2FIS12_LENGTH                  equ 0001h
COG2FIS1_G2FIS12_MASK                    equ 0010h
COG2FIS1_G2FIS13_POSN                    equ 0005h
COG2FIS1_G2FIS13_POSITION                equ 0005h
COG2FIS1_G2FIS13_SIZE                    equ 0001h
COG2FIS1_G2FIS13_LENGTH                  equ 0001h
COG2FIS1_G2FIS13_MASK                    equ 0020h
COG2FIS1_G2FIS14_POSN                    equ 0006h
COG2FIS1_G2FIS14_POSITION                equ 0006h
COG2FIS1_G2FIS14_SIZE                    equ 0001h
COG2FIS1_G2FIS14_LENGTH                  equ 0001h
COG2FIS1_G2FIS14_MASK                    equ 0040h
COG2FIS1_G2FIS15_POSN                    equ 0007h
COG2FIS1_G2FIS15_POSITION                equ 0007h
COG2FIS1_G2FIS15_SIZE                    equ 0001h
COG2FIS1_G2FIS15_LENGTH                  equ 0001h
COG2FIS1_G2FIS15_MASK                    equ 0080h

// Register: COG2FSIM0
#define COG2FSIM0 COG2FSIM0
COG2FSIM0                                equ 071Bh
// bitfield definitions
COG2FSIM0_FSIM0_POSN                     equ 0000h
COG2FSIM0_FSIM0_POSITION                 equ 0000h
COG2FSIM0_FSIM0_SIZE                     equ 0001h
COG2FSIM0_FSIM0_LENGTH                   equ 0001h
COG2FSIM0_FSIM0_MASK                     equ 0001h
COG2FSIM0_FSIM1_POSN                     equ 0001h
COG2FSIM0_FSIM1_POSITION                 equ 0001h
COG2FSIM0_FSIM1_SIZE                     equ 0001h
COG2FSIM0_FSIM1_LENGTH                   equ 0001h
COG2FSIM0_FSIM1_MASK                     equ 0002h
COG2FSIM0_FSIM2_POSN                     equ 0002h
COG2FSIM0_FSIM2_POSITION                 equ 0002h
COG2FSIM0_FSIM2_SIZE                     equ 0001h
COG2FSIM0_FSIM2_LENGTH                   equ 0001h
COG2FSIM0_FSIM2_MASK                     equ 0004h
COG2FSIM0_FSIM3_POSN                     equ 0003h
COG2FSIM0_FSIM3_POSITION                 equ 0003h
COG2FSIM0_FSIM3_SIZE                     equ 0001h
COG2FSIM0_FSIM3_LENGTH                   equ 0001h
COG2FSIM0_FSIM3_MASK                     equ 0008h
COG2FSIM0_FSIM4_POSN                     equ 0004h
COG2FSIM0_FSIM4_POSITION                 equ 0004h
COG2FSIM0_FSIM4_SIZE                     equ 0001h
COG2FSIM0_FSIM4_LENGTH                   equ 0001h
COG2FSIM0_FSIM4_MASK                     equ 0010h
COG2FSIM0_FSIM5_POSN                     equ 0005h
COG2FSIM0_FSIM5_POSITION                 equ 0005h
COG2FSIM0_FSIM5_SIZE                     equ 0001h
COG2FSIM0_FSIM5_LENGTH                   equ 0001h
COG2FSIM0_FSIM5_MASK                     equ 0020h
COG2FSIM0_FSIM6_POSN                     equ 0006h
COG2FSIM0_FSIM6_POSITION                 equ 0006h
COG2FSIM0_FSIM6_SIZE                     equ 0001h
COG2FSIM0_FSIM6_LENGTH                   equ 0001h
COG2FSIM0_FSIM6_MASK                     equ 0040h
COG2FSIM0_FSIM7_POSN                     equ 0007h
COG2FSIM0_FSIM7_POSITION                 equ 0007h
COG2FSIM0_FSIM7_SIZE                     equ 0001h
COG2FSIM0_FSIM7_LENGTH                   equ 0001h
COG2FSIM0_FSIM7_MASK                     equ 0080h
COG2FSIM0_G2FSIM0_POSN                   equ 0000h
COG2FSIM0_G2FSIM0_POSITION               equ 0000h
COG2FSIM0_G2FSIM0_SIZE                   equ 0001h
COG2FSIM0_G2FSIM0_LENGTH                 equ 0001h
COG2FSIM0_G2FSIM0_MASK                   equ 0001h
COG2FSIM0_G2FSIM1_POSN                   equ 0001h
COG2FSIM0_G2FSIM1_POSITION               equ 0001h
COG2FSIM0_G2FSIM1_SIZE                   equ 0001h
COG2FSIM0_G2FSIM1_LENGTH                 equ 0001h
COG2FSIM0_G2FSIM1_MASK                   equ 0002h
COG2FSIM0_G2FSIM2_POSN                   equ 0002h
COG2FSIM0_G2FSIM2_POSITION               equ 0002h
COG2FSIM0_G2FSIM2_SIZE                   equ 0001h
COG2FSIM0_G2FSIM2_LENGTH                 equ 0001h
COG2FSIM0_G2FSIM2_MASK                   equ 0004h
COG2FSIM0_G2FSIM3_POSN                   equ 0003h
COG2FSIM0_G2FSIM3_POSITION               equ 0003h
COG2FSIM0_G2FSIM3_SIZE                   equ 0001h
COG2FSIM0_G2FSIM3_LENGTH                 equ 0001h
COG2FSIM0_G2FSIM3_MASK                   equ 0008h
COG2FSIM0_G2FSIM4_POSN                   equ 0004h
COG2FSIM0_G2FSIM4_POSITION               equ 0004h
COG2FSIM0_G2FSIM4_SIZE                   equ 0001h
COG2FSIM0_G2FSIM4_LENGTH                 equ 0001h
COG2FSIM0_G2FSIM4_MASK                   equ 0010h
COG2FSIM0_G2FSIM5_POSN                   equ 0005h
COG2FSIM0_G2FSIM5_POSITION               equ 0005h
COG2FSIM0_G2FSIM5_SIZE                   equ 0001h
COG2FSIM0_G2FSIM5_LENGTH                 equ 0001h
COG2FSIM0_G2FSIM5_MASK                   equ 0020h
COG2FSIM0_G2FSIM6_POSN                   equ 0006h
COG2FSIM0_G2FSIM6_POSITION               equ 0006h
COG2FSIM0_G2FSIM6_SIZE                   equ 0001h
COG2FSIM0_G2FSIM6_LENGTH                 equ 0001h
COG2FSIM0_G2FSIM6_MASK                   equ 0040h
COG2FSIM0_G2FSIM7_POSN                   equ 0007h
COG2FSIM0_G2FSIM7_POSITION               equ 0007h
COG2FSIM0_G2FSIM7_SIZE                   equ 0001h
COG2FSIM0_G2FSIM7_LENGTH                 equ 0001h
COG2FSIM0_G2FSIM7_MASK                   equ 0080h

// Register: COG2FSIM1
#define COG2FSIM1 COG2FSIM1
COG2FSIM1                                equ 071Ch
// bitfield definitions
COG2FSIM1_FSIM8_POSN                     equ 0000h
COG2FSIM1_FSIM8_POSITION                 equ 0000h
COG2FSIM1_FSIM8_SIZE                     equ 0001h
COG2FSIM1_FSIM8_LENGTH                   equ 0001h
COG2FSIM1_FSIM8_MASK                     equ 0001h
COG2FSIM1_FSIM9_POSN                     equ 0001h
COG2FSIM1_FSIM9_POSITION                 equ 0001h
COG2FSIM1_FSIM9_SIZE                     equ 0001h
COG2FSIM1_FSIM9_LENGTH                   equ 0001h
COG2FSIM1_FSIM9_MASK                     equ 0002h
COG2FSIM1_FSIM10_POSN                    equ 0002h
COG2FSIM1_FSIM10_POSITION                equ 0002h
COG2FSIM1_FSIM10_SIZE                    equ 0001h
COG2FSIM1_FSIM10_LENGTH                  equ 0001h
COG2FSIM1_FSIM10_MASK                    equ 0004h
COG2FSIM1_FSIM11_POSN                    equ 0003h
COG2FSIM1_FSIM11_POSITION                equ 0003h
COG2FSIM1_FSIM11_SIZE                    equ 0001h
COG2FSIM1_FSIM11_LENGTH                  equ 0001h
COG2FSIM1_FSIM11_MASK                    equ 0008h
COG2FSIM1_FSIM12_POSN                    equ 0004h
COG2FSIM1_FSIM12_POSITION                equ 0004h
COG2FSIM1_FSIM12_SIZE                    equ 0001h
COG2FSIM1_FSIM12_LENGTH                  equ 0001h
COG2FSIM1_FSIM12_MASK                    equ 0010h
COG2FSIM1_FSIM13_POSN                    equ 0005h
COG2FSIM1_FSIM13_POSITION                equ 0005h
COG2FSIM1_FSIM13_SIZE                    equ 0001h
COG2FSIM1_FSIM13_LENGTH                  equ 0001h
COG2FSIM1_FSIM13_MASK                    equ 0020h
COG2FSIM1_FSIM14_POSN                    equ 0006h
COG2FSIM1_FSIM14_POSITION                equ 0006h
COG2FSIM1_FSIM14_SIZE                    equ 0001h
COG2FSIM1_FSIM14_LENGTH                  equ 0001h
COG2FSIM1_FSIM14_MASK                    equ 0040h
COG2FSIM1_FSIM15_POSN                    equ 0007h
COG2FSIM1_FSIM15_POSITION                equ 0007h
COG2FSIM1_FSIM15_SIZE                    equ 0001h
COG2FSIM1_FSIM15_LENGTH                  equ 0001h
COG2FSIM1_FSIM15_MASK                    equ 0080h
COG2FSIM1_G2FSIM8_POSN                   equ 0000h
COG2FSIM1_G2FSIM8_POSITION               equ 0000h
COG2FSIM1_G2FSIM8_SIZE                   equ 0001h
COG2FSIM1_G2FSIM8_LENGTH                 equ 0001h
COG2FSIM1_G2FSIM8_MASK                   equ 0001h
COG2FSIM1_G2FSIM9_POSN                   equ 0001h
COG2FSIM1_G2FSIM9_POSITION               equ 0001h
COG2FSIM1_G2FSIM9_SIZE                   equ 0001h
COG2FSIM1_G2FSIM9_LENGTH                 equ 0001h
COG2FSIM1_G2FSIM9_MASK                   equ 0002h
COG2FSIM1_G2FSIM10_POSN                  equ 0002h
COG2FSIM1_G2FSIM10_POSITION              equ 0002h
COG2FSIM1_G2FSIM10_SIZE                  equ 0001h
COG2FSIM1_G2FSIM10_LENGTH                equ 0001h
COG2FSIM1_G2FSIM10_MASK                  equ 0004h
COG2FSIM1_G2FSIM11_POSN                  equ 0003h
COG2FSIM1_G2FSIM11_POSITION              equ 0003h
COG2FSIM1_G2FSIM11_SIZE                  equ 0001h
COG2FSIM1_G2FSIM11_LENGTH                equ 0001h
COG2FSIM1_G2FSIM11_MASK                  equ 0008h
COG2FSIM1_G2FSIM12_POSN                  equ 0004h
COG2FSIM1_G2FSIM12_POSITION              equ 0004h
COG2FSIM1_G2FSIM12_SIZE                  equ 0001h
COG2FSIM1_G2FSIM12_LENGTH                equ 0001h
COG2FSIM1_G2FSIM12_MASK                  equ 0010h
COG2FSIM1_G2FSIM13_POSN                  equ 0005h
COG2FSIM1_G2FSIM13_POSITION              equ 0005h
COG2FSIM1_G2FSIM13_SIZE                  equ 0001h
COG2FSIM1_G2FSIM13_LENGTH                equ 0001h
COG2FSIM1_G2FSIM13_MASK                  equ 0020h
COG2FSIM1_G2FSIM14_POSN                  equ 0006h
COG2FSIM1_G2FSIM14_POSITION              equ 0006h
COG2FSIM1_G2FSIM14_SIZE                  equ 0001h
COG2FSIM1_G2FSIM14_LENGTH                equ 0001h
COG2FSIM1_G2FSIM14_MASK                  equ 0040h
COG2FSIM1_G2FSIM15_POSN                  equ 0007h
COG2FSIM1_G2FSIM15_POSITION              equ 0007h
COG2FSIM1_G2FSIM15_SIZE                  equ 0001h
COG2FSIM1_G2FSIM15_LENGTH                equ 0001h
COG2FSIM1_G2FSIM15_MASK                  equ 0080h

