GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: COG3RIS0
#define COG3RIS0 COG3RIS0
COG3RIS0                                 equ 0815h
// bitfield definitions
COG3RIS0_RIS0_POSN                       equ 0000h
COG3RIS0_RIS0_POSITION                   equ 0000h
COG3RIS0_RIS0_SIZE                       equ 0001h
COG3RIS0_RIS0_LENGTH                     equ 0001h
COG3RIS0_RIS0_MASK                       equ 0001h
COG3RIS0_RIS1_POSN                       equ 0001h
COG3RIS0_RIS1_POSITION                   equ 0001h
COG3RIS0_RIS1_SIZE                       equ 0001h
COG3RIS0_RIS1_LENGTH                     equ 0001h
COG3RIS0_RIS1_MASK                       equ 0002h
COG3RIS0_RIS2_POSN                       equ 0002h
COG3RIS0_RIS2_POSITION                   equ 0002h
COG3RIS0_RIS2_SIZE                       equ 0001h
COG3RIS0_RIS2_LENGTH                     equ 0001h
COG3RIS0_RIS2_MASK                       equ 0004h
COG3RIS0_RIS3_POSN                       equ 0003h
COG3RIS0_RIS3_POSITION                   equ 0003h
COG3RIS0_RIS3_SIZE                       equ 0001h
COG3RIS0_RIS3_LENGTH                     equ 0001h
COG3RIS0_RIS3_MASK                       equ 0008h
COG3RIS0_RIS4_POSN                       equ 0004h
COG3RIS0_RIS4_POSITION                   equ 0004h
COG3RIS0_RIS4_SIZE                       equ 0001h
COG3RIS0_RIS4_LENGTH                     equ 0001h
COG3RIS0_RIS4_MASK                       equ 0010h
COG3RIS0_RIS5_POSN                       equ 0005h
COG3RIS0_RIS5_POSITION                   equ 0005h
COG3RIS0_RIS5_SIZE                       equ 0001h
COG3RIS0_RIS5_LENGTH                     equ 0001h
COG3RIS0_RIS5_MASK                       equ 0020h
COG3RIS0_RIS6_POSN                       equ 0006h
COG3RIS0_RIS6_POSITION                   equ 0006h
COG3RIS0_RIS6_SIZE                       equ 0001h
COG3RIS0_RIS6_LENGTH                     equ 0001h
COG3RIS0_RIS6_MASK                       equ 0040h
COG3RIS0_RIS7_POSN                       equ 0007h
COG3RIS0_RIS7_POSITION                   equ 0007h
COG3RIS0_RIS7_SIZE                       equ 0001h
COG3RIS0_RIS7_LENGTH                     equ 0001h
COG3RIS0_RIS7_MASK                       equ 0080h
COG3RIS0_G3RIS0_POSN                     equ 0000h
COG3RIS0_G3RIS0_POSITION                 equ 0000h
COG3RIS0_G3RIS0_SIZE                     equ 0001h
COG3RIS0_G3RIS0_LENGTH                   equ 0001h
COG3RIS0_G3RIS0_MASK                     equ 0001h
COG3RIS0_G3RIS1_POSN                     equ 0001h
COG3RIS0_G3RIS1_POSITION                 equ 0001h
COG3RIS0_G3RIS1_SIZE                     equ 0001h
COG3RIS0_G3RIS1_LENGTH                   equ 0001h
COG3RIS0_G3RIS1_MASK                     equ 0002h
COG3RIS0_G3RIS2_POSN                     equ 0002h
COG3RIS0_G3RIS2_POSITION                 equ 0002h
COG3RIS0_G3RIS2_SIZE                     equ 0001h
COG3RIS0_G3RIS2_LENGTH                   equ 0001h
COG3RIS0_G3RIS2_MASK                     equ 0004h
COG3RIS0_G3RIS3_POSN                     equ 0003h
COG3RIS0_G3RIS3_POSITION                 equ 0003h
COG3RIS0_G3RIS3_SIZE                     equ 0001h
COG3RIS0_G3RIS3_LENGTH                   equ 0001h
COG3RIS0_G3RIS3_MASK                     equ 0008h
COG3RIS0_G3RIS4_POSN                     equ 0004h
COG3RIS0_G3RIS4_POSITION                 equ 0004h
COG3RIS0_G3RIS4_SIZE                     equ 0001h
COG3RIS0_G3RIS4_LENGTH                   equ 0001h
COG3RIS0_G3RIS4_MASK                     equ 0010h
COG3RIS0_G3RIS5_POSN                     equ 0005h
COG3RIS0_G3RIS5_POSITION                 equ 0005h
COG3RIS0_G3RIS5_SIZE                     equ 0001h
COG3RIS0_G3RIS5_LENGTH                   equ 0001h
COG3RIS0_G3RIS5_MASK                     equ 0020h
COG3RIS0_G3RIS6_POSN                     equ 0006h
COG3RIS0_G3RIS6_POSITION                 equ 0006h
COG3RIS0_G3RIS6_SIZE                     equ 0001h
COG3RIS0_G3RIS6_LENGTH                   equ 0001h
COG3RIS0_G3RIS6_MASK                     equ 0040h
COG3RIS0_G3RIS7_POSN                     equ 0007h
COG3RIS0_G3RIS7_POSITION                 equ 0007h
COG3RIS0_G3RIS7_SIZE                     equ 0001h
COG3RIS0_G3RIS7_LENGTH                   equ 0001h
COG3RIS0_G3RIS7_MASK                     equ 0080h

// Register: COG3RIS1
#define COG3RIS1 COG3RIS1
COG3RIS1                                 equ 0816h
// bitfield definitions
COG3RIS1_RIS9_POSN                       equ 0001h
COG3RIS1_RIS9_POSITION                   equ 0001h
COG3RIS1_RIS9_SIZE                       equ 0001h
COG3RIS1_RIS9_LENGTH                     equ 0001h
COG3RIS1_RIS9_MASK                       equ 0002h
COG3RIS1_RIS11_POSN                      equ 0003h
COG3RIS1_RIS11_POSITION                  equ 0003h
COG3RIS1_RIS11_SIZE                      equ 0001h
COG3RIS1_RIS11_LENGTH                    equ 0001h
COG3RIS1_RIS11_MASK                      equ 0008h
COG3RIS1_RIS12_POSN                      equ 0004h
COG3RIS1_RIS12_POSITION                  equ 0004h
COG3RIS1_RIS12_SIZE                      equ 0001h
COG3RIS1_RIS12_LENGTH                    equ 0001h
COG3RIS1_RIS12_MASK                      equ 0010h
COG3RIS1_RIS13_POSN                      equ 0005h
COG3RIS1_RIS13_POSITION                  equ 0005h
COG3RIS1_RIS13_SIZE                      equ 0001h
COG3RIS1_RIS13_LENGTH                    equ 0001h
COG3RIS1_RIS13_MASK                      equ 0020h
COG3RIS1_RIS14_POSN                      equ 0006h
COG3RIS1_RIS14_POSITION                  equ 0006h
COG3RIS1_RIS14_SIZE                      equ 0001h
COG3RIS1_RIS14_LENGTH                    equ 0001h
COG3RIS1_RIS14_MASK                      equ 0040h
COG3RIS1_RIS15_POSN                      equ 0007h
COG3RIS1_RIS15_POSITION                  equ 0007h
COG3RIS1_RIS15_SIZE                      equ 0001h
COG3RIS1_RIS15_LENGTH                    equ 0001h
COG3RIS1_RIS15_MASK                      equ 0080h
COG3RIS1_G3RIS9_POSN                     equ 0001h
COG3RIS1_G3RIS9_POSITION                 equ 0001h
COG3RIS1_G3RIS9_SIZE                     equ 0001h
COG3RIS1_G3RIS9_LENGTH                   equ 0001h
COG3RIS1_G3RIS9_MASK                     equ 0002h
COG3RIS1_G3RIS11_POSN                    equ 0003h
COG3RIS1_G3RIS11_POSITION                equ 0003h
COG3RIS1_G3RIS11_SIZE                    equ 0001h
COG3RIS1_G3RIS11_LENGTH                  equ 0001h
COG3RIS1_G3RIS11_MASK                    equ 0008h
COG3RIS1_G3RIS12_POSN                    equ 0004h
COG3RIS1_G3RIS12_POSITION                equ 0004h
COG3RIS1_G3RIS12_SIZE                    equ 0001h
COG3RIS1_G3RIS12_LENGTH                  equ 0001h
COG3RIS1_G3RIS12_MASK                    equ 0010h
COG3RIS1_G3RIS13_POSN                    equ 0005h
COG3RIS1_G3RIS13_POSITION                equ 0005h
COG3RIS1_G3RIS13_SIZE                    equ 0001h
COG3RIS1_G3RIS13_LENGTH                  equ 0001h
COG3RIS1_G3RIS13_MASK                    equ 0020h
COG3RIS1_G3RIS14_POSN                    equ 0006h
COG3RIS1_G3RIS14_POSITION                equ 0006h
COG3RIS1_G3RIS14_SIZE                    equ 0001h
COG3RIS1_G3RIS14_LENGTH                  equ 0001h
COG3RIS1_G3RIS14_MASK                    equ 0040h
COG3RIS1_G3RIS15_POSN                    equ 0007h
COG3RIS1_G3RIS15_POSITION                equ 0007h
COG3RIS1_G3RIS15_SIZE                    equ 0001h
COG3RIS1_G3RIS15_LENGTH                  equ 0001h
COG3RIS1_G3RIS15_MASK                    equ 0080h

