GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: COG3STR
#define COG3STR COG3STR
COG3STR                                  equ 081Fh
// bitfield definitions
COG3STR_STRA_POSN                        equ 0000h
COG3STR_STRA_POSITION                    equ 0000h
COG3STR_STRA_SIZE                        equ 0001h
COG3STR_STRA_LENGTH                      equ 0001h
COG3STR_STRA_MASK                        equ 0001h
COG3STR_STRB_POSN                        equ 0001h
COG3STR_STRB_POSITION                    equ 0001h
COG3STR_STRB_SIZE                        equ 0001h
COG3STR_STRB_LENGTH                      equ 0001h
COG3STR_STRB_MASK                        equ 0002h
COG3STR_STRC_POSN                        equ 0002h
COG3STR_STRC_POSITION                    equ 0002h
COG3STR_STRC_SIZE                        equ 0001h
COG3STR_STRC_LENGTH                      equ 0001h
COG3STR_STRC_MASK                        equ 0004h
COG3STR_STRD_POSN                        equ 0003h
COG3STR_STRD_POSITION                    equ 0003h
COG3STR_STRD_SIZE                        equ 0001h
COG3STR_STRD_LENGTH                      equ 0001h
COG3STR_STRD_MASK                        equ 0008h
COG3STR_SDATA_POSN                       equ 0004h
COG3STR_SDATA_POSITION                   equ 0004h
COG3STR_SDATA_SIZE                       equ 0001h
COG3STR_SDATA_LENGTH                     equ 0001h
COG3STR_SDATA_MASK                       equ 0010h
COG3STR_SDATB_POSN                       equ 0005h
COG3STR_SDATB_POSITION                   equ 0005h
COG3STR_SDATB_SIZE                       equ 0001h
COG3STR_SDATB_LENGTH                     equ 0001h
COG3STR_SDATB_MASK                       equ 0020h
COG3STR_SDATC_POSN                       equ 0006h
COG3STR_SDATC_POSITION                   equ 0006h
COG3STR_SDATC_SIZE                       equ 0001h
COG3STR_SDATC_LENGTH                     equ 0001h
COG3STR_SDATC_MASK                       equ 0040h
COG3STR_SDATD_POSN                       equ 0007h
COG3STR_SDATD_POSITION                   equ 0007h
COG3STR_SDATD_SIZE                       equ 0001h
COG3STR_SDATD_LENGTH                     equ 0001h
COG3STR_SDATD_MASK                       equ 0080h
COG3STR_G3STRA_POSN                      equ 0000h
COG3STR_G3STRA_POSITION                  equ 0000h
COG3STR_G3STRA_SIZE                      equ 0001h
COG3STR_G3STRA_LENGTH                    equ 0001h
COG3STR_G3STRA_MASK                      equ 0001h
COG3STR_G3STRB_POSN                      equ 0001h
COG3STR_G3STRB_POSITION                  equ 0001h
COG3STR_G3STRB_SIZE                      equ 0001h
COG3STR_G3STRB_LENGTH                    equ 0001h
COG3STR_G3STRB_MASK                      equ 0002h
COG3STR_G3STRC_POSN                      equ 0002h
COG3STR_G3STRC_POSITION                  equ 0002h
COG3STR_G3STRC_SIZE                      equ 0001h
COG3STR_G3STRC_LENGTH                    equ 0001h
COG3STR_G3STRC_MASK                      equ 0004h
COG3STR_G3STRD_POSN                      equ 0003h
COG3STR_G3STRD_POSITION                  equ 0003h
COG3STR_G3STRD_SIZE                      equ 0001h
COG3STR_G3STRD_LENGTH                    equ 0001h
COG3STR_G3STRD_MASK                      equ 0008h
COG3STR_G3SDATA_POSN                     equ 0004h
COG3STR_G3SDATA_POSITION                 equ 0004h
COG3STR_G3SDATA_SIZE                     equ 0001h
COG3STR_G3SDATA_LENGTH                   equ 0001h
COG3STR_G3SDATA_MASK                     equ 0010h
COG3STR_G3SDATB_POSN                     equ 0005h
COG3STR_G3SDATB_POSITION                 equ 0005h
COG3STR_G3SDATB_SIZE                     equ 0001h
COG3STR_G3SDATB_LENGTH                   equ 0001h
COG3STR_G3SDATB_MASK                     equ 0020h
COG3STR_G3SDATC_POSN                     equ 0006h
COG3STR_G3SDATC_POSITION                 equ 0006h
COG3STR_G3SDATC_SIZE                     equ 0001h
COG3STR_G3SDATC_LENGTH                   equ 0001h
COG3STR_G3SDATC_MASK                     equ 0040h
COG3STR_G3SDATD_POSN                     equ 0007h
COG3STR_G3SDATD_POSITION                 equ 0007h
COG3STR_G3SDATD_SIZE                     equ 0001h
COG3STR_G3SDATD_LENGTH                   equ 0001h
COG3STR_G3SDATD_MASK                     equ 0080h

// Register: COG4PHR
#define COG4PHR COG4PHR
COG4PHR                                  equ 088Dh
// bitfield definitions
COG4PHR_PHR_POSN                         equ 0000h
COG4PHR_PHR_POSITION                     equ 0000h
COG4PHR_PHR_SIZE                         equ 0006h
COG4PHR_PHR_LENGTH                       equ 0006h
COG4PHR_PHR_MASK                         equ 003Fh
COG4PHR_PHR0_POSN                        equ 0000h
COG4PHR_PHR0_POSITION                    equ 0000h
COG4PHR_PHR0_SIZE                        equ 0001h
COG4PHR_PHR0_LENGTH                      equ 0001h
COG4PHR_PHR0_MASK                        equ 0001h
COG4PHR_PHR1_POSN                        equ 0001h
COG4PHR_PHR1_POSITION                    equ 0001h
COG4PHR_PHR1_SIZE                        equ 0001h
COG4PHR_PHR1_LENGTH                      equ 0001h
COG4PHR_PHR1_MASK                        equ 0002h
COG4PHR_PHR2_POSN                        equ 0002h
COG4PHR_PHR2_POSITION                    equ 0002h
COG4PHR_PHR2_SIZE                        equ 0001h
COG4PHR_PHR2_LENGTH                      equ 0001h
COG4PHR_PHR2_MASK                        equ 0004h
COG4PHR_PHR3_POSN                        equ 0003h
COG4PHR_PHR3_POSITION                    equ 0003h
COG4PHR_PHR3_SIZE                        equ 0001h
COG4PHR_PHR3_LENGTH                      equ 0001h
COG4PHR_PHR3_MASK                        equ 0008h
COG4PHR_PHR4_POSN                        equ 0004h
COG4PHR_PHR4_POSITION                    equ 0004h
COG4PHR_PHR4_SIZE                        equ 0001h
COG4PHR_PHR4_LENGTH                      equ 0001h
COG4PHR_PHR4_MASK                        equ 0010h
COG4PHR_PHR5_POSN                        equ 0005h
COG4PHR_PHR5_POSITION                    equ 0005h
COG4PHR_PHR5_SIZE                        equ 0001h
COG4PHR_PHR5_LENGTH                      equ 0001h
COG4PHR_PHR5_MASK                        equ 0020h
COG4PHR_G4PHR0_POSN                      equ 0000h
COG4PHR_G4PHR0_POSITION                  equ 0000h
COG4PHR_G4PHR0_SIZE                      equ 0001h
COG4PHR_G4PHR0_LENGTH                    equ 0001h
COG4PHR_G4PHR0_MASK                      equ 0001h
COG4PHR_G4PHR1_POSN                      equ 0001h
COG4PHR_G4PHR1_POSITION                  equ 0001h
COG4PHR_G4PHR1_SIZE                      equ 0001h
COG4PHR_G4PHR1_LENGTH                    equ 0001h
COG4PHR_G4PHR1_MASK                      equ 0002h
COG4PHR_G4PHR2_POSN                      equ 0002h
COG4PHR_G4PHR2_POSITION                  equ 0002h
COG4PHR_G4PHR2_SIZE                      equ 0001h
COG4PHR_G4PHR2_LENGTH                    equ 0001h
COG4PHR_G4PHR2_MASK                      equ 0004h
COG4PHR_G4PHR3_POSN                      equ 0003h
COG4PHR_G4PHR3_POSITION                  equ 0003h
COG4PHR_G4PHR3_SIZE                      equ 0001h
COG4PHR_G4PHR3_LENGTH                    equ 0001h
COG4PHR_G4PHR3_MASK                      equ 0008h
COG4PHR_G4PHR4_POSN                      equ 0004h
COG4PHR_G4PHR4_POSITION                  equ 0004h
COG4PHR_G4PHR4_SIZE                      equ 0001h
COG4PHR_G4PHR4_LENGTH                    equ 0001h
COG4PHR_G4PHR4_MASK                      equ 0010h
COG4PHR_G4PHR5_POSN                      equ 0005h
COG4PHR_G4PHR5_POSITION                  equ 0005h
COG4PHR_G4PHR5_SIZE                      equ 0001h
COG4PHR_G4PHR5_LENGTH                    equ 0001h
COG4PHR_G4PHR5_MASK                      equ 0020h

