GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: COG4PHF
#define COG4PHF COG4PHF
COG4PHF                                  equ 088Eh
// bitfield definitions
COG4PHF_PHF_POSN                         equ 0000h
COG4PHF_PHF_POSITION                     equ 0000h
COG4PHF_PHF_SIZE                         equ 0006h
COG4PHF_PHF_LENGTH                       equ 0006h
COG4PHF_PHF_MASK                         equ 003Fh
COG4PHF_PHF0_POSN                        equ 0000h
COG4PHF_PHF0_POSITION                    equ 0000h
COG4PHF_PHF0_SIZE                        equ 0001h
COG4PHF_PHF0_LENGTH                      equ 0001h
COG4PHF_PHF0_MASK                        equ 0001h
COG4PHF_PHF1_POSN                        equ 0001h
COG4PHF_PHF1_POSITION                    equ 0001h
COG4PHF_PHF1_SIZE                        equ 0001h
COG4PHF_PHF1_LENGTH                      equ 0001h
COG4PHF_PHF1_MASK                        equ 0002h
COG4PHF_PHF2_POSN                        equ 0002h
COG4PHF_PHF2_POSITION                    equ 0002h
COG4PHF_PHF2_SIZE                        equ 0001h
COG4PHF_PHF2_LENGTH                      equ 0001h
COG4PHF_PHF2_MASK                        equ 0004h
COG4PHF_PHF3_POSN                        equ 0003h
COG4PHF_PHF3_POSITION                    equ 0003h
COG4PHF_PHF3_SIZE                        equ 0001h
COG4PHF_PHF3_LENGTH                      equ 0001h
COG4PHF_PHF3_MASK                        equ 0008h
COG4PHF_PHF4_POSN                        equ 0004h
COG4PHF_PHF4_POSITION                    equ 0004h
COG4PHF_PHF4_SIZE                        equ 0001h
COG4PHF_PHF4_LENGTH                      equ 0001h
COG4PHF_PHF4_MASK                        equ 0010h
COG4PHF_PHF5_POSN                        equ 0005h
COG4PHF_PHF5_POSITION                    equ 0005h
COG4PHF_PHF5_SIZE                        equ 0001h
COG4PHF_PHF5_LENGTH                      equ 0001h
COG4PHF_PHF5_MASK                        equ 0020h
COG4PHF_G4PHF0_POSN                      equ 0000h
COG4PHF_G4PHF0_POSITION                  equ 0000h
COG4PHF_G4PHF0_SIZE                      equ 0001h
COG4PHF_G4PHF0_LENGTH                    equ 0001h
COG4PHF_G4PHF0_MASK                      equ 0001h
COG4PHF_G4PHF1_POSN                      equ 0001h
COG4PHF_G4PHF1_POSITION                  equ 0001h
COG4PHF_G4PHF1_SIZE                      equ 0001h
COG4PHF_G4PHF1_LENGTH                    equ 0001h
COG4PHF_G4PHF1_MASK                      equ 0002h
COG4PHF_G4PHF2_POSN                      equ 0002h
COG4PHF_G4PHF2_POSITION                  equ 0002h
COG4PHF_G4PHF2_SIZE                      equ 0001h
COG4PHF_G4PHF2_LENGTH                    equ 0001h
COG4PHF_G4PHF2_MASK                      equ 0004h
COG4PHF_G4PHF3_POSN                      equ 0003h
COG4PHF_G4PHF3_POSITION                  equ 0003h
COG4PHF_G4PHF3_SIZE                      equ 0001h
COG4PHF_G4PHF3_LENGTH                    equ 0001h
COG4PHF_G4PHF3_MASK                      equ 0008h
COG4PHF_G4PHF4_POSN                      equ 0004h
COG4PHF_G4PHF4_POSITION                  equ 0004h
COG4PHF_G4PHF4_SIZE                      equ 0001h
COG4PHF_G4PHF4_LENGTH                    equ 0001h
COG4PHF_G4PHF4_MASK                      equ 0010h
COG4PHF_G4PHF5_POSN                      equ 0005h
COG4PHF_G4PHF5_POSITION                  equ 0005h
COG4PHF_G4PHF5_SIZE                      equ 0001h
COG4PHF_G4PHF5_LENGTH                    equ 0001h
COG4PHF_G4PHF5_MASK                      equ 0020h

// Register: COG4BLKR
#define COG4BLKR COG4BLKR
COG4BLKR                                 equ 088Fh
// bitfield definitions
COG4BLKR_BLKR_POSN                       equ 0000h
COG4BLKR_BLKR_POSITION                   equ 0000h
COG4BLKR_BLKR_SIZE                       equ 0006h
COG4BLKR_BLKR_LENGTH                     equ 0006h
COG4BLKR_BLKR_MASK                       equ 003Fh
COG4BLKR_BLKR0_POSN                      equ 0000h
COG4BLKR_BLKR0_POSITION                  equ 0000h
COG4BLKR_BLKR0_SIZE                      equ 0001h
COG4BLKR_BLKR0_LENGTH                    equ 0001h
COG4BLKR_BLKR0_MASK                      equ 0001h
COG4BLKR_BLKR1_POSN                      equ 0001h
COG4BLKR_BLKR1_POSITION                  equ 0001h
COG4BLKR_BLKR1_SIZE                      equ 0001h
COG4BLKR_BLKR1_LENGTH                    equ 0001h
COG4BLKR_BLKR1_MASK                      equ 0002h
COG4BLKR_BLKR2_POSN                      equ 0002h
COG4BLKR_BLKR2_POSITION                  equ 0002h
COG4BLKR_BLKR2_SIZE                      equ 0001h
COG4BLKR_BLKR2_LENGTH                    equ 0001h
COG4BLKR_BLKR2_MASK                      equ 0004h
COG4BLKR_BLKR3_POSN                      equ 0003h
COG4BLKR_BLKR3_POSITION                  equ 0003h
COG4BLKR_BLKR3_SIZE                      equ 0001h
COG4BLKR_BLKR3_LENGTH                    equ 0001h
COG4BLKR_BLKR3_MASK                      equ 0008h
COG4BLKR_BLKR4_POSN                      equ 0004h
COG4BLKR_BLKR4_POSITION                  equ 0004h
COG4BLKR_BLKR4_SIZE                      equ 0001h
COG4BLKR_BLKR4_LENGTH                    equ 0001h
COG4BLKR_BLKR4_MASK                      equ 0010h
COG4BLKR_BLKR5_POSN                      equ 0005h
COG4BLKR_BLKR5_POSITION                  equ 0005h
COG4BLKR_BLKR5_SIZE                      equ 0001h
COG4BLKR_BLKR5_LENGTH                    equ 0001h
COG4BLKR_BLKR5_MASK                      equ 0020h
COG4BLKR_G4BLKR0_POSN                    equ 0000h
COG4BLKR_G4BLKR0_POSITION                equ 0000h
COG4BLKR_G4BLKR0_SIZE                    equ 0001h
COG4BLKR_G4BLKR0_LENGTH                  equ 0001h
COG4BLKR_G4BLKR0_MASK                    equ 0001h
COG4BLKR_G4BLKR1_POSN                    equ 0001h
COG4BLKR_G4BLKR1_POSITION                equ 0001h
COG4BLKR_G4BLKR1_SIZE                    equ 0001h
COG4BLKR_G4BLKR1_LENGTH                  equ 0001h
COG4BLKR_G4BLKR1_MASK                    equ 0002h
COG4BLKR_G4BLKR2_POSN                    equ 0002h
COG4BLKR_G4BLKR2_POSITION                equ 0002h
COG4BLKR_G4BLKR2_SIZE                    equ 0001h
COG4BLKR_G4BLKR2_LENGTH                  equ 0001h
COG4BLKR_G4BLKR2_MASK                    equ 0004h
COG4BLKR_G4BLKR3_POSN                    equ 0003h
COG4BLKR_G4BLKR3_POSITION                equ 0003h
COG4BLKR_G4BLKR3_SIZE                    equ 0001h
COG4BLKR_G4BLKR3_LENGTH                  equ 0001h
COG4BLKR_G4BLKR3_MASK                    equ 0008h
COG4BLKR_G4BLKR4_POSN                    equ 0004h
COG4BLKR_G4BLKR4_POSITION                equ 0004h
COG4BLKR_G4BLKR4_SIZE                    equ 0001h
COG4BLKR_G4BLKR4_LENGTH                  equ 0001h
COG4BLKR_G4BLKR4_MASK                    equ 0010h
COG4BLKR_G4BLKR5_POSN                    equ 0005h
COG4BLKR_G4BLKR5_POSITION                equ 0005h
COG4BLKR_G4BLKR5_SIZE                    equ 0001h
COG4BLKR_G4BLKR5_LENGTH                  equ 0001h
COG4BLKR_G4BLKR5_MASK                    equ 0020h

// Register: COG4BLKF
#define COG4BLKF COG4BLKF
COG4BLKF                                 equ 0890h
// bitfield definitions
COG4BLKF_BLKF_POSN                       equ 0000h
COG4BLKF_BLKF_POSITION                   equ 0000h
COG4BLKF_BLKF_SIZE                       equ 0006h
COG4BLKF_BLKF_LENGTH                     equ 0006h
COG4BLKF_BLKF_MASK                       equ 003Fh
COG4BLKF_BLKF0_POSN                      equ 0000h
COG4BLKF_BLKF0_POSITION                  equ 0000h
COG4BLKF_BLKF0_SIZE                      equ 0001h
COG4BLKF_BLKF0_LENGTH                    equ 0001h
COG4BLKF_BLKF0_MASK                      equ 0001h
COG4BLKF_BLKF1_POSN                      equ 0001h
COG4BLKF_BLKF1_POSITION                  equ 0001h
COG4BLKF_BLKF1_SIZE                      equ 0001h
COG4BLKF_BLKF1_LENGTH                    equ 0001h
COG4BLKF_BLKF1_MASK                      equ 0002h
COG4BLKF_BLKF2_POSN                      equ 0002h
COG4BLKF_BLKF2_POSITION                  equ 0002h
COG4BLKF_BLKF2_SIZE                      equ 0001h
COG4BLKF_BLKF2_LENGTH                    equ 0001h
COG4BLKF_BLKF2_MASK                      equ 0004h
COG4BLKF_BLKF3_POSN                      equ 0003h
COG4BLKF_BLKF3_POSITION                  equ 0003h
COG4BLKF_BLKF3_SIZE                      equ 0001h
COG4BLKF_BLKF3_LENGTH                    equ 0001h
COG4BLKF_BLKF3_MASK                      equ 0008h
COG4BLKF_BLKF4_POSN                      equ 0004h
COG4BLKF_BLKF4_POSITION                  equ 0004h
COG4BLKF_BLKF4_SIZE                      equ 0001h
COG4BLKF_BLKF4_LENGTH                    equ 0001h
COG4BLKF_BLKF4_MASK                      equ 0010h
COG4BLKF_BLKF5_POSN                      equ 0005h
COG4BLKF_BLKF5_POSITION                  equ 0005h
COG4BLKF_BLKF5_SIZE                      equ 0001h
COG4BLKF_BLKF5_LENGTH                    equ 0001h
COG4BLKF_BLKF5_MASK                      equ 0020h
COG4BLKF_G4BLKF0_POSN                    equ 0000h
COG4BLKF_G4BLKF0_POSITION                equ 0000h
COG4BLKF_G4BLKF0_SIZE                    equ 0001h
COG4BLKF_G4BLKF0_LENGTH                  equ 0001h
COG4BLKF_G4BLKF0_MASK                    equ 0001h
COG4BLKF_G4BLKF1_POSN                    equ 0001h
COG4BLKF_G4BLKF1_POSITION                equ 0001h
COG4BLKF_G4BLKF1_SIZE                    equ 0001h
COG4BLKF_G4BLKF1_LENGTH                  equ 0001h
COG4BLKF_G4BLKF1_MASK                    equ 0002h
COG4BLKF_G4BLKF2_POSN                    equ 0002h
COG4BLKF_G4BLKF2_POSITION                equ 0002h
COG4BLKF_G4BLKF2_SIZE                    equ 0001h
COG4BLKF_G4BLKF2_LENGTH                  equ 0001h
COG4BLKF_G4BLKF2_MASK                    equ 0004h
COG4BLKF_G4BLKF3_POSN                    equ 0003h
COG4BLKF_G4BLKF3_POSITION                equ 0003h
COG4BLKF_G4BLKF3_SIZE                    equ 0001h
COG4BLKF_G4BLKF3_LENGTH                  equ 0001h
COG4BLKF_G4BLKF3_MASK                    equ 0008h
COG4BLKF_G4BLKF4_POSN                    equ 0004h
COG4BLKF_G4BLKF4_POSITION                equ 0004h
COG4BLKF_G4BLKF4_SIZE                    equ 0001h
COG4BLKF_G4BLKF4_LENGTH                  equ 0001h
COG4BLKF_G4BLKF4_MASK                    equ 0010h
COG4BLKF_G4BLKF5_POSN                    equ 0005h
COG4BLKF_G4BLKF5_POSITION                equ 0005h
COG4BLKF_G4BLKF5_SIZE                    equ 0001h
COG4BLKF_G4BLKF5_LENGTH                  equ 0001h
COG4BLKF_G4BLKF5_MASK                    equ 0020h

// Register: COG4DBR
#define COG4DBR COG4DBR
COG4DBR                                  equ 0891h
// bitfield definitions
COG4DBR_DBR_POSN                         equ 0000h
COG4DBR_DBR_POSITION                     equ 0000h
COG4DBR_DBR_SIZE                         equ 0006h
COG4DBR_DBR_LENGTH                       equ 0006h
COG4DBR_DBR_MASK                         equ 003Fh
COG4DBR_DBR0_POSN                        equ 0000h
COG4DBR_DBR0_POSITION                    equ 0000h
COG4DBR_DBR0_SIZE                        equ 0001h
COG4DBR_DBR0_LENGTH                      equ 0001h
COG4DBR_DBR0_MASK                        equ 0001h
COG4DBR_DBR1_POSN                        equ 0001h
COG4DBR_DBR1_POSITION                    equ 0001h
COG4DBR_DBR1_SIZE                        equ 0001h
COG4DBR_DBR1_LENGTH                      equ 0001h
COG4DBR_DBR1_MASK                        equ 0002h
COG4DBR_DBR2_POSN                        equ 0002h
COG4DBR_DBR2_POSITION                    equ 0002h
COG4DBR_DBR2_SIZE                        equ 0001h
COG4DBR_DBR2_LENGTH                      equ 0001h
COG4DBR_DBR2_MASK                        equ 0004h
COG4DBR_DBR3_POSN                        equ 0003h
COG4DBR_DBR3_POSITION                    equ 0003h
COG4DBR_DBR3_SIZE                        equ 0001h
COG4DBR_DBR3_LENGTH                      equ 0001h
COG4DBR_DBR3_MASK                        equ 0008h
COG4DBR_DBR4_POSN                        equ 0004h
COG4DBR_DBR4_POSITION                    equ 0004h
COG4DBR_DBR4_SIZE                        equ 0001h
COG4DBR_DBR4_LENGTH                      equ 0001h
COG4DBR_DBR4_MASK                        equ 0010h
COG4DBR_DBR5_POSN                        equ 0005h
COG4DBR_DBR5_POSITION                    equ 0005h
COG4DBR_DBR5_SIZE                        equ 0001h
COG4DBR_DBR5_LENGTH                      equ 0001h
COG4DBR_DBR5_MASK                        equ 0020h
COG4DBR_G4DBR0_POSN                      equ 0000h
COG4DBR_G4DBR0_POSITION                  equ 0000h
COG4DBR_G4DBR0_SIZE                      equ 0001h
COG4DBR_G4DBR0_LENGTH                    equ 0001h
COG4DBR_G4DBR0_MASK                      equ 0001h
COG4DBR_G4DBR1_POSN                      equ 0001h
COG4DBR_G4DBR1_POSITION                  equ 0001h
COG4DBR_G4DBR1_SIZE                      equ 0001h
COG4DBR_G4DBR1_LENGTH                    equ 0001h
COG4DBR_G4DBR1_MASK                      equ 0002h
COG4DBR_G4DBR2_POSN                      equ 0002h
COG4DBR_G4DBR2_POSITION                  equ 0002h
COG4DBR_G4DBR2_SIZE                      equ 0001h
COG4DBR_G4DBR2_LENGTH                    equ 0001h
COG4DBR_G4DBR2_MASK                      equ 0004h
COG4DBR_G4DBR3_POSN                      equ 0003h
COG4DBR_G4DBR3_POSITION                  equ 0003h
COG4DBR_G4DBR3_SIZE                      equ 0001h
COG4DBR_G4DBR3_LENGTH                    equ 0001h
COG4DBR_G4DBR3_MASK                      equ 0008h
COG4DBR_G4DBR4_POSN                      equ 0004h
COG4DBR_G4DBR4_POSITION                  equ 0004h
COG4DBR_G4DBR4_SIZE                      equ 0001h
COG4DBR_G4DBR4_LENGTH                    equ 0001h
COG4DBR_G4DBR4_MASK                      equ 0010h
COG4DBR_G4DBR5_POSN                      equ 0005h
COG4DBR_G4DBR5_POSITION                  equ 0005h
COG4DBR_G4DBR5_SIZE                      equ 0001h
COG4DBR_G4DBR5_LENGTH                    equ 0001h
COG4DBR_G4DBR5_MASK                      equ 0020h

// Register: COG4DBF
#define COG4DBF COG4DBF
COG4DBF                                  equ 0892h
// bitfield definitions
COG4DBF_DBF0_POSN                        equ 0000h
COG4DBF_DBF0_POSITION                    equ 0000h
COG4DBF_DBF0_SIZE                        equ 0001h
COG4DBF_DBF0_LENGTH                      equ 0001h
COG4DBF_DBF0_MASK                        equ 0001h
COG4DBF_DBF1_POSN                        equ 0001h
COG4DBF_DBF1_POSITION                    equ 0001h
COG4DBF_DBF1_SIZE                        equ 0001h
COG4DBF_DBF1_LENGTH                      equ 0001h
COG4DBF_DBF1_MASK                        equ 0002h
COG4DBF_DBF2_POSN                        equ 0002h
COG4DBF_DBF2_POSITION                    equ 0002h
COG4DBF_DBF2_SIZE                        equ 0001h
COG4DBF_DBF2_LENGTH                      equ 0001h
COG4DBF_DBF2_MASK                        equ 0004h
COG4DBF_DBF3_POSN                        equ 0003h
COG4DBF_DBF3_POSITION                    equ 0003h
COG4DBF_DBF3_SIZE                        equ 0001h
COG4DBF_DBF3_LENGTH                      equ 0001h
COG4DBF_DBF3_MASK                        equ 0008h
COG4DBF_DBF4_POSN                        equ 0004h
COG4DBF_DBF4_POSITION                    equ 0004h
COG4DBF_DBF4_SIZE                        equ 0001h
COG4DBF_DBF4_LENGTH                      equ 0001h
COG4DBF_DBF4_MASK                        equ 0010h
COG4DBF_DBF5_POSN                        equ 0005h
COG4DBF_DBF5_POSITION                    equ 0005h
COG4DBF_DBF5_SIZE                        equ 0001h
COG4DBF_DBF5_LENGTH                      equ 0001h
COG4DBF_DBF5_MASK                        equ 0020h
COG4DBF_G4DBF0_POSN                      equ 0000h
COG4DBF_G4DBF0_POSITION                  equ 0000h
COG4DBF_G4DBF0_SIZE                      equ 0001h
COG4DBF_G4DBF0_LENGTH                    equ 0001h
COG4DBF_G4DBF0_MASK                      equ 0001h
COG4DBF_G4DBF1_POSN                      equ 0001h
COG4DBF_G4DBF1_POSITION                  equ 0001h
COG4DBF_G4DBF1_SIZE                      equ 0001h
COG4DBF_G4DBF1_LENGTH                    equ 0001h
COG4DBF_G4DBF1_MASK                      equ 0002h
COG4DBF_G4DBF2_POSN                      equ 0002h
COG4DBF_G4DBF2_POSITION                  equ 0002h
COG4DBF_G4DBF2_SIZE                      equ 0001h
COG4DBF_G4DBF2_LENGTH                    equ 0001h
COG4DBF_G4DBF2_MASK                      equ 0004h
COG4DBF_G4DBF3_POSN                      equ 0003h
COG4DBF_G4DBF3_POSITION                  equ 0003h
COG4DBF_G4DBF3_SIZE                      equ 0001h
COG4DBF_G4DBF3_LENGTH                    equ 0001h
COG4DBF_G4DBF3_MASK                      equ 0008h
COG4DBF_G4DBF4_POSN                      equ 0004h
COG4DBF_G4DBF4_POSITION                  equ 0004h
COG4DBF_G4DBF4_SIZE                      equ 0001h
COG4DBF_G4DBF4_LENGTH                    equ 0001h
COG4DBF_G4DBF4_MASK                      equ 0010h
COG4DBF_G4DBF5_POSN                      equ 0005h
COG4DBF_G4DBF5_POSITION                  equ 0005h
COG4DBF_G4DBF5_SIZE                      equ 0001h
COG4DBF_G4DBF5_LENGTH                    equ 0001h
COG4DBF_G4DBF5_MASK                      equ 0020h
COG4DBF_G4DBF_POSN                       equ 0000h
COG4DBF_G4DBF_POSITION                   equ 0000h
COG4DBF_G4DBF_SIZE                       equ 0006h
COG4DBF_G4DBF_LENGTH                     equ 0006h
COG4DBF_G4DBF_MASK                       equ 003Fh

// Register: COG4CON0
#define COG4CON0 COG4CON0
COG4CON0                                 equ 0893h
// bitfield definitions
COG4CON0_MD_POSN                         equ 0000h
COG4CON0_MD_POSITION                     equ 0000h
COG4CON0_MD_SIZE                         equ 0003h
COG4CON0_MD_LENGTH                       equ 0003h
COG4CON0_MD_MASK                         equ 0007h
COG4CON0_CS_POSN                         equ 0003h
COG4CON0_CS_POSITION                     equ 0003h
COG4CON0_CS_SIZE                         equ 0002h
COG4CON0_CS_LENGTH                       equ 0002h
COG4CON0_CS_MASK                         equ 0018h
COG4CON0_LD_POSN                         equ 0006h
COG4CON0_LD_POSITION                     equ 0006h
COG4CON0_LD_SIZE                         equ 0001h
COG4CON0_LD_LENGTH                       equ 0001h
COG4CON0_LD_MASK                         equ 0040h
COG4CON0_EN_POSN                         equ 0007h
COG4CON0_EN_POSITION                     equ 0007h
COG4CON0_EN_SIZE                         equ 0001h
COG4CON0_EN_LENGTH                       equ 0001h
COG4CON0_EN_MASK                         equ 0080h
COG4CON0_MD0_POSN                        equ 0000h
COG4CON0_MD0_POSITION                    equ 0000h
COG4CON0_MD0_SIZE                        equ 0001h
COG4CON0_MD0_LENGTH                      equ 0001h
COG4CON0_MD0_MASK                        equ 0001h
COG4CON0_MD1_POSN                        equ 0001h
COG4CON0_MD1_POSITION                    equ 0001h
COG4CON0_MD1_SIZE                        equ 0001h
COG4CON0_MD1_LENGTH                      equ 0001h
COG4CON0_MD1_MASK                        equ 0002h
COG4CON0_MD2_POSN                        equ 0002h
COG4CON0_MD2_POSITION                    equ 0002h
COG4CON0_MD2_SIZE                        equ 0001h
COG4CON0_MD2_LENGTH                      equ 0001h
COG4CON0_MD2_MASK                        equ 0004h
COG4CON0_CS0_POSN                        equ 0003h
COG4CON0_CS0_POSITION                    equ 0003h
COG4CON0_CS0_SIZE                        equ 0001h
COG4CON0_CS0_LENGTH                      equ 0001h
COG4CON0_CS0_MASK                        equ 0008h
COG4CON0_CS1_POSN                        equ 0004h
COG4CON0_CS1_POSITION                    equ 0004h
COG4CON0_CS1_SIZE                        equ 0001h
COG4CON0_CS1_LENGTH                      equ 0001h
COG4CON0_CS1_MASK                        equ 0010h
COG4CON0_G4MD_POSN                       equ 0000h
COG4CON0_G4MD_POSITION                   equ 0000h
COG4CON0_G4MD_SIZE                       equ 0003h
COG4CON0_G4MD_LENGTH                     equ 0003h
COG4CON0_G4MD_MASK                       equ 0007h
COG4CON0_G4CS_POSN                       equ 0003h
COG4CON0_G4CS_POSITION                   equ 0003h
COG4CON0_G4CS_SIZE                       equ 0002h
COG4CON0_G4CS_LENGTH                     equ 0002h
COG4CON0_G4CS_MASK                       equ 0018h
COG4CON0_G4LD_POSN                       equ 0006h
COG4CON0_G4LD_POSITION                   equ 0006h
COG4CON0_G4LD_SIZE                       equ 0001h
COG4CON0_G4LD_LENGTH                     equ 0001h
COG4CON0_G4LD_MASK                       equ 0040h
COG4CON0_G4EN_POSN                       equ 0007h
COG4CON0_G4EN_POSITION                   equ 0007h
COG4CON0_G4EN_SIZE                       equ 0001h
COG4CON0_G4EN_LENGTH                     equ 0001h
COG4CON0_G4EN_MASK                       equ 0080h
COG4CON0_G4MD0_POSN                      equ 0000h
COG4CON0_G4MD0_POSITION                  equ 0000h
COG4CON0_G4MD0_SIZE                      equ 0001h
COG4CON0_G4MD0_LENGTH                    equ 0001h
COG4CON0_G4MD0_MASK                      equ 0001h
COG4CON0_G4MD1_POSN                      equ 0001h
COG4CON0_G4MD1_POSITION                  equ 0001h
COG4CON0_G4MD1_SIZE                      equ 0001h
COG4CON0_G4MD1_LENGTH                    equ 0001h
COG4CON0_G4MD1_MASK                      equ 0002h
COG4CON0_G4MD2_POSN                      equ 0002h
COG4CON0_G4MD2_POSITION                  equ 0002h
COG4CON0_G4MD2_SIZE                      equ 0001h
COG4CON0_G4MD2_LENGTH                    equ 0001h
COG4CON0_G4MD2_MASK                      equ 0004h
COG4CON0_G4CS0_POSN                      equ 0003h
COG4CON0_G4CS0_POSITION                  equ 0003h
COG4CON0_G4CS0_SIZE                      equ 0001h
COG4CON0_G4CS0_LENGTH                    equ 0001h
COG4CON0_G4CS0_MASK                      equ 0008h
COG4CON0_G4CS1_POSN                      equ 0004h
COG4CON0_G4CS1_POSITION                  equ 0004h
COG4CON0_G4CS1_SIZE                      equ 0001h
COG4CON0_G4CS1_LENGTH                    equ 0001h
COG4CON0_G4CS1_MASK                      equ 0010h

