GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: COG4RSIM0
#define COG4RSIM0 COG4RSIM0
COG4RSIM0                                equ 0897h
// bitfield definitions
COG4RSIM0_RSIM0_POSN                     equ 0000h
COG4RSIM0_RSIM0_POSITION                 equ 0000h
COG4RSIM0_RSIM0_SIZE                     equ 0001h
COG4RSIM0_RSIM0_LENGTH                   equ 0001h
COG4RSIM0_RSIM0_MASK                     equ 0001h
COG4RSIM0_RSIM1_POSN                     equ 0001h
COG4RSIM0_RSIM1_POSITION                 equ 0001h
COG4RSIM0_RSIM1_SIZE                     equ 0001h
COG4RSIM0_RSIM1_LENGTH                   equ 0001h
COG4RSIM0_RSIM1_MASK                     equ 0002h
COG4RSIM0_RSIM2_POSN                     equ 0002h
COG4RSIM0_RSIM2_POSITION                 equ 0002h
COG4RSIM0_RSIM2_SIZE                     equ 0001h
COG4RSIM0_RSIM2_LENGTH                   equ 0001h
COG4RSIM0_RSIM2_MASK                     equ 0004h
COG4RSIM0_RSIM3_POSN                     equ 0003h
COG4RSIM0_RSIM3_POSITION                 equ 0003h
COG4RSIM0_RSIM3_SIZE                     equ 0001h
COG4RSIM0_RSIM3_LENGTH                   equ 0001h
COG4RSIM0_RSIM3_MASK                     equ 0008h
COG4RSIM0_RSIM4_POSN                     equ 0004h
COG4RSIM0_RSIM4_POSITION                 equ 0004h
COG4RSIM0_RSIM4_SIZE                     equ 0001h
COG4RSIM0_RSIM4_LENGTH                   equ 0001h
COG4RSIM0_RSIM4_MASK                     equ 0010h
COG4RSIM0_RSIM5_POSN                     equ 0005h
COG4RSIM0_RSIM5_POSITION                 equ 0005h
COG4RSIM0_RSIM5_SIZE                     equ 0001h
COG4RSIM0_RSIM5_LENGTH                   equ 0001h
COG4RSIM0_RSIM5_MASK                     equ 0020h
COG4RSIM0_RSIM6_POSN                     equ 0006h
COG4RSIM0_RSIM6_POSITION                 equ 0006h
COG4RSIM0_RSIM6_SIZE                     equ 0001h
COG4RSIM0_RSIM6_LENGTH                   equ 0001h
COG4RSIM0_RSIM6_MASK                     equ 0040h
COG4RSIM0_RSIM7_POSN                     equ 0007h
COG4RSIM0_RSIM7_POSITION                 equ 0007h
COG4RSIM0_RSIM7_SIZE                     equ 0001h
COG4RSIM0_RSIM7_LENGTH                   equ 0001h
COG4RSIM0_RSIM7_MASK                     equ 0080h
COG4RSIM0_G4RSIM0_POSN                   equ 0000h
COG4RSIM0_G4RSIM0_POSITION               equ 0000h
COG4RSIM0_G4RSIM0_SIZE                   equ 0001h
COG4RSIM0_G4RSIM0_LENGTH                 equ 0001h
COG4RSIM0_G4RSIM0_MASK                   equ 0001h
COG4RSIM0_G4RSIM1_POSN                   equ 0001h
COG4RSIM0_G4RSIM1_POSITION               equ 0001h
COG4RSIM0_G4RSIM1_SIZE                   equ 0001h
COG4RSIM0_G4RSIM1_LENGTH                 equ 0001h
COG4RSIM0_G4RSIM1_MASK                   equ 0002h
COG4RSIM0_G4RSIM2_POSN                   equ 0002h
COG4RSIM0_G4RSIM2_POSITION               equ 0002h
COG4RSIM0_G4RSIM2_SIZE                   equ 0001h
COG4RSIM0_G4RSIM2_LENGTH                 equ 0001h
COG4RSIM0_G4RSIM2_MASK                   equ 0004h
COG4RSIM0_G4RSIM3_POSN                   equ 0003h
COG4RSIM0_G4RSIM3_POSITION               equ 0003h
COG4RSIM0_G4RSIM3_SIZE                   equ 0001h
COG4RSIM0_G4RSIM3_LENGTH                 equ 0001h
COG4RSIM0_G4RSIM3_MASK                   equ 0008h
COG4RSIM0_G4RSIM4_POSN                   equ 0004h
COG4RSIM0_G4RSIM4_POSITION               equ 0004h
COG4RSIM0_G4RSIM4_SIZE                   equ 0001h
COG4RSIM0_G4RSIM4_LENGTH                 equ 0001h
COG4RSIM0_G4RSIM4_MASK                   equ 0010h
COG4RSIM0_G4RSIM5_POSN                   equ 0005h
COG4RSIM0_G4RSIM5_POSITION               equ 0005h
COG4RSIM0_G4RSIM5_SIZE                   equ 0001h
COG4RSIM0_G4RSIM5_LENGTH                 equ 0001h
COG4RSIM0_G4RSIM5_MASK                   equ 0020h
COG4RSIM0_G4RSIM6_POSN                   equ 0006h
COG4RSIM0_G4RSIM6_POSITION               equ 0006h
COG4RSIM0_G4RSIM6_SIZE                   equ 0001h
COG4RSIM0_G4RSIM6_LENGTH                 equ 0001h
COG4RSIM0_G4RSIM6_MASK                   equ 0040h
COG4RSIM0_G4RSIM7_POSN                   equ 0007h
COG4RSIM0_G4RSIM7_POSITION               equ 0007h
COG4RSIM0_G4RSIM7_SIZE                   equ 0001h
COG4RSIM0_G4RSIM7_LENGTH                 equ 0001h
COG4RSIM0_G4RSIM7_MASK                   equ 0080h

// Register: COG4RSIM1
#define COG4RSIM1 COG4RSIM1
COG4RSIM1                                equ 0898h
// bitfield definitions
COG4RSIM1_RSIM8_POSN                     equ 0000h
COG4RSIM1_RSIM8_POSITION                 equ 0000h
COG4RSIM1_RSIM8_SIZE                     equ 0001h
COG4RSIM1_RSIM8_LENGTH                   equ 0001h
COG4RSIM1_RSIM8_MASK                     equ 0001h
COG4RSIM1_RSIM9_POSN                     equ 0001h
COG4RSIM1_RSIM9_POSITION                 equ 0001h
COG4RSIM1_RSIM9_SIZE                     equ 0001h
COG4RSIM1_RSIM9_LENGTH                   equ 0001h
COG4RSIM1_RSIM9_MASK                     equ 0002h
COG4RSIM1_RSIM10_POSN                    equ 0002h
COG4RSIM1_RSIM10_POSITION                equ 0002h
COG4RSIM1_RSIM10_SIZE                    equ 0001h
COG4RSIM1_RSIM10_LENGTH                  equ 0001h
COG4RSIM1_RSIM10_MASK                    equ 0004h
COG4RSIM1_RSIM11_POSN                    equ 0003h
COG4RSIM1_RSIM11_POSITION                equ 0003h
COG4RSIM1_RSIM11_SIZE                    equ 0001h
COG4RSIM1_RSIM11_LENGTH                  equ 0001h
COG4RSIM1_RSIM11_MASK                    equ 0008h
COG4RSIM1_RSIM12_POSN                    equ 0004h
COG4RSIM1_RSIM12_POSITION                equ 0004h
COG4RSIM1_RSIM12_SIZE                    equ 0001h
COG4RSIM1_RSIM12_LENGTH                  equ 0001h
COG4RSIM1_RSIM12_MASK                    equ 0010h
COG4RSIM1_RSIM13_POSN                    equ 0005h
COG4RSIM1_RSIM13_POSITION                equ 0005h
COG4RSIM1_RSIM13_SIZE                    equ 0001h
COG4RSIM1_RSIM13_LENGTH                  equ 0001h
COG4RSIM1_RSIM13_MASK                    equ 0020h
COG4RSIM1_RSIM14_POSN                    equ 0006h
COG4RSIM1_RSIM14_POSITION                equ 0006h
COG4RSIM1_RSIM14_SIZE                    equ 0001h
COG4RSIM1_RSIM14_LENGTH                  equ 0001h
COG4RSIM1_RSIM14_MASK                    equ 0040h
COG4RSIM1_RSIM15_POSN                    equ 0007h
COG4RSIM1_RSIM15_POSITION                equ 0007h
COG4RSIM1_RSIM15_SIZE                    equ 0001h
COG4RSIM1_RSIM15_LENGTH                  equ 0001h
COG4RSIM1_RSIM15_MASK                    equ 0080h
COG4RSIM1_G4RSIM8_POSN                   equ 0000h
COG4RSIM1_G4RSIM8_POSITION               equ 0000h
COG4RSIM1_G4RSIM8_SIZE                   equ 0001h
COG4RSIM1_G4RSIM8_LENGTH                 equ 0001h
COG4RSIM1_G4RSIM8_MASK                   equ 0001h
COG4RSIM1_G4RSIM9_POSN                   equ 0001h
COG4RSIM1_G4RSIM9_POSITION               equ 0001h
COG4RSIM1_G4RSIM9_SIZE                   equ 0001h
COG4RSIM1_G4RSIM9_LENGTH                 equ 0001h
COG4RSIM1_G4RSIM9_MASK                   equ 0002h
COG4RSIM1_G4RSIM10_POSN                  equ 0002h
COG4RSIM1_G4RSIM10_POSITION              equ 0002h
COG4RSIM1_G4RSIM10_SIZE                  equ 0001h
COG4RSIM1_G4RSIM10_LENGTH                equ 0001h
COG4RSIM1_G4RSIM10_MASK                  equ 0004h
COG4RSIM1_G4RSIM11_POSN                  equ 0003h
COG4RSIM1_G4RSIM11_POSITION              equ 0003h
COG4RSIM1_G4RSIM11_SIZE                  equ 0001h
COG4RSIM1_G4RSIM11_LENGTH                equ 0001h
COG4RSIM1_G4RSIM11_MASK                  equ 0008h
COG4RSIM1_G4RSIM12_POSN                  equ 0004h
COG4RSIM1_G4RSIM12_POSITION              equ 0004h
COG4RSIM1_G4RSIM12_SIZE                  equ 0001h
COG4RSIM1_G4RSIM12_LENGTH                equ 0001h
COG4RSIM1_G4RSIM12_MASK                  equ 0010h
COG4RSIM1_G4RSIM13_POSN                  equ 0005h
COG4RSIM1_G4RSIM13_POSITION              equ 0005h
COG4RSIM1_G4RSIM13_SIZE                  equ 0001h
COG4RSIM1_G4RSIM13_LENGTH                equ 0001h
COG4RSIM1_G4RSIM13_MASK                  equ 0020h
COG4RSIM1_G4RSIM14_POSN                  equ 0006h
COG4RSIM1_G4RSIM14_POSITION              equ 0006h
COG4RSIM1_G4RSIM14_SIZE                  equ 0001h
COG4RSIM1_G4RSIM14_LENGTH                equ 0001h
COG4RSIM1_G4RSIM14_MASK                  equ 0040h
COG4RSIM1_G4RSIM15_POSN                  equ 0007h
COG4RSIM1_G4RSIM15_POSITION              equ 0007h
COG4RSIM1_G4RSIM15_SIZE                  equ 0001h
COG4RSIM1_G4RSIM15_LENGTH                equ 0001h
COG4RSIM1_G4RSIM15_MASK                  equ 0080h

// Register: COG4FIS0
#define COG4FIS0 COG4FIS0
COG4FIS0                                 equ 0899h
// bitfield definitions
COG4FIS0_FIS0_POSN                       equ 0000h
COG4FIS0_FIS0_POSITION                   equ 0000h
COG4FIS0_FIS0_SIZE                       equ 0001h
COG4FIS0_FIS0_LENGTH                     equ 0001h
COG4FIS0_FIS0_MASK                       equ 0001h
COG4FIS0_FIS1_POSN                       equ 0001h
COG4FIS0_FIS1_POSITION                   equ 0001h
COG4FIS0_FIS1_SIZE                       equ 0001h
COG4FIS0_FIS1_LENGTH                     equ 0001h
COG4FIS0_FIS1_MASK                       equ 0002h
COG4FIS0_FIS2_POSN                       equ 0002h
COG4FIS0_FIS2_POSITION                   equ 0002h
COG4FIS0_FIS2_SIZE                       equ 0001h
COG4FIS0_FIS2_LENGTH                     equ 0001h
COG4FIS0_FIS2_MASK                       equ 0004h
COG4FIS0_FIS3_POSN                       equ 0003h
COG4FIS0_FIS3_POSITION                   equ 0003h
COG4FIS0_FIS3_SIZE                       equ 0001h
COG4FIS0_FIS3_LENGTH                     equ 0001h
COG4FIS0_FIS3_MASK                       equ 0008h
COG4FIS0_FIS4_POSN                       equ 0004h
COG4FIS0_FIS4_POSITION                   equ 0004h
COG4FIS0_FIS4_SIZE                       equ 0001h
COG4FIS0_FIS4_LENGTH                     equ 0001h
COG4FIS0_FIS4_MASK                       equ 0010h
COG4FIS0_FIS5_POSN                       equ 0005h
COG4FIS0_FIS5_POSITION                   equ 0005h
COG4FIS0_FIS5_SIZE                       equ 0001h
COG4FIS0_FIS5_LENGTH                     equ 0001h
COG4FIS0_FIS5_MASK                       equ 0020h
COG4FIS0_FIS6_POSN                       equ 0006h
COG4FIS0_FIS6_POSITION                   equ 0006h
COG4FIS0_FIS6_SIZE                       equ 0001h
COG4FIS0_FIS6_LENGTH                     equ 0001h
COG4FIS0_FIS6_MASK                       equ 0040h
COG4FIS0_FIS7_POSN                       equ 0007h
COG4FIS0_FIS7_POSITION                   equ 0007h
COG4FIS0_FIS7_SIZE                       equ 0001h
COG4FIS0_FIS7_LENGTH                     equ 0001h
COG4FIS0_FIS7_MASK                       equ 0080h
COG4FIS0_G4FIS0_POSN                     equ 0000h
COG4FIS0_G4FIS0_POSITION                 equ 0000h
COG4FIS0_G4FIS0_SIZE                     equ 0001h
COG4FIS0_G4FIS0_LENGTH                   equ 0001h
COG4FIS0_G4FIS0_MASK                     equ 0001h
COG4FIS0_G4FIS1_POSN                     equ 0001h
COG4FIS0_G4FIS1_POSITION                 equ 0001h
COG4FIS0_G4FIS1_SIZE                     equ 0001h
COG4FIS0_G4FIS1_LENGTH                   equ 0001h
COG4FIS0_G4FIS1_MASK                     equ 0002h
COG4FIS0_G4FIS2_POSN                     equ 0002h
COG4FIS0_G4FIS2_POSITION                 equ 0002h
COG4FIS0_G4FIS2_SIZE                     equ 0001h
COG4FIS0_G4FIS2_LENGTH                   equ 0001h
COG4FIS0_G4FIS2_MASK                     equ 0004h
COG4FIS0_G4FIS3_POSN                     equ 0003h
COG4FIS0_G4FIS3_POSITION                 equ 0003h
COG4FIS0_G4FIS3_SIZE                     equ 0001h
COG4FIS0_G4FIS3_LENGTH                   equ 0001h
COG4FIS0_G4FIS3_MASK                     equ 0008h
COG4FIS0_G4FIS4_POSN                     equ 0004h
COG4FIS0_G4FIS4_POSITION                 equ 0004h
COG4FIS0_G4FIS4_SIZE                     equ 0001h
COG4FIS0_G4FIS4_LENGTH                   equ 0001h
COG4FIS0_G4FIS4_MASK                     equ 0010h
COG4FIS0_G4FIS5_POSN                     equ 0005h
COG4FIS0_G4FIS5_POSITION                 equ 0005h
COG4FIS0_G4FIS5_SIZE                     equ 0001h
COG4FIS0_G4FIS5_LENGTH                   equ 0001h
COG4FIS0_G4FIS5_MASK                     equ 0020h
COG4FIS0_G4FIS6_POSN                     equ 0006h
COG4FIS0_G4FIS6_POSITION                 equ 0006h
COG4FIS0_G4FIS6_SIZE                     equ 0001h
COG4FIS0_G4FIS6_LENGTH                   equ 0001h
COG4FIS0_G4FIS6_MASK                     equ 0040h
COG4FIS0_G4FIS7_POSN                     equ 0007h
COG4FIS0_G4FIS7_POSITION                 equ 0007h
COG4FIS0_G4FIS7_SIZE                     equ 0001h
COG4FIS0_G4FIS7_LENGTH                   equ 0001h
COG4FIS0_G4FIS7_MASK                     equ 0080h

// Register: COG4FIS1
#define COG4FIS1 COG4FIS1
COG4FIS1                                 equ 089Ah
// bitfield definitions
COG4FIS1_FIS8_POSN                       equ 0000h
COG4FIS1_FIS8_POSITION                   equ 0000h
COG4FIS1_FIS8_SIZE                       equ 0001h
COG4FIS1_FIS8_LENGTH                     equ 0001h
COG4FIS1_FIS8_MASK                       equ 0001h
COG4FIS1_FIS9_POSN                       equ 0001h
COG4FIS1_FIS9_POSITION                   equ 0001h
COG4FIS1_FIS9_SIZE                       equ 0001h
COG4FIS1_FIS9_LENGTH                     equ 0001h
COG4FIS1_FIS9_MASK                       equ 0002h
COG4FIS1_FIS10_POSN                      equ 0002h
COG4FIS1_FIS10_POSITION                  equ 0002h
COG4FIS1_FIS10_SIZE                      equ 0001h
COG4FIS1_FIS10_LENGTH                    equ 0001h
COG4FIS1_FIS10_MASK                      equ 0004h
COG4FIS1_FIS11_POSN                      equ 0003h
COG4FIS1_FIS11_POSITION                  equ 0003h
COG4FIS1_FIS11_SIZE                      equ 0001h
COG4FIS1_FIS11_LENGTH                    equ 0001h
COG4FIS1_FIS11_MASK                      equ 0008h
COG4FIS1_FIS12_POSN                      equ 0004h
COG4FIS1_FIS12_POSITION                  equ 0004h
COG4FIS1_FIS12_SIZE                      equ 0001h
COG4FIS1_FIS12_LENGTH                    equ 0001h
COG4FIS1_FIS12_MASK                      equ 0010h
COG4FIS1_FIS13_POSN                      equ 0005h
COG4FIS1_FIS13_POSITION                  equ 0005h
COG4FIS1_FIS13_SIZE                      equ 0001h
COG4FIS1_FIS13_LENGTH                    equ 0001h
COG4FIS1_FIS13_MASK                      equ 0020h
COG4FIS1_FIS14_POSN                      equ 0006h
COG4FIS1_FIS14_POSITION                  equ 0006h
COG4FIS1_FIS14_SIZE                      equ 0001h
COG4FIS1_FIS14_LENGTH                    equ 0001h
COG4FIS1_FIS14_MASK                      equ 0040h
COG4FIS1_FIS15_POSN                      equ 0007h
COG4FIS1_FIS15_POSITION                  equ 0007h
COG4FIS1_FIS15_SIZE                      equ 0001h
COG4FIS1_FIS15_LENGTH                    equ 0001h
COG4FIS1_FIS15_MASK                      equ 0080h
COG4FIS1_G4FIS8_POSN                     equ 0000h
COG4FIS1_G4FIS8_POSITION                 equ 0000h
COG4FIS1_G4FIS8_SIZE                     equ 0001h
COG4FIS1_G4FIS8_LENGTH                   equ 0001h
COG4FIS1_G4FIS8_MASK                     equ 0001h
COG4FIS1_G4FIS9_POSN                     equ 0001h
COG4FIS1_G4FIS9_POSITION                 equ 0001h
COG4FIS1_G4FIS9_SIZE                     equ 0001h
COG4FIS1_G4FIS9_LENGTH                   equ 0001h
COG4FIS1_G4FIS9_MASK                     equ 0002h
COG4FIS1_G4FIS10_POSN                    equ 0002h
COG4FIS1_G4FIS10_POSITION                equ 0002h
COG4FIS1_G4FIS10_SIZE                    equ 0001h
COG4FIS1_G4FIS10_LENGTH                  equ 0001h
COG4FIS1_G4FIS10_MASK                    equ 0004h
COG4FIS1_G4FIS11_POSN                    equ 0003h
COG4FIS1_G4FIS11_POSITION                equ 0003h
COG4FIS1_G4FIS11_SIZE                    equ 0001h
COG4FIS1_G4FIS11_LENGTH                  equ 0001h
COG4FIS1_G4FIS11_MASK                    equ 0008h
COG4FIS1_G4FIS12_POSN                    equ 0004h
COG4FIS1_G4FIS12_POSITION                equ 0004h
COG4FIS1_G4FIS12_SIZE                    equ 0001h
COG4FIS1_G4FIS12_LENGTH                  equ 0001h
COG4FIS1_G4FIS12_MASK                    equ 0010h
COG4FIS1_G4FIS13_POSN                    equ 0005h
COG4FIS1_G4FIS13_POSITION                equ 0005h
COG4FIS1_G4FIS13_SIZE                    equ 0001h
COG4FIS1_G4FIS13_LENGTH                  equ 0001h
COG4FIS1_G4FIS13_MASK                    equ 0020h
COG4FIS1_G4FIS14_POSN                    equ 0006h
COG4FIS1_G4FIS14_POSITION                equ 0006h
COG4FIS1_G4FIS14_SIZE                    equ 0001h
COG4FIS1_G4FIS14_LENGTH                  equ 0001h
COG4FIS1_G4FIS14_MASK                    equ 0040h
COG4FIS1_G4FIS15_POSN                    equ 0007h
COG4FIS1_G4FIS15_POSITION                equ 0007h
COG4FIS1_G4FIS15_SIZE                    equ 0001h
COG4FIS1_G4FIS15_LENGTH                  equ 0001h
COG4FIS1_G4FIS15_MASK                    equ 0080h

// Register: COG4FSIM0
#define COG4FSIM0 COG4FSIM0
COG4FSIM0                                equ 089Bh
// bitfield definitions
COG4FSIM0_FSIM0_POSN                     equ 0000h
COG4FSIM0_FSIM0_POSITION                 equ 0000h
COG4FSIM0_FSIM0_SIZE                     equ 0001h
COG4FSIM0_FSIM0_LENGTH                   equ 0001h
COG4FSIM0_FSIM0_MASK                     equ 0001h
COG4FSIM0_FSIM1_POSN                     equ 0001h
COG4FSIM0_FSIM1_POSITION                 equ 0001h
COG4FSIM0_FSIM1_SIZE                     equ 0001h
COG4FSIM0_FSIM1_LENGTH                   equ 0001h
COG4FSIM0_FSIM1_MASK                     equ 0002h
COG4FSIM0_FSIM2_POSN                     equ 0002h
COG4FSIM0_FSIM2_POSITION                 equ 0002h
COG4FSIM0_FSIM2_SIZE                     equ 0001h
COG4FSIM0_FSIM2_LENGTH                   equ 0001h
COG4FSIM0_FSIM2_MASK                     equ 0004h
COG4FSIM0_FSIM3_POSN                     equ 0003h
COG4FSIM0_FSIM3_POSITION                 equ 0003h
COG4FSIM0_FSIM3_SIZE                     equ 0001h
COG4FSIM0_FSIM3_LENGTH                   equ 0001h
COG4FSIM0_FSIM3_MASK                     equ 0008h
COG4FSIM0_FSIM4_POSN                     equ 0004h
COG4FSIM0_FSIM4_POSITION                 equ 0004h
COG4FSIM0_FSIM4_SIZE                     equ 0001h
COG4FSIM0_FSIM4_LENGTH                   equ 0001h
COG4FSIM0_FSIM4_MASK                     equ 0010h
COG4FSIM0_FSIM5_POSN                     equ 0005h
COG4FSIM0_FSIM5_POSITION                 equ 0005h
COG4FSIM0_FSIM5_SIZE                     equ 0001h
COG4FSIM0_FSIM5_LENGTH                   equ 0001h
COG4FSIM0_FSIM5_MASK                     equ 0020h
COG4FSIM0_FSIM6_POSN                     equ 0006h
COG4FSIM0_FSIM6_POSITION                 equ 0006h
COG4FSIM0_FSIM6_SIZE                     equ 0001h
COG4FSIM0_FSIM6_LENGTH                   equ 0001h
COG4FSIM0_FSIM6_MASK                     equ 0040h
COG4FSIM0_FSIM7_POSN                     equ 0007h
COG4FSIM0_FSIM7_POSITION                 equ 0007h
COG4FSIM0_FSIM7_SIZE                     equ 0001h
COG4FSIM0_FSIM7_LENGTH                   equ 0001h
COG4FSIM0_FSIM7_MASK                     equ 0080h
COG4FSIM0_G4FSIM0_POSN                   equ 0000h
COG4FSIM0_G4FSIM0_POSITION               equ 0000h
COG4FSIM0_G4FSIM0_SIZE                   equ 0001h
COG4FSIM0_G4FSIM0_LENGTH                 equ 0001h
COG4FSIM0_G4FSIM0_MASK                   equ 0001h
COG4FSIM0_G4FSIM1_POSN                   equ 0001h
COG4FSIM0_G4FSIM1_POSITION               equ 0001h
COG4FSIM0_G4FSIM1_SIZE                   equ 0001h
COG4FSIM0_G4FSIM1_LENGTH                 equ 0001h
COG4FSIM0_G4FSIM1_MASK                   equ 0002h
COG4FSIM0_G4FSIM2_POSN                   equ 0002h
COG4FSIM0_G4FSIM2_POSITION               equ 0002h
COG4FSIM0_G4FSIM2_SIZE                   equ 0001h
COG4FSIM0_G4FSIM2_LENGTH                 equ 0001h
COG4FSIM0_G4FSIM2_MASK                   equ 0004h
COG4FSIM0_G4FSIM3_POSN                   equ 0003h
COG4FSIM0_G4FSIM3_POSITION               equ 0003h
COG4FSIM0_G4FSIM3_SIZE                   equ 0001h
COG4FSIM0_G4FSIM3_LENGTH                 equ 0001h
COG4FSIM0_G4FSIM3_MASK                   equ 0008h
COG4FSIM0_G4FSIM4_POSN                   equ 0004h
COG4FSIM0_G4FSIM4_POSITION               equ 0004h
COG4FSIM0_G4FSIM4_SIZE                   equ 0001h
COG4FSIM0_G4FSIM4_LENGTH                 equ 0001h
COG4FSIM0_G4FSIM4_MASK                   equ 0010h
COG4FSIM0_G4FSIM5_POSN                   equ 0005h
COG4FSIM0_G4FSIM5_POSITION               equ 0005h
COG4FSIM0_G4FSIM5_SIZE                   equ 0001h
COG4FSIM0_G4FSIM5_LENGTH                 equ 0001h
COG4FSIM0_G4FSIM5_MASK                   equ 0020h
COG4FSIM0_G4FSIM6_POSN                   equ 0006h
COG4FSIM0_G4FSIM6_POSITION               equ 0006h
COG4FSIM0_G4FSIM6_SIZE                   equ 0001h
COG4FSIM0_G4FSIM6_LENGTH                 equ 0001h
COG4FSIM0_G4FSIM6_MASK                   equ 0040h
COG4FSIM0_G4FSIM7_POSN                   equ 0007h
COG4FSIM0_G4FSIM7_POSITION               equ 0007h
COG4FSIM0_G4FSIM7_SIZE                   equ 0001h
COG4FSIM0_G4FSIM7_LENGTH                 equ 0001h
COG4FSIM0_G4FSIM7_MASK                   equ 0080h

