GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: COG4FSIM1
#define COG4FSIM1 COG4FSIM1
COG4FSIM1                                equ 089Ch
// bitfield definitions
COG4FSIM1_FSIM8_POSN                     equ 0000h
COG4FSIM1_FSIM8_POSITION                 equ 0000h
COG4FSIM1_FSIM8_SIZE                     equ 0001h
COG4FSIM1_FSIM8_LENGTH                   equ 0001h
COG4FSIM1_FSIM8_MASK                     equ 0001h
COG4FSIM1_FSIM9_POSN                     equ 0001h
COG4FSIM1_FSIM9_POSITION                 equ 0001h
COG4FSIM1_FSIM9_SIZE                     equ 0001h
COG4FSIM1_FSIM9_LENGTH                   equ 0001h
COG4FSIM1_FSIM9_MASK                     equ 0002h
COG4FSIM1_FSIM10_POSN                    equ 0002h
COG4FSIM1_FSIM10_POSITION                equ 0002h
COG4FSIM1_FSIM10_SIZE                    equ 0001h
COG4FSIM1_FSIM10_LENGTH                  equ 0001h
COG4FSIM1_FSIM10_MASK                    equ 0004h
COG4FSIM1_FSIM11_POSN                    equ 0003h
COG4FSIM1_FSIM11_POSITION                equ 0003h
COG4FSIM1_FSIM11_SIZE                    equ 0001h
COG4FSIM1_FSIM11_LENGTH                  equ 0001h
COG4FSIM1_FSIM11_MASK                    equ 0008h
COG4FSIM1_FSIM12_POSN                    equ 0004h
COG4FSIM1_FSIM12_POSITION                equ 0004h
COG4FSIM1_FSIM12_SIZE                    equ 0001h
COG4FSIM1_FSIM12_LENGTH                  equ 0001h
COG4FSIM1_FSIM12_MASK                    equ 0010h
COG4FSIM1_FSIM13_POSN                    equ 0005h
COG4FSIM1_FSIM13_POSITION                equ 0005h
COG4FSIM1_FSIM13_SIZE                    equ 0001h
COG4FSIM1_FSIM13_LENGTH                  equ 0001h
COG4FSIM1_FSIM13_MASK                    equ 0020h
COG4FSIM1_FSIM14_POSN                    equ 0006h
COG4FSIM1_FSIM14_POSITION                equ 0006h
COG4FSIM1_FSIM14_SIZE                    equ 0001h
COG4FSIM1_FSIM14_LENGTH                  equ 0001h
COG4FSIM1_FSIM14_MASK                    equ 0040h
COG4FSIM1_FSIM15_POSN                    equ 0007h
COG4FSIM1_FSIM15_POSITION                equ 0007h
COG4FSIM1_FSIM15_SIZE                    equ 0001h
COG4FSIM1_FSIM15_LENGTH                  equ 0001h
COG4FSIM1_FSIM15_MASK                    equ 0080h
COG4FSIM1_G4FSIM8_POSN                   equ 0000h
COG4FSIM1_G4FSIM8_POSITION               equ 0000h
COG4FSIM1_G4FSIM8_SIZE                   equ 0001h
COG4FSIM1_G4FSIM8_LENGTH                 equ 0001h
COG4FSIM1_G4FSIM8_MASK                   equ 0001h
COG4FSIM1_G4FSIM9_POSN                   equ 0001h
COG4FSIM1_G4FSIM9_POSITION               equ 0001h
COG4FSIM1_G4FSIM9_SIZE                   equ 0001h
COG4FSIM1_G4FSIM9_LENGTH                 equ 0001h
COG4FSIM1_G4FSIM9_MASK                   equ 0002h
COG4FSIM1_G4FSIM10_POSN                  equ 0002h
COG4FSIM1_G4FSIM10_POSITION              equ 0002h
COG4FSIM1_G4FSIM10_SIZE                  equ 0001h
COG4FSIM1_G4FSIM10_LENGTH                equ 0001h
COG4FSIM1_G4FSIM10_MASK                  equ 0004h
COG4FSIM1_G4FSIM11_POSN                  equ 0003h
COG4FSIM1_G4FSIM11_POSITION              equ 0003h
COG4FSIM1_G4FSIM11_SIZE                  equ 0001h
COG4FSIM1_G4FSIM11_LENGTH                equ 0001h
COG4FSIM1_G4FSIM11_MASK                  equ 0008h
COG4FSIM1_G4FSIM12_POSN                  equ 0004h
COG4FSIM1_G4FSIM12_POSITION              equ 0004h
COG4FSIM1_G4FSIM12_SIZE                  equ 0001h
COG4FSIM1_G4FSIM12_LENGTH                equ 0001h
COG4FSIM1_G4FSIM12_MASK                  equ 0010h
COG4FSIM1_G4FSIM13_POSN                  equ 0005h
COG4FSIM1_G4FSIM13_POSITION              equ 0005h
COG4FSIM1_G4FSIM13_SIZE                  equ 0001h
COG4FSIM1_G4FSIM13_LENGTH                equ 0001h
COG4FSIM1_G4FSIM13_MASK                  equ 0020h
COG4FSIM1_G4FSIM14_POSN                  equ 0006h
COG4FSIM1_G4FSIM14_POSITION              equ 0006h
COG4FSIM1_G4FSIM14_SIZE                  equ 0001h
COG4FSIM1_G4FSIM14_LENGTH                equ 0001h
COG4FSIM1_G4FSIM14_MASK                  equ 0040h
COG4FSIM1_G4FSIM15_POSN                  equ 0007h
COG4FSIM1_G4FSIM15_POSITION              equ 0007h
COG4FSIM1_G4FSIM15_SIZE                  equ 0001h
COG4FSIM1_G4FSIM15_LENGTH                equ 0001h
COG4FSIM1_G4FSIM15_MASK                  equ 0080h

// Register: COG4ASD0
#define COG4ASD0 COG4ASD0
COG4ASD0                                 equ 089Dh
// bitfield definitions
COG4ASD0_ASDAC_POSN                      equ 0002h
COG4ASD0_ASDAC_POSITION                  equ 0002h
COG4ASD0_ASDAC_SIZE                      equ 0002h
COG4ASD0_ASDAC_LENGTH                    equ 0002h
COG4ASD0_ASDAC_MASK                      equ 000Ch
COG4ASD0_ASDBD_POSN                      equ 0004h
COG4ASD0_ASDBD_POSITION                  equ 0004h
COG4ASD0_ASDBD_SIZE                      equ 0002h
COG4ASD0_ASDBD_LENGTH                    equ 0002h
COG4ASD0_ASDBD_MASK                      equ 0030h
COG4ASD0_ASREN_POSN                      equ 0006h
COG4ASD0_ASREN_POSITION                  equ 0006h
COG4ASD0_ASREN_SIZE                      equ 0001h
COG4ASD0_ASREN_LENGTH                    equ 0001h
COG4ASD0_ASREN_MASK                      equ 0040h
COG4ASD0_ASE_POSN                        equ 0007h
COG4ASD0_ASE_POSITION                    equ 0007h
COG4ASD0_ASE_SIZE                        equ 0001h
COG4ASD0_ASE_LENGTH                      equ 0001h
COG4ASD0_ASE_MASK                        equ 0080h
COG4ASD0_ASDAC0_POSN                     equ 0002h
COG4ASD0_ASDAC0_POSITION                 equ 0002h
COG4ASD0_ASDAC0_SIZE                     equ 0001h
COG4ASD0_ASDAC0_LENGTH                   equ 0001h
COG4ASD0_ASDAC0_MASK                     equ 0004h
COG4ASD0_ASDAC1_POSN                     equ 0003h
COG4ASD0_ASDAC1_POSITION                 equ 0003h
COG4ASD0_ASDAC1_SIZE                     equ 0001h
COG4ASD0_ASDAC1_LENGTH                   equ 0001h
COG4ASD0_ASDAC1_MASK                     equ 0008h
COG4ASD0_ASDBD0_POSN                     equ 0004h
COG4ASD0_ASDBD0_POSITION                 equ 0004h
COG4ASD0_ASDBD0_SIZE                     equ 0001h
COG4ASD0_ASDBD0_LENGTH                   equ 0001h
COG4ASD0_ASDBD0_MASK                     equ 0010h
COG4ASD0_ASDBD1_POSN                     equ 0005h
COG4ASD0_ASDBD1_POSITION                 equ 0005h
COG4ASD0_ASDBD1_SIZE                     equ 0001h
COG4ASD0_ASDBD1_LENGTH                   equ 0001h
COG4ASD0_ASDBD1_MASK                     equ 0020h
COG4ASD0_ARSEN_POSN                      equ 0006h
COG4ASD0_ARSEN_POSITION                  equ 0006h
COG4ASD0_ARSEN_SIZE                      equ 0001h
COG4ASD0_ARSEN_LENGTH                    equ 0001h
COG4ASD0_ARSEN_MASK                      equ 0040h
COG4ASD0_G4ASDAC_POSN                    equ 0002h
COG4ASD0_G4ASDAC_POSITION                equ 0002h
COG4ASD0_G4ASDAC_SIZE                    equ 0002h
COG4ASD0_G4ASDAC_LENGTH                  equ 0002h
COG4ASD0_G4ASDAC_MASK                    equ 000Ch
COG4ASD0_G4ASDBD_POSN                    equ 0004h
COG4ASD0_G4ASDBD_POSITION                equ 0004h
COG4ASD0_G4ASDBD_SIZE                    equ 0002h
COG4ASD0_G4ASDBD_LENGTH                  equ 0002h
COG4ASD0_G4ASDBD_MASK                    equ 0030h
COG4ASD0_G4ARSEN_POSN                    equ 0006h
COG4ASD0_G4ARSEN_POSITION                equ 0006h
COG4ASD0_G4ARSEN_SIZE                    equ 0001h
COG4ASD0_G4ARSEN_LENGTH                  equ 0001h
COG4ASD0_G4ARSEN_MASK                    equ 0040h
COG4ASD0_G4ASE_POSN                      equ 0007h
COG4ASD0_G4ASE_POSITION                  equ 0007h
COG4ASD0_G4ASE_SIZE                      equ 0001h
COG4ASD0_G4ASE_LENGTH                    equ 0001h
COG4ASD0_G4ASE_MASK                      equ 0080h
COG4ASD0_G4ASDAC0_POSN                   equ 0002h
COG4ASD0_G4ASDAC0_POSITION               equ 0002h
COG4ASD0_G4ASDAC0_SIZE                   equ 0001h
COG4ASD0_G4ASDAC0_LENGTH                 equ 0001h
COG4ASD0_G4ASDAC0_MASK                   equ 0004h
COG4ASD0_G4ASDAC1_POSN                   equ 0003h
COG4ASD0_G4ASDAC1_POSITION               equ 0003h
COG4ASD0_G4ASDAC1_SIZE                   equ 0001h
COG4ASD0_G4ASDAC1_LENGTH                 equ 0001h
COG4ASD0_G4ASDAC1_MASK                   equ 0008h
COG4ASD0_G4ASDBD0_POSN                   equ 0004h
COG4ASD0_G4ASDBD0_POSITION               equ 0004h
COG4ASD0_G4ASDBD0_SIZE                   equ 0001h
COG4ASD0_G4ASDBD0_LENGTH                 equ 0001h
COG4ASD0_G4ASDBD0_MASK                   equ 0010h
COG4ASD0_G4ASDBD1_POSN                   equ 0005h
COG4ASD0_G4ASDBD1_POSITION               equ 0005h
COG4ASD0_G4ASDBD1_SIZE                   equ 0001h
COG4ASD0_G4ASDBD1_LENGTH                 equ 0001h
COG4ASD0_G4ASDBD1_MASK                   equ 0020h
COG4ASD0_G4ASREN_POSN                    equ 0006h
COG4ASD0_G4ASREN_POSITION                equ 0006h
COG4ASD0_G4ASREN_SIZE                    equ 0001h
COG4ASD0_G4ASREN_LENGTH                  equ 0001h
COG4ASD0_G4ASREN_MASK                    equ 0040h

// Register: COG4ASD1
#define COG4ASD1 COG4ASD1
COG4ASD1                                 equ 089Eh
// bitfield definitions
COG4ASD1_AS0E_POSN                       equ 0000h
COG4ASD1_AS0E_POSITION                   equ 0000h
COG4ASD1_AS0E_SIZE                       equ 0001h
COG4ASD1_AS0E_LENGTH                     equ 0001h
COG4ASD1_AS0E_MASK                       equ 0001h
COG4ASD1_AS1E_POSN                       equ 0001h
COG4ASD1_AS1E_POSITION                   equ 0001h
COG4ASD1_AS1E_SIZE                       equ 0001h
COG4ASD1_AS1E_LENGTH                     equ 0001h
COG4ASD1_AS1E_MASK                       equ 0002h
COG4ASD1_AS2E_POSN                       equ 0002h
COG4ASD1_AS2E_POSITION                   equ 0002h
COG4ASD1_AS2E_SIZE                       equ 0001h
COG4ASD1_AS2E_LENGTH                     equ 0001h
COG4ASD1_AS2E_MASK                       equ 0004h
COG4ASD1_AS3E_POSN                       equ 0003h
COG4ASD1_AS3E_POSITION                   equ 0003h
COG4ASD1_AS3E_SIZE                       equ 0001h
COG4ASD1_AS3E_LENGTH                     equ 0001h
COG4ASD1_AS3E_MASK                       equ 0008h
COG4ASD1_AS4E_POSN                       equ 0004h
COG4ASD1_AS4E_POSITION                   equ 0004h
COG4ASD1_AS4E_SIZE                       equ 0001h
COG4ASD1_AS4E_LENGTH                     equ 0001h
COG4ASD1_AS4E_MASK                       equ 0010h
COG4ASD1_AS5E_POSN                       equ 0005h
COG4ASD1_AS5E_POSITION                   equ 0005h
COG4ASD1_AS5E_SIZE                       equ 0001h
COG4ASD1_AS5E_LENGTH                     equ 0001h
COG4ASD1_AS5E_MASK                       equ 0020h
COG4ASD1_AS6E_POSN                       equ 0006h
COG4ASD1_AS6E_POSITION                   equ 0006h
COG4ASD1_AS6E_SIZE                       equ 0001h
COG4ASD1_AS6E_LENGTH                     equ 0001h
COG4ASD1_AS6E_MASK                       equ 0040h
COG4ASD1_AS7E_POSN                       equ 0007h
COG4ASD1_AS7E_POSITION                   equ 0007h
COG4ASD1_AS7E_SIZE                       equ 0001h
COG4ASD1_AS7E_LENGTH                     equ 0001h
COG4ASD1_AS7E_MASK                       equ 0080h
COG4ASD1_G4AS0E_POSN                     equ 0000h
COG4ASD1_G4AS0E_POSITION                 equ 0000h
COG4ASD1_G4AS0E_SIZE                     equ 0001h
COG4ASD1_G4AS0E_LENGTH                   equ 0001h
COG4ASD1_G4AS0E_MASK                     equ 0001h
COG4ASD1_G4AS1E_POSN                     equ 0001h
COG4ASD1_G4AS1E_POSITION                 equ 0001h
COG4ASD1_G4AS1E_SIZE                     equ 0001h
COG4ASD1_G4AS1E_LENGTH                   equ 0001h
COG4ASD1_G4AS1E_MASK                     equ 0002h
COG4ASD1_G4AS2E_POSN                     equ 0002h
COG4ASD1_G4AS2E_POSITION                 equ 0002h
COG4ASD1_G4AS2E_SIZE                     equ 0001h
COG4ASD1_G4AS2E_LENGTH                   equ 0001h
COG4ASD1_G4AS2E_MASK                     equ 0004h
COG4ASD1_G4AS3E_POSN                     equ 0003h
COG4ASD1_G4AS3E_POSITION                 equ 0003h
COG4ASD1_G4AS3E_SIZE                     equ 0001h
COG4ASD1_G4AS3E_LENGTH                   equ 0001h
COG4ASD1_G4AS3E_MASK                     equ 0008h
COG4ASD1_G4AS4E_POSN                     equ 0004h
COG4ASD1_G4AS4E_POSITION                 equ 0004h
COG4ASD1_G4AS4E_SIZE                     equ 0001h
COG4ASD1_G4AS4E_LENGTH                   equ 0001h
COG4ASD1_G4AS4E_MASK                     equ 0010h
COG4ASD1_G4AS5E_POSN                     equ 0005h
COG4ASD1_G4AS5E_POSITION                 equ 0005h
COG4ASD1_G4AS5E_SIZE                     equ 0001h
COG4ASD1_G4AS5E_LENGTH                   equ 0001h
COG4ASD1_G4AS5E_MASK                     equ 0020h
COG4ASD1_G4AS6E_POSN                     equ 0006h
COG4ASD1_G4AS6E_POSITION                 equ 0006h
COG4ASD1_G4AS6E_SIZE                     equ 0001h
COG4ASD1_G4AS6E_LENGTH                   equ 0001h
COG4ASD1_G4AS6E_MASK                     equ 0040h
COG4ASD1_G4AS7E_POSN                     equ 0007h
COG4ASD1_G4AS7E_POSITION                 equ 0007h
COG4ASD1_G4AS7E_SIZE                     equ 0001h
COG4ASD1_G4AS7E_LENGTH                   equ 0001h
COG4ASD1_G4AS7E_MASK                     equ 0080h

// Register: COG4STR
#define COG4STR COG4STR
COG4STR                                  equ 089Fh
// bitfield definitions
COG4STR_STRA_POSN                        equ 0000h
COG4STR_STRA_POSITION                    equ 0000h
COG4STR_STRA_SIZE                        equ 0001h
COG4STR_STRA_LENGTH                      equ 0001h
COG4STR_STRA_MASK                        equ 0001h
COG4STR_STRB_POSN                        equ 0001h
COG4STR_STRB_POSITION                    equ 0001h
COG4STR_STRB_SIZE                        equ 0001h
COG4STR_STRB_LENGTH                      equ 0001h
COG4STR_STRB_MASK                        equ 0002h
COG4STR_STRC_POSN                        equ 0002h
COG4STR_STRC_POSITION                    equ 0002h
COG4STR_STRC_SIZE                        equ 0001h
COG4STR_STRC_LENGTH                      equ 0001h
COG4STR_STRC_MASK                        equ 0004h
COG4STR_STRD_POSN                        equ 0003h
COG4STR_STRD_POSITION                    equ 0003h
COG4STR_STRD_SIZE                        equ 0001h
COG4STR_STRD_LENGTH                      equ 0001h
COG4STR_STRD_MASK                        equ 0008h
COG4STR_SDATA_POSN                       equ 0004h
COG4STR_SDATA_POSITION                   equ 0004h
COG4STR_SDATA_SIZE                       equ 0001h
COG4STR_SDATA_LENGTH                     equ 0001h
COG4STR_SDATA_MASK                       equ 0010h
COG4STR_SDATB_POSN                       equ 0005h
COG4STR_SDATB_POSITION                   equ 0005h
COG4STR_SDATB_SIZE                       equ 0001h
COG4STR_SDATB_LENGTH                     equ 0001h
COG4STR_SDATB_MASK                       equ 0020h
COG4STR_SDATC_POSN                       equ 0006h
COG4STR_SDATC_POSITION                   equ 0006h
COG4STR_SDATC_SIZE                       equ 0001h
COG4STR_SDATC_LENGTH                     equ 0001h
COG4STR_SDATC_MASK                       equ 0040h
COG4STR_SDATD_POSN                       equ 0007h
COG4STR_SDATD_POSITION                   equ 0007h
COG4STR_SDATD_SIZE                       equ 0001h
COG4STR_SDATD_LENGTH                     equ 0001h
COG4STR_SDATD_MASK                       equ 0080h
COG4STR_G4STRA_POSN                      equ 0000h
COG4STR_G4STRA_POSITION                  equ 0000h
COG4STR_G4STRA_SIZE                      equ 0001h
COG4STR_G4STRA_LENGTH                    equ 0001h
COG4STR_G4STRA_MASK                      equ 0001h
COG4STR_G4STRB_POSN                      equ 0001h
COG4STR_G4STRB_POSITION                  equ 0001h
COG4STR_G4STRB_SIZE                      equ 0001h
COG4STR_G4STRB_LENGTH                    equ 0001h
COG4STR_G4STRB_MASK                      equ 0002h
COG4STR_G4STRC_POSN                      equ 0002h
COG4STR_G4STRC_POSITION                  equ 0002h
COG4STR_G4STRC_SIZE                      equ 0001h
COG4STR_G4STRC_LENGTH                    equ 0001h
COG4STR_G4STRC_MASK                      equ 0004h
COG4STR_G4STRD_POSN                      equ 0003h
COG4STR_G4STRD_POSITION                  equ 0003h
COG4STR_G4STRD_SIZE                      equ 0001h
COG4STR_G4STRD_LENGTH                    equ 0001h
COG4STR_G4STRD_MASK                      equ 0008h
COG4STR_G4SDATA_POSN                     equ 0004h
COG4STR_G4SDATA_POSITION                 equ 0004h
COG4STR_G4SDATA_SIZE                     equ 0001h
COG4STR_G4SDATA_LENGTH                   equ 0001h
COG4STR_G4SDATA_MASK                     equ 0010h
COG4STR_G4SDATB_POSN                     equ 0005h
COG4STR_G4SDATB_POSITION                 equ 0005h
COG4STR_G4SDATB_SIZE                     equ 0001h
COG4STR_G4SDATB_LENGTH                   equ 0001h
COG4STR_G4SDATB_MASK                     equ 0020h
COG4STR_G4SDATC_POSN                     equ 0006h
COG4STR_G4SDATC_POSITION                 equ 0006h
COG4STR_G4SDATC_SIZE                     equ 0001h
COG4STR_G4SDATC_LENGTH                   equ 0001h
COG4STR_G4SDATC_MASK                     equ 0040h
COG4STR_G4SDATD_POSN                     equ 0007h
COG4STR_G4SDATD_POSITION                 equ 0007h
COG4STR_G4SDATD_SIZE                     equ 0001h
COG4STR_G4SDATD_LENGTH                   equ 0001h
COG4STR_G4SDATD_MASK                     equ 0080h

// Register: CM4CON0
#define CM4CON0 CM4CON0
CM4CON0                                  equ 090Ch
// bitfield definitions
CM4CON0_SYNC_POSN                        equ 0000h
CM4CON0_SYNC_POSITION                    equ 0000h
CM4CON0_SYNC_SIZE                        equ 0001h
CM4CON0_SYNC_LENGTH                      equ 0001h
CM4CON0_SYNC_MASK                        equ 0001h
CM4CON0_HYS_POSN                         equ 0001h
CM4CON0_HYS_POSITION                     equ 0001h
CM4CON0_HYS_SIZE                         equ 0001h
CM4CON0_HYS_LENGTH                       equ 0001h
CM4CON0_HYS_MASK                         equ 0002h
CM4CON0_ZLF_POSN                         equ 0003h
CM4CON0_ZLF_POSITION                     equ 0003h
CM4CON0_ZLF_SIZE                         equ 0001h
CM4CON0_ZLF_LENGTH                       equ 0001h
CM4CON0_ZLF_MASK                         equ 0008h
CM4CON0_POL_POSN                         equ 0004h
CM4CON0_POL_POSITION                     equ 0004h
CM4CON0_POL_SIZE                         equ 0001h
CM4CON0_POL_LENGTH                       equ 0001h
CM4CON0_POL_MASK                         equ 0010h
CM4CON0_OUT_POSN                         equ 0006h
CM4CON0_OUT_POSITION                     equ 0006h
CM4CON0_OUT_SIZE                         equ 0001h
CM4CON0_OUT_LENGTH                       equ 0001h
CM4CON0_OUT_MASK                         equ 0040h
CM4CON0_ON_POSN                          equ 0007h
CM4CON0_ON_POSITION                      equ 0007h
CM4CON0_ON_SIZE                          equ 0001h
CM4CON0_ON_LENGTH                        equ 0001h
CM4CON0_ON_MASK                          equ 0080h
CM4CON0_C4SYNC_POSN                      equ 0000h
CM4CON0_C4SYNC_POSITION                  equ 0000h
CM4CON0_C4SYNC_SIZE                      equ 0001h
CM4CON0_C4SYNC_LENGTH                    equ 0001h
CM4CON0_C4SYNC_MASK                      equ 0001h
CM4CON0_C4HYS_POSN                       equ 0001h
CM4CON0_C4HYS_POSITION                   equ 0001h
CM4CON0_C4HYS_SIZE                       equ 0001h
CM4CON0_C4HYS_LENGTH                     equ 0001h
CM4CON0_C4HYS_MASK                       equ 0002h
CM4CON0_C4SP_POSN                        equ 0002h
CM4CON0_C4SP_POSITION                    equ 0002h
CM4CON0_C4SP_SIZE                        equ 0001h
CM4CON0_C4SP_LENGTH                      equ 0001h
CM4CON0_C4SP_MASK                        equ 0004h
CM4CON0_C4ZLF_POSN                       equ 0003h
CM4CON0_C4ZLF_POSITION                   equ 0003h
CM4CON0_C4ZLF_SIZE                       equ 0001h
CM4CON0_C4ZLF_LENGTH                     equ 0001h
CM4CON0_C4ZLF_MASK                       equ 0008h
CM4CON0_C4POL_POSN                       equ 0004h
CM4CON0_C4POL_POSITION                   equ 0004h
CM4CON0_C4POL_SIZE                       equ 0001h
CM4CON0_C4POL_LENGTH                     equ 0001h
CM4CON0_C4POL_MASK                       equ 0010h
CM4CON0_C4OUT_POSN                       equ 0006h
CM4CON0_C4OUT_POSITION                   equ 0006h
CM4CON0_C4OUT_SIZE                       equ 0001h
CM4CON0_C4OUT_LENGTH                     equ 0001h
CM4CON0_C4OUT_MASK                       equ 0040h
CM4CON0_C4ON_POSN                        equ 0007h
CM4CON0_C4ON_POSITION                    equ 0007h
CM4CON0_C4ON_SIZE                        equ 0001h
CM4CON0_C4ON_LENGTH                      equ 0001h
CM4CON0_C4ON_MASK                        equ 0080h

// Register: CM4CON1
#define CM4CON1 CM4CON1
CM4CON1                                  equ 090Dh
// bitfield definitions
CM4CON1_INTN_POSN                        equ 0000h
CM4CON1_INTN_POSITION                    equ 0000h
CM4CON1_INTN_SIZE                        equ 0001h
CM4CON1_INTN_LENGTH                      equ 0001h
CM4CON1_INTN_MASK                        equ 0001h
CM4CON1_INTP_POSN                        equ 0001h
CM4CON1_INTP_POSITION                    equ 0001h
CM4CON1_INTP_SIZE                        equ 0001h
CM4CON1_INTP_LENGTH                      equ 0001h
CM4CON1_INTP_MASK                        equ 0002h
CM4CON1_C4INTN_POSN                      equ 0000h
CM4CON1_C4INTN_POSITION                  equ 0000h
CM4CON1_C4INTN_SIZE                      equ 0001h
CM4CON1_C4INTN_LENGTH                    equ 0001h
CM4CON1_C4INTN_MASK                      equ 0001h
CM4CON1_C4INTP_POSN                      equ 0001h
CM4CON1_C4INTP_POSITION                  equ 0001h
CM4CON1_C4INTP_SIZE                      equ 0001h
CM4CON1_C4INTP_LENGTH                    equ 0001h
CM4CON1_C4INTP_MASK                      equ 0002h

// Register: CM4NSEL
#define CM4NSEL CM4NSEL
CM4NSEL                                  equ 090Eh
// bitfield definitions
CM4NSEL_NCH_POSN                         equ 0000h
CM4NSEL_NCH_POSITION                     equ 0000h
CM4NSEL_NCH_SIZE                         equ 0004h
CM4NSEL_NCH_LENGTH                       equ 0004h
CM4NSEL_NCH_MASK                         equ 000Fh
CM4NSEL_C4NCH_POSN                       equ 0000h
CM4NSEL_C4NCH_POSITION                   equ 0000h
CM4NSEL_C4NCH_SIZE                       equ 0004h
CM4NSEL_C4NCH_LENGTH                     equ 0004h
CM4NSEL_C4NCH_MASK                       equ 000Fh
CM4NSEL_C4NCH0_POSN                      equ 0000h
CM4NSEL_C4NCH0_POSITION                  equ 0000h
CM4NSEL_C4NCH0_SIZE                      equ 0001h
CM4NSEL_C4NCH0_LENGTH                    equ 0001h
CM4NSEL_C4NCH0_MASK                      equ 0001h
CM4NSEL_C4NCH1_POSN                      equ 0001h
CM4NSEL_C4NCH1_POSITION                  equ 0001h
CM4NSEL_C4NCH1_SIZE                      equ 0001h
CM4NSEL_C4NCH1_LENGTH                    equ 0001h
CM4NSEL_C4NCH1_MASK                      equ 0002h
CM4NSEL_C4NCH2_POSN                      equ 0002h
CM4NSEL_C4NCH2_POSITION                  equ 0002h
CM4NSEL_C4NCH2_SIZE                      equ 0001h
CM4NSEL_C4NCH2_LENGTH                    equ 0001h
CM4NSEL_C4NCH2_MASK                      equ 0004h
CM4NSEL_C4NCH3_POSN                      equ 0003h
CM4NSEL_C4NCH3_POSITION                  equ 0003h
CM4NSEL_C4NCH3_SIZE                      equ 0001h
CM4NSEL_C4NCH3_LENGTH                    equ 0001h
CM4NSEL_C4NCH3_MASK                      equ 0008h

