GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: PWM11PHL
#define PWM11PHL PWM11PHL
PWM11PHL                                 equ 0DB1h
// bitfield definitions
PWM11PHL_PH_POSN                         equ 0000h
PWM11PHL_PH_POSITION                     equ 0000h
PWM11PHL_PH_SIZE                         equ 0008h
PWM11PHL_PH_LENGTH                       equ 0008h
PWM11PHL_PH_MASK                         equ 00FFh
PWM11PHL_PWM11PHL0_POSN                  equ 0000h
PWM11PHL_PWM11PHL0_POSITION              equ 0000h
PWM11PHL_PWM11PHL0_SIZE                  equ 0001h
PWM11PHL_PWM11PHL0_LENGTH                equ 0001h
PWM11PHL_PWM11PHL0_MASK                  equ 0001h
PWM11PHL_PWM11PHL1_POSN                  equ 0001h
PWM11PHL_PWM11PHL1_POSITION              equ 0001h
PWM11PHL_PWM11PHL1_SIZE                  equ 0001h
PWM11PHL_PWM11PHL1_LENGTH                equ 0001h
PWM11PHL_PWM11PHL1_MASK                  equ 0002h
PWM11PHL_PWM11PHL2_POSN                  equ 0002h
PWM11PHL_PWM11PHL2_POSITION              equ 0002h
PWM11PHL_PWM11PHL2_SIZE                  equ 0001h
PWM11PHL_PWM11PHL2_LENGTH                equ 0001h
PWM11PHL_PWM11PHL2_MASK                  equ 0004h
PWM11PHL_PWM11PHL3_POSN                  equ 0003h
PWM11PHL_PWM11PHL3_POSITION              equ 0003h
PWM11PHL_PWM11PHL3_SIZE                  equ 0001h
PWM11PHL_PWM11PHL3_LENGTH                equ 0001h
PWM11PHL_PWM11PHL3_MASK                  equ 0008h
PWM11PHL_PWM11PHL4_POSN                  equ 0004h
PWM11PHL_PWM11PHL4_POSITION              equ 0004h
PWM11PHL_PWM11PHL4_SIZE                  equ 0001h
PWM11PHL_PWM11PHL4_LENGTH                equ 0001h
PWM11PHL_PWM11PHL4_MASK                  equ 0010h
PWM11PHL_PWM11PHL5_POSN                  equ 0005h
PWM11PHL_PWM11PHL5_POSITION              equ 0005h
PWM11PHL_PWM11PHL5_SIZE                  equ 0001h
PWM11PHL_PWM11PHL5_LENGTH                equ 0001h
PWM11PHL_PWM11PHL5_MASK                  equ 0020h
PWM11PHL_PWM11PHL6_POSN                  equ 0006h
PWM11PHL_PWM11PHL6_POSITION              equ 0006h
PWM11PHL_PWM11PHL6_SIZE                  equ 0001h
PWM11PHL_PWM11PHL6_LENGTH                equ 0001h
PWM11PHL_PWM11PHL6_MASK                  equ 0040h
PWM11PHL_PWM11PHL7_POSN                  equ 0007h
PWM11PHL_PWM11PHL7_POSITION              equ 0007h
PWM11PHL_PWM11PHL7_SIZE                  equ 0001h
PWM11PHL_PWM11PHL7_LENGTH                equ 0001h
PWM11PHL_PWM11PHL7_MASK                  equ 0080h
PWM11PHL_PWM11PHL_POSN                   equ 0000h
PWM11PHL_PWM11PHL_POSITION               equ 0000h
PWM11PHL_PWM11PHL_SIZE                   equ 0008h
PWM11PHL_PWM11PHL_LENGTH                 equ 0008h
PWM11PHL_PWM11PHL_MASK                   equ 00FFh

// Register: PWM11PHH
#define PWM11PHH PWM11PHH
PWM11PHH                                 equ 0DB2h
// bitfield definitions
PWM11PHH_PH_POSN                         equ 0000h
PWM11PHH_PH_POSITION                     equ 0000h
PWM11PHH_PH_SIZE                         equ 0008h
PWM11PHH_PH_LENGTH                       equ 0008h
PWM11PHH_PH_MASK                         equ 00FFh
PWM11PHH_PWM11PHH0_POSN                  equ 0000h
PWM11PHH_PWM11PHH0_POSITION              equ 0000h
PWM11PHH_PWM11PHH0_SIZE                  equ 0001h
PWM11PHH_PWM11PHH0_LENGTH                equ 0001h
PWM11PHH_PWM11PHH0_MASK                  equ 0001h
PWM11PHH_PWM11PHH1_POSN                  equ 0001h
PWM11PHH_PWM11PHH1_POSITION              equ 0001h
PWM11PHH_PWM11PHH1_SIZE                  equ 0001h
PWM11PHH_PWM11PHH1_LENGTH                equ 0001h
PWM11PHH_PWM11PHH1_MASK                  equ 0002h
PWM11PHH_PWM11PHH2_POSN                  equ 0002h
PWM11PHH_PWM11PHH2_POSITION              equ 0002h
PWM11PHH_PWM11PHH2_SIZE                  equ 0001h
PWM11PHH_PWM11PHH2_LENGTH                equ 0001h
PWM11PHH_PWM11PHH2_MASK                  equ 0004h
PWM11PHH_PWM11PHH3_POSN                  equ 0003h
PWM11PHH_PWM11PHH3_POSITION              equ 0003h
PWM11PHH_PWM11PHH3_SIZE                  equ 0001h
PWM11PHH_PWM11PHH3_LENGTH                equ 0001h
PWM11PHH_PWM11PHH3_MASK                  equ 0008h
PWM11PHH_PWM11PHH4_POSN                  equ 0004h
PWM11PHH_PWM11PHH4_POSITION              equ 0004h
PWM11PHH_PWM11PHH4_SIZE                  equ 0001h
PWM11PHH_PWM11PHH4_LENGTH                equ 0001h
PWM11PHH_PWM11PHH4_MASK                  equ 0010h
PWM11PHH_PWM11PHH5_POSN                  equ 0005h
PWM11PHH_PWM11PHH5_POSITION              equ 0005h
PWM11PHH_PWM11PHH5_SIZE                  equ 0001h
PWM11PHH_PWM11PHH5_LENGTH                equ 0001h
PWM11PHH_PWM11PHH5_MASK                  equ 0020h
PWM11PHH_PWM11PHH6_POSN                  equ 0006h
PWM11PHH_PWM11PHH6_POSITION              equ 0006h
PWM11PHH_PWM11PHH6_SIZE                  equ 0001h
PWM11PHH_PWM11PHH6_LENGTH                equ 0001h
PWM11PHH_PWM11PHH6_MASK                  equ 0040h
PWM11PHH_PWM11PHH7_POSN                  equ 0007h
PWM11PHH_PWM11PHH7_POSITION              equ 0007h
PWM11PHH_PWM11PHH7_SIZE                  equ 0001h
PWM11PHH_PWM11PHH7_LENGTH                equ 0001h
PWM11PHH_PWM11PHH7_MASK                  equ 0080h
PWM11PHH_PWM11PHH_POSN                   equ 0000h
PWM11PHH_PWM11PHH_POSITION               equ 0000h
PWM11PHH_PWM11PHH_SIZE                   equ 0008h
PWM11PHH_PWM11PHH_LENGTH                 equ 0008h
PWM11PHH_PWM11PHH_MASK                   equ 00FFh

// Register: PWM11DCL
#define PWM11DCL PWM11DCL
PWM11DCL                                 equ 0DB3h
// bitfield definitions
PWM11DCL_DC_POSN                         equ 0000h
PWM11DCL_DC_POSITION                     equ 0000h
PWM11DCL_DC_SIZE                         equ 0008h
PWM11DCL_DC_LENGTH                       equ 0008h
PWM11DCL_DC_MASK                         equ 00FFh
PWM11DCL_PWM11DCL0_POSN                  equ 0000h
PWM11DCL_PWM11DCL0_POSITION              equ 0000h
PWM11DCL_PWM11DCL0_SIZE                  equ 0001h
PWM11DCL_PWM11DCL0_LENGTH                equ 0001h
PWM11DCL_PWM11DCL0_MASK                  equ 0001h
PWM11DCL_PWM11DCL1_POSN                  equ 0001h
PWM11DCL_PWM11DCL1_POSITION              equ 0001h
PWM11DCL_PWM11DCL1_SIZE                  equ 0001h
PWM11DCL_PWM11DCL1_LENGTH                equ 0001h
PWM11DCL_PWM11DCL1_MASK                  equ 0002h
PWM11DCL_PWM11DCL2_POSN                  equ 0002h
PWM11DCL_PWM11DCL2_POSITION              equ 0002h
PWM11DCL_PWM11DCL2_SIZE                  equ 0001h
PWM11DCL_PWM11DCL2_LENGTH                equ 0001h
PWM11DCL_PWM11DCL2_MASK                  equ 0004h
PWM11DCL_PWM11DCL3_POSN                  equ 0003h
PWM11DCL_PWM11DCL3_POSITION              equ 0003h
PWM11DCL_PWM11DCL3_SIZE                  equ 0001h
PWM11DCL_PWM11DCL3_LENGTH                equ 0001h
PWM11DCL_PWM11DCL3_MASK                  equ 0008h
PWM11DCL_PWM11DCL4_POSN                  equ 0004h
PWM11DCL_PWM11DCL4_POSITION              equ 0004h
PWM11DCL_PWM11DCL4_SIZE                  equ 0001h
PWM11DCL_PWM11DCL4_LENGTH                equ 0001h
PWM11DCL_PWM11DCL4_MASK                  equ 0010h
PWM11DCL_PWM11DCL5_POSN                  equ 0005h
PWM11DCL_PWM11DCL5_POSITION              equ 0005h
PWM11DCL_PWM11DCL5_SIZE                  equ 0001h
PWM11DCL_PWM11DCL5_LENGTH                equ 0001h
PWM11DCL_PWM11DCL5_MASK                  equ 0020h
PWM11DCL_PWM11DCL6_POSN                  equ 0006h
PWM11DCL_PWM11DCL6_POSITION              equ 0006h
PWM11DCL_PWM11DCL6_SIZE                  equ 0001h
PWM11DCL_PWM11DCL6_LENGTH                equ 0001h
PWM11DCL_PWM11DCL6_MASK                  equ 0040h
PWM11DCL_PWM11DCL7_POSN                  equ 0007h
PWM11DCL_PWM11DCL7_POSITION              equ 0007h
PWM11DCL_PWM11DCL7_SIZE                  equ 0001h
PWM11DCL_PWM11DCL7_LENGTH                equ 0001h
PWM11DCL_PWM11DCL7_MASK                  equ 0080h
PWM11DCL_PWM11DCL_POSN                   equ 0000h
PWM11DCL_PWM11DCL_POSITION               equ 0000h
PWM11DCL_PWM11DCL_SIZE                   equ 0008h
PWM11DCL_PWM11DCL_LENGTH                 equ 0008h
PWM11DCL_PWM11DCL_MASK                   equ 00FFh

// Register: PWM11DCH
#define PWM11DCH PWM11DCH
PWM11DCH                                 equ 0DB4h
// bitfield definitions
PWM11DCH_DC_POSN                         equ 0000h
PWM11DCH_DC_POSITION                     equ 0000h
PWM11DCH_DC_SIZE                         equ 0008h
PWM11DCH_DC_LENGTH                       equ 0008h
PWM11DCH_DC_MASK                         equ 00FFh
PWM11DCH_PWM11DCH0_POSN                  equ 0000h
PWM11DCH_PWM11DCH0_POSITION              equ 0000h
PWM11DCH_PWM11DCH0_SIZE                  equ 0001h
PWM11DCH_PWM11DCH0_LENGTH                equ 0001h
PWM11DCH_PWM11DCH0_MASK                  equ 0001h
PWM11DCH_PWM11DCH1_POSN                  equ 0001h
PWM11DCH_PWM11DCH1_POSITION              equ 0001h
PWM11DCH_PWM11DCH1_SIZE                  equ 0001h
PWM11DCH_PWM11DCH1_LENGTH                equ 0001h
PWM11DCH_PWM11DCH1_MASK                  equ 0002h
PWM11DCH_PWM11DCH2_POSN                  equ 0002h
PWM11DCH_PWM11DCH2_POSITION              equ 0002h
PWM11DCH_PWM11DCH2_SIZE                  equ 0001h
PWM11DCH_PWM11DCH2_LENGTH                equ 0001h
PWM11DCH_PWM11DCH2_MASK                  equ 0004h
PWM11DCH_PWM11DCH3_POSN                  equ 0003h
PWM11DCH_PWM11DCH3_POSITION              equ 0003h
PWM11DCH_PWM11DCH3_SIZE                  equ 0001h
PWM11DCH_PWM11DCH3_LENGTH                equ 0001h
PWM11DCH_PWM11DCH3_MASK                  equ 0008h
PWM11DCH_PWM11DCH4_POSN                  equ 0004h
PWM11DCH_PWM11DCH4_POSITION              equ 0004h
PWM11DCH_PWM11DCH4_SIZE                  equ 0001h
PWM11DCH_PWM11DCH4_LENGTH                equ 0001h
PWM11DCH_PWM11DCH4_MASK                  equ 0010h
PWM11DCH_PWM11DCH5_POSN                  equ 0005h
PWM11DCH_PWM11DCH5_POSITION              equ 0005h
PWM11DCH_PWM11DCH5_SIZE                  equ 0001h
PWM11DCH_PWM11DCH5_LENGTH                equ 0001h
PWM11DCH_PWM11DCH5_MASK                  equ 0020h
PWM11DCH_PWM11DCH6_POSN                  equ 0006h
PWM11DCH_PWM11DCH6_POSITION              equ 0006h
PWM11DCH_PWM11DCH6_SIZE                  equ 0001h
PWM11DCH_PWM11DCH6_LENGTH                equ 0001h
PWM11DCH_PWM11DCH6_MASK                  equ 0040h
PWM11DCH_PWM11DCH7_POSN                  equ 0007h
PWM11DCH_PWM11DCH7_POSITION              equ 0007h
PWM11DCH_PWM11DCH7_SIZE                  equ 0001h
PWM11DCH_PWM11DCH7_LENGTH                equ 0001h
PWM11DCH_PWM11DCH7_MASK                  equ 0080h
PWM11DCH_PWM11DCH_POSN                   equ 0000h
PWM11DCH_PWM11DCH_POSITION               equ 0000h
PWM11DCH_PWM11DCH_SIZE                   equ 0008h
PWM11DCH_PWM11DCH_LENGTH                 equ 0008h
PWM11DCH_PWM11DCH_MASK                   equ 00FFh

// Register: PWM11PRL
#define PWM11PRL PWM11PRL
PWM11PRL                                 equ 0DB5h
// bitfield definitions
PWM11PRL_PR_POSN                         equ 0000h
PWM11PRL_PR_POSITION                     equ 0000h
PWM11PRL_PR_SIZE                         equ 0008h
PWM11PRL_PR_LENGTH                       equ 0008h
PWM11PRL_PR_MASK                         equ 00FFh
PWM11PRL_PWM11PRL0_POSN                  equ 0000h
PWM11PRL_PWM11PRL0_POSITION              equ 0000h
PWM11PRL_PWM11PRL0_SIZE                  equ 0001h
PWM11PRL_PWM11PRL0_LENGTH                equ 0001h
PWM11PRL_PWM11PRL0_MASK                  equ 0001h
PWM11PRL_PWM11PRL1_POSN                  equ 0001h
PWM11PRL_PWM11PRL1_POSITION              equ 0001h
PWM11PRL_PWM11PRL1_SIZE                  equ 0001h
PWM11PRL_PWM11PRL1_LENGTH                equ 0001h
PWM11PRL_PWM11PRL1_MASK                  equ 0002h
PWM11PRL_PWM11PRL2_POSN                  equ 0002h
PWM11PRL_PWM11PRL2_POSITION              equ 0002h
PWM11PRL_PWM11PRL2_SIZE                  equ 0001h
PWM11PRL_PWM11PRL2_LENGTH                equ 0001h
PWM11PRL_PWM11PRL2_MASK                  equ 0004h
PWM11PRL_PWM11PRL3_POSN                  equ 0003h
PWM11PRL_PWM11PRL3_POSITION              equ 0003h
PWM11PRL_PWM11PRL3_SIZE                  equ 0001h
PWM11PRL_PWM11PRL3_LENGTH                equ 0001h
PWM11PRL_PWM11PRL3_MASK                  equ 0008h
PWM11PRL_PWM11PRL4_POSN                  equ 0004h
PWM11PRL_PWM11PRL4_POSITION              equ 0004h
PWM11PRL_PWM11PRL4_SIZE                  equ 0001h
PWM11PRL_PWM11PRL4_LENGTH                equ 0001h
PWM11PRL_PWM11PRL4_MASK                  equ 0010h
PWM11PRL_PWM11PRL5_POSN                  equ 0005h
PWM11PRL_PWM11PRL5_POSITION              equ 0005h
PWM11PRL_PWM11PRL5_SIZE                  equ 0001h
PWM11PRL_PWM11PRL5_LENGTH                equ 0001h
PWM11PRL_PWM11PRL5_MASK                  equ 0020h
PWM11PRL_PWM11PRL6_POSN                  equ 0006h
PWM11PRL_PWM11PRL6_POSITION              equ 0006h
PWM11PRL_PWM11PRL6_SIZE                  equ 0001h
PWM11PRL_PWM11PRL6_LENGTH                equ 0001h
PWM11PRL_PWM11PRL6_MASK                  equ 0040h
PWM11PRL_PWM11PRL7_POSN                  equ 0007h
PWM11PRL_PWM11PRL7_POSITION              equ 0007h
PWM11PRL_PWM11PRL7_SIZE                  equ 0001h
PWM11PRL_PWM11PRL7_LENGTH                equ 0001h
PWM11PRL_PWM11PRL7_MASK                  equ 0080h
PWM11PRL_PWM11PRL_POSN                   equ 0000h
PWM11PRL_PWM11PRL_POSITION               equ 0000h
PWM11PRL_PWM11PRL_SIZE                   equ 0008h
PWM11PRL_PWM11PRL_LENGTH                 equ 0008h
PWM11PRL_PWM11PRL_MASK                   equ 00FFh

// Register: PWM11PRH
#define PWM11PRH PWM11PRH
PWM11PRH                                 equ 0DB6h
// bitfield definitions
PWM11PRH_PR_POSN                         equ 0000h
PWM11PRH_PR_POSITION                     equ 0000h
PWM11PRH_PR_SIZE                         equ 0008h
PWM11PRH_PR_LENGTH                       equ 0008h
PWM11PRH_PR_MASK                         equ 00FFh
PWM11PRH_PWM11PRH0_POSN                  equ 0000h
PWM11PRH_PWM11PRH0_POSITION              equ 0000h
PWM11PRH_PWM11PRH0_SIZE                  equ 0001h
PWM11PRH_PWM11PRH0_LENGTH                equ 0001h
PWM11PRH_PWM11PRH0_MASK                  equ 0001h
PWM11PRH_PWM11PRH1_POSN                  equ 0001h
PWM11PRH_PWM11PRH1_POSITION              equ 0001h
PWM11PRH_PWM11PRH1_SIZE                  equ 0001h
PWM11PRH_PWM11PRH1_LENGTH                equ 0001h
PWM11PRH_PWM11PRH1_MASK                  equ 0002h
PWM11PRH_PWM11PRH2_POSN                  equ 0002h
PWM11PRH_PWM11PRH2_POSITION              equ 0002h
PWM11PRH_PWM11PRH2_SIZE                  equ 0001h
PWM11PRH_PWM11PRH2_LENGTH                equ 0001h
PWM11PRH_PWM11PRH2_MASK                  equ 0004h
PWM11PRH_PWM11PRH3_POSN                  equ 0003h
PWM11PRH_PWM11PRH3_POSITION              equ 0003h
PWM11PRH_PWM11PRH3_SIZE                  equ 0001h
PWM11PRH_PWM11PRH3_LENGTH                equ 0001h
PWM11PRH_PWM11PRH3_MASK                  equ 0008h
PWM11PRH_PWM11PRH4_POSN                  equ 0004h
PWM11PRH_PWM11PRH4_POSITION              equ 0004h
PWM11PRH_PWM11PRH4_SIZE                  equ 0001h
PWM11PRH_PWM11PRH4_LENGTH                equ 0001h
PWM11PRH_PWM11PRH4_MASK                  equ 0010h
PWM11PRH_PWM11PRH5_POSN                  equ 0005h
PWM11PRH_PWM11PRH5_POSITION              equ 0005h
PWM11PRH_PWM11PRH5_SIZE                  equ 0001h
PWM11PRH_PWM11PRH5_LENGTH                equ 0001h
PWM11PRH_PWM11PRH5_MASK                  equ 0020h
PWM11PRH_PWM11PRH6_POSN                  equ 0006h
PWM11PRH_PWM11PRH6_POSITION              equ 0006h
PWM11PRH_PWM11PRH6_SIZE                  equ 0001h
PWM11PRH_PWM11PRH6_LENGTH                equ 0001h
PWM11PRH_PWM11PRH6_MASK                  equ 0040h
PWM11PRH_PWM11PRH7_POSN                  equ 0007h
PWM11PRH_PWM11PRH7_POSITION              equ 0007h
PWM11PRH_PWM11PRH7_SIZE                  equ 0001h
PWM11PRH_PWM11PRH7_LENGTH                equ 0001h
PWM11PRH_PWM11PRH7_MASK                  equ 0080h
PWM11PRH_PWM11PRH_POSN                   equ 0000h
PWM11PRH_PWM11PRH_POSITION               equ 0000h
PWM11PRH_PWM11PRH_SIZE                   equ 0008h
PWM11PRH_PWM11PRH_LENGTH                 equ 0008h
PWM11PRH_PWM11PRH_MASK                   equ 00FFh

// Register: PWM11OFL
#define PWM11OFL PWM11OFL
PWM11OFL                                 equ 0DB7h
// bitfield definitions
PWM11OFL_OF_POSN                         equ 0000h
PWM11OFL_OF_POSITION                     equ 0000h
PWM11OFL_OF_SIZE                         equ 0008h
PWM11OFL_OF_LENGTH                       equ 0008h
PWM11OFL_OF_MASK                         equ 00FFh
PWM11OFL_PWM11OFL0_POSN                  equ 0000h
PWM11OFL_PWM11OFL0_POSITION              equ 0000h
PWM11OFL_PWM11OFL0_SIZE                  equ 0001h
PWM11OFL_PWM11OFL0_LENGTH                equ 0001h
PWM11OFL_PWM11OFL0_MASK                  equ 0001h
PWM11OFL_PWM11OFL1_POSN                  equ 0001h
PWM11OFL_PWM11OFL1_POSITION              equ 0001h
PWM11OFL_PWM11OFL1_SIZE                  equ 0001h
PWM11OFL_PWM11OFL1_LENGTH                equ 0001h
PWM11OFL_PWM11OFL1_MASK                  equ 0002h
PWM11OFL_PWM11OFL2_POSN                  equ 0002h
PWM11OFL_PWM11OFL2_POSITION              equ 0002h
PWM11OFL_PWM11OFL2_SIZE                  equ 0001h
PWM11OFL_PWM11OFL2_LENGTH                equ 0001h
PWM11OFL_PWM11OFL2_MASK                  equ 0004h
PWM11OFL_PWM11OFL3_POSN                  equ 0003h
PWM11OFL_PWM11OFL3_POSITION              equ 0003h
PWM11OFL_PWM11OFL3_SIZE                  equ 0001h
PWM11OFL_PWM11OFL3_LENGTH                equ 0001h
PWM11OFL_PWM11OFL3_MASK                  equ 0008h
PWM11OFL_PWM11OFL4_POSN                  equ 0004h
PWM11OFL_PWM11OFL4_POSITION              equ 0004h
PWM11OFL_PWM11OFL4_SIZE                  equ 0001h
PWM11OFL_PWM11OFL4_LENGTH                equ 0001h
PWM11OFL_PWM11OFL4_MASK                  equ 0010h
PWM11OFL_PWM11OFL5_POSN                  equ 0005h
PWM11OFL_PWM11OFL5_POSITION              equ 0005h
PWM11OFL_PWM11OFL5_SIZE                  equ 0001h
PWM11OFL_PWM11OFL5_LENGTH                equ 0001h
PWM11OFL_PWM11OFL5_MASK                  equ 0020h
PWM11OFL_PWM11OFL6_POSN                  equ 0006h
PWM11OFL_PWM11OFL6_POSITION              equ 0006h
PWM11OFL_PWM11OFL6_SIZE                  equ 0001h
PWM11OFL_PWM11OFL6_LENGTH                equ 0001h
PWM11OFL_PWM11OFL6_MASK                  equ 0040h
PWM11OFL_PWM11OFL7_POSN                  equ 0007h
PWM11OFL_PWM11OFL7_POSITION              equ 0007h
PWM11OFL_PWM11OFL7_SIZE                  equ 0001h
PWM11OFL_PWM11OFL7_LENGTH                equ 0001h
PWM11OFL_PWM11OFL7_MASK                  equ 0080h
PWM11OFL_PWM11OFL_POSN                   equ 0000h
PWM11OFL_PWM11OFL_POSITION               equ 0000h
PWM11OFL_PWM11OFL_SIZE                   equ 0008h
PWM11OFL_PWM11OFL_LENGTH                 equ 0008h
PWM11OFL_PWM11OFL_MASK                   equ 00FFh

// Register: PWM11OFH
#define PWM11OFH PWM11OFH
PWM11OFH                                 equ 0DB8h
// bitfield definitions
PWM11OFH_OF_POSN                         equ 0000h
PWM11OFH_OF_POSITION                     equ 0000h
PWM11OFH_OF_SIZE                         equ 0008h
PWM11OFH_OF_LENGTH                       equ 0008h
PWM11OFH_OF_MASK                         equ 00FFh
PWM11OFH_PWM11OFH0_POSN                  equ 0000h
PWM11OFH_PWM11OFH0_POSITION              equ 0000h
PWM11OFH_PWM11OFH0_SIZE                  equ 0001h
PWM11OFH_PWM11OFH0_LENGTH                equ 0001h
PWM11OFH_PWM11OFH0_MASK                  equ 0001h
PWM11OFH_PWM11OFH1_POSN                  equ 0001h
PWM11OFH_PWM11OFH1_POSITION              equ 0001h
PWM11OFH_PWM11OFH1_SIZE                  equ 0001h
PWM11OFH_PWM11OFH1_LENGTH                equ 0001h
PWM11OFH_PWM11OFH1_MASK                  equ 0002h
PWM11OFH_PWM11OFH2_POSN                  equ 0002h
PWM11OFH_PWM11OFH2_POSITION              equ 0002h
PWM11OFH_PWM11OFH2_SIZE                  equ 0001h
PWM11OFH_PWM11OFH2_LENGTH                equ 0001h
PWM11OFH_PWM11OFH2_MASK                  equ 0004h
PWM11OFH_PWM11OFH3_POSN                  equ 0003h
PWM11OFH_PWM11OFH3_POSITION              equ 0003h
PWM11OFH_PWM11OFH3_SIZE                  equ 0001h
PWM11OFH_PWM11OFH3_LENGTH                equ 0001h
PWM11OFH_PWM11OFH3_MASK                  equ 0008h
PWM11OFH_PWM11OFH4_POSN                  equ 0004h
PWM11OFH_PWM11OFH4_POSITION              equ 0004h
PWM11OFH_PWM11OFH4_SIZE                  equ 0001h
PWM11OFH_PWM11OFH4_LENGTH                equ 0001h
PWM11OFH_PWM11OFH4_MASK                  equ 0010h
PWM11OFH_PWM11OFH5_POSN                  equ 0005h
PWM11OFH_PWM11OFH5_POSITION              equ 0005h
PWM11OFH_PWM11OFH5_SIZE                  equ 0001h
PWM11OFH_PWM11OFH5_LENGTH                equ 0001h
PWM11OFH_PWM11OFH5_MASK                  equ 0020h
PWM11OFH_PWM11OFH6_POSN                  equ 0006h
PWM11OFH_PWM11OFH6_POSITION              equ 0006h
PWM11OFH_PWM11OFH6_SIZE                  equ 0001h
PWM11OFH_PWM11OFH6_LENGTH                equ 0001h
PWM11OFH_PWM11OFH6_MASK                  equ 0040h
PWM11OFH_PWM11OFH7_POSN                  equ 0007h
PWM11OFH_PWM11OFH7_POSITION              equ 0007h
PWM11OFH_PWM11OFH7_SIZE                  equ 0001h
PWM11OFH_PWM11OFH7_LENGTH                equ 0001h
PWM11OFH_PWM11OFH7_MASK                  equ 0080h
PWM11OFH_PWM11OFH_POSN                   equ 0000h
PWM11OFH_PWM11OFH_POSITION               equ 0000h
PWM11OFH_PWM11OFH_SIZE                   equ 0008h
PWM11OFH_PWM11OFH_LENGTH                 equ 0008h
PWM11OFH_PWM11OFH_MASK                   equ 00FFh

