GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: PWM11OFCON
#define PWM11OFCON PWM11OFCON
PWM11OFCON                               equ 0DC0h
// bitfield definitions
PWM11OFCON_OFS_POSN                      equ 0000h
PWM11OFCON_OFS_POSITION                  equ 0000h
PWM11OFCON_OFS_SIZE                      equ 0002h
PWM11OFCON_OFS_LENGTH                    equ 0002h
PWM11OFCON_OFS_MASK                      equ 0003h
PWM11OFCON_OFO_POSN                      equ 0004h
PWM11OFCON_OFO_POSITION                  equ 0004h
PWM11OFCON_OFO_SIZE                      equ 0001h
PWM11OFCON_OFO_LENGTH                    equ 0001h
PWM11OFCON_OFO_MASK                      equ 0010h
PWM11OFCON_OFM_POSN                      equ 0005h
PWM11OFCON_OFM_POSITION                  equ 0005h
PWM11OFCON_OFM_SIZE                      equ 0002h
PWM11OFCON_OFM_LENGTH                    equ 0002h
PWM11OFCON_OFM_MASK                      equ 0060h
PWM11OFCON_PWM11OFS0_POSN                equ 0000h
PWM11OFCON_PWM11OFS0_POSITION            equ 0000h
PWM11OFCON_PWM11OFS0_SIZE                equ 0001h
PWM11OFCON_PWM11OFS0_LENGTH              equ 0001h
PWM11OFCON_PWM11OFS0_MASK                equ 0001h
PWM11OFCON_PWM11OFS1_POSN                equ 0001h
PWM11OFCON_PWM11OFS1_POSITION            equ 0001h
PWM11OFCON_PWM11OFS1_SIZE                equ 0001h
PWM11OFCON_PWM11OFS1_LENGTH              equ 0001h
PWM11OFCON_PWM11OFS1_MASK                equ 0002h
PWM11OFCON_PWM11OFM0_POSN                equ 0005h
PWM11OFCON_PWM11OFM0_POSITION            equ 0005h
PWM11OFCON_PWM11OFM0_SIZE                equ 0001h
PWM11OFCON_PWM11OFM0_LENGTH              equ 0001h
PWM11OFCON_PWM11OFM0_MASK                equ 0020h
PWM11OFCON_PWM11OFM1_POSN                equ 0006h
PWM11OFCON_PWM11OFM1_POSITION            equ 0006h
PWM11OFCON_PWM11OFM1_SIZE                equ 0001h
PWM11OFCON_PWM11OFM1_LENGTH              equ 0001h
PWM11OFCON_PWM11OFM1_MASK                equ 0040h
PWM11OFCON_PWM11OFS_POSN                 equ 0000h
PWM11OFCON_PWM11OFS_POSITION             equ 0000h
PWM11OFCON_PWM11OFS_SIZE                 equ 0002h
PWM11OFCON_PWM11OFS_LENGTH               equ 0002h
PWM11OFCON_PWM11OFS_MASK                 equ 0003h
PWM11OFCON_PWM11OFMC_POSN                equ 0004h
PWM11OFCON_PWM11OFMC_POSITION            equ 0004h
PWM11OFCON_PWM11OFMC_SIZE                equ 0001h
PWM11OFCON_PWM11OFMC_LENGTH              equ 0001h
PWM11OFCON_PWM11OFMC_MASK                equ 0010h
PWM11OFCON_PWM11OFM_POSN                 equ 0005h
PWM11OFCON_PWM11OFM_POSITION             equ 0005h
PWM11OFCON_PWM11OFM_SIZE                 equ 0002h
PWM11OFCON_PWM11OFM_LENGTH               equ 0002h
PWM11OFCON_PWM11OFM_MASK                 equ 0060h
PWM11OFCON_OFS0_POSN                     equ 0000h
PWM11OFCON_OFS0_POSITION                 equ 0000h
PWM11OFCON_OFS0_SIZE                     equ 0001h
PWM11OFCON_OFS0_LENGTH                   equ 0001h
PWM11OFCON_OFS0_MASK                     equ 0001h
PWM11OFCON_OFS1_POSN                     equ 0001h
PWM11OFCON_OFS1_POSITION                 equ 0001h
PWM11OFCON_OFS1_SIZE                     equ 0001h
PWM11OFCON_OFS1_LENGTH                   equ 0001h
PWM11OFCON_OFS1_MASK                     equ 0002h
PWM11OFCON_OFM0_POSN                     equ 0005h
PWM11OFCON_OFM0_POSITION                 equ 0005h
PWM11OFCON_OFM0_SIZE                     equ 0001h
PWM11OFCON_OFM0_LENGTH                   equ 0001h
PWM11OFCON_OFM0_MASK                     equ 0020h
PWM11OFCON_OFM1_POSN                     equ 0006h
PWM11OFCON_OFM1_POSITION                 equ 0006h
PWM11OFCON_OFM1_SIZE                     equ 0001h
PWM11OFCON_OFM1_LENGTH                   equ 0001h
PWM11OFCON_OFM1_MASK                     equ 0040h

// Register: PWM12PHL
#define PWM12PHL PWM12PHL
PWM12PHL                                 equ 0DC1h
// bitfield definitions
PWM12PHL_PH_POSN                         equ 0000h
PWM12PHL_PH_POSITION                     equ 0000h
PWM12PHL_PH_SIZE                         equ 0008h
PWM12PHL_PH_LENGTH                       equ 0008h
PWM12PHL_PH_MASK                         equ 00FFh
PWM12PHL_PWM12PHL0_POSN                  equ 0000h
PWM12PHL_PWM12PHL0_POSITION              equ 0000h
PWM12PHL_PWM12PHL0_SIZE                  equ 0001h
PWM12PHL_PWM12PHL0_LENGTH                equ 0001h
PWM12PHL_PWM12PHL0_MASK                  equ 0001h
PWM12PHL_PWM12PHL1_POSN                  equ 0001h
PWM12PHL_PWM12PHL1_POSITION              equ 0001h
PWM12PHL_PWM12PHL1_SIZE                  equ 0001h
PWM12PHL_PWM12PHL1_LENGTH                equ 0001h
PWM12PHL_PWM12PHL1_MASK                  equ 0002h
PWM12PHL_PWM12PHL2_POSN                  equ 0002h
PWM12PHL_PWM12PHL2_POSITION              equ 0002h
PWM12PHL_PWM12PHL2_SIZE                  equ 0001h
PWM12PHL_PWM12PHL2_LENGTH                equ 0001h
PWM12PHL_PWM12PHL2_MASK                  equ 0004h
PWM12PHL_PWM12PHL3_POSN                  equ 0003h
PWM12PHL_PWM12PHL3_POSITION              equ 0003h
PWM12PHL_PWM12PHL3_SIZE                  equ 0001h
PWM12PHL_PWM12PHL3_LENGTH                equ 0001h
PWM12PHL_PWM12PHL3_MASK                  equ 0008h
PWM12PHL_PWM12PHL4_POSN                  equ 0004h
PWM12PHL_PWM12PHL4_POSITION              equ 0004h
PWM12PHL_PWM12PHL4_SIZE                  equ 0001h
PWM12PHL_PWM12PHL4_LENGTH                equ 0001h
PWM12PHL_PWM12PHL4_MASK                  equ 0010h
PWM12PHL_PWM12PHL5_POSN                  equ 0005h
PWM12PHL_PWM12PHL5_POSITION              equ 0005h
PWM12PHL_PWM12PHL5_SIZE                  equ 0001h
PWM12PHL_PWM12PHL5_LENGTH                equ 0001h
PWM12PHL_PWM12PHL5_MASK                  equ 0020h
PWM12PHL_PWM12PHL6_POSN                  equ 0006h
PWM12PHL_PWM12PHL6_POSITION              equ 0006h
PWM12PHL_PWM12PHL6_SIZE                  equ 0001h
PWM12PHL_PWM12PHL6_LENGTH                equ 0001h
PWM12PHL_PWM12PHL6_MASK                  equ 0040h
PWM12PHL_PWM12PHL7_POSN                  equ 0007h
PWM12PHL_PWM12PHL7_POSITION              equ 0007h
PWM12PHL_PWM12PHL7_SIZE                  equ 0001h
PWM12PHL_PWM12PHL7_LENGTH                equ 0001h
PWM12PHL_PWM12PHL7_MASK                  equ 0080h
PWM12PHL_PWM12PHL_POSN                   equ 0000h
PWM12PHL_PWM12PHL_POSITION               equ 0000h
PWM12PHL_PWM12PHL_SIZE                   equ 0008h
PWM12PHL_PWM12PHL_LENGTH                 equ 0008h
PWM12PHL_PWM12PHL_MASK                   equ 00FFh

// Register: PWM12PHH
#define PWM12PHH PWM12PHH
PWM12PHH                                 equ 0DC2h
// bitfield definitions
PWM12PHH_PH_POSN                         equ 0000h
PWM12PHH_PH_POSITION                     equ 0000h
PWM12PHH_PH_SIZE                         equ 0008h
PWM12PHH_PH_LENGTH                       equ 0008h
PWM12PHH_PH_MASK                         equ 00FFh
PWM12PHH_PWM12PHH0_POSN                  equ 0000h
PWM12PHH_PWM12PHH0_POSITION              equ 0000h
PWM12PHH_PWM12PHH0_SIZE                  equ 0001h
PWM12PHH_PWM12PHH0_LENGTH                equ 0001h
PWM12PHH_PWM12PHH0_MASK                  equ 0001h
PWM12PHH_PWM12PHH1_POSN                  equ 0001h
PWM12PHH_PWM12PHH1_POSITION              equ 0001h
PWM12PHH_PWM12PHH1_SIZE                  equ 0001h
PWM12PHH_PWM12PHH1_LENGTH                equ 0001h
PWM12PHH_PWM12PHH1_MASK                  equ 0002h
PWM12PHH_PWM12PHH2_POSN                  equ 0002h
PWM12PHH_PWM12PHH2_POSITION              equ 0002h
PWM12PHH_PWM12PHH2_SIZE                  equ 0001h
PWM12PHH_PWM12PHH2_LENGTH                equ 0001h
PWM12PHH_PWM12PHH2_MASK                  equ 0004h
PWM12PHH_PWM12PHH3_POSN                  equ 0003h
PWM12PHH_PWM12PHH3_POSITION              equ 0003h
PWM12PHH_PWM12PHH3_SIZE                  equ 0001h
PWM12PHH_PWM12PHH3_LENGTH                equ 0001h
PWM12PHH_PWM12PHH3_MASK                  equ 0008h
PWM12PHH_PWM12PHH4_POSN                  equ 0004h
PWM12PHH_PWM12PHH4_POSITION              equ 0004h
PWM12PHH_PWM12PHH4_SIZE                  equ 0001h
PWM12PHH_PWM12PHH4_LENGTH                equ 0001h
PWM12PHH_PWM12PHH4_MASK                  equ 0010h
PWM12PHH_PWM12PHH5_POSN                  equ 0005h
PWM12PHH_PWM12PHH5_POSITION              equ 0005h
PWM12PHH_PWM12PHH5_SIZE                  equ 0001h
PWM12PHH_PWM12PHH5_LENGTH                equ 0001h
PWM12PHH_PWM12PHH5_MASK                  equ 0020h
PWM12PHH_PWM12PHH6_POSN                  equ 0006h
PWM12PHH_PWM12PHH6_POSITION              equ 0006h
PWM12PHH_PWM12PHH6_SIZE                  equ 0001h
PWM12PHH_PWM12PHH6_LENGTH                equ 0001h
PWM12PHH_PWM12PHH6_MASK                  equ 0040h
PWM12PHH_PWM12PHH7_POSN                  equ 0007h
PWM12PHH_PWM12PHH7_POSITION              equ 0007h
PWM12PHH_PWM12PHH7_SIZE                  equ 0001h
PWM12PHH_PWM12PHH7_LENGTH                equ 0001h
PWM12PHH_PWM12PHH7_MASK                  equ 0080h
PWM12PHH_PWM12PHH_POSN                   equ 0000h
PWM12PHH_PWM12PHH_POSITION               equ 0000h
PWM12PHH_PWM12PHH_SIZE                   equ 0008h
PWM12PHH_PWM12PHH_LENGTH                 equ 0008h
PWM12PHH_PWM12PHH_MASK                   equ 00FFh

