GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
// Register: PWM12OFL
#define PWM12OFL PWM12OFL
PWM12OFL                                 equ 0DC7h
// bitfield definitions
PWM12OFL_OF_POSN                         equ 0000h
PWM12OFL_OF_POSITION                     equ 0000h
PWM12OFL_OF_SIZE                         equ 0008h
PWM12OFL_OF_LENGTH                       equ 0008h
PWM12OFL_OF_MASK                         equ 00FFh
PWM12OFL_PWM12OFL0_POSN                  equ 0000h
PWM12OFL_PWM12OFL0_POSITION              equ 0000h
PWM12OFL_PWM12OFL0_SIZE                  equ 0001h
PWM12OFL_PWM12OFL0_LENGTH                equ 0001h
PWM12OFL_PWM12OFL0_MASK                  equ 0001h
PWM12OFL_PWM12OFL1_POSN                  equ 0001h
PWM12OFL_PWM12OFL1_POSITION              equ 0001h
PWM12OFL_PWM12OFL1_SIZE                  equ 0001h
PWM12OFL_PWM12OFL1_LENGTH                equ 0001h
PWM12OFL_PWM12OFL1_MASK                  equ 0002h
PWM12OFL_PWM12OFL2_POSN                  equ 0002h
PWM12OFL_PWM12OFL2_POSITION              equ 0002h
PWM12OFL_PWM12OFL2_SIZE                  equ 0001h
PWM12OFL_PWM12OFL2_LENGTH                equ 0001h
PWM12OFL_PWM12OFL2_MASK                  equ 0004h
PWM12OFL_PWM12OFL3_POSN                  equ 0003h
PWM12OFL_PWM12OFL3_POSITION              equ 0003h
PWM12OFL_PWM12OFL3_SIZE                  equ 0001h
PWM12OFL_PWM12OFL3_LENGTH                equ 0001h
PWM12OFL_PWM12OFL3_MASK                  equ 0008h
PWM12OFL_PWM12OFL4_POSN                  equ 0004h
PWM12OFL_PWM12OFL4_POSITION              equ 0004h
PWM12OFL_PWM12OFL4_SIZE                  equ 0001h
PWM12OFL_PWM12OFL4_LENGTH                equ 0001h
PWM12OFL_PWM12OFL4_MASK                  equ 0010h
PWM12OFL_PWM12OFL5_POSN                  equ 0005h
PWM12OFL_PWM12OFL5_POSITION              equ 0005h
PWM12OFL_PWM12OFL5_SIZE                  equ 0001h
PWM12OFL_PWM12OFL5_LENGTH                equ 0001h
PWM12OFL_PWM12OFL5_MASK                  equ 0020h
PWM12OFL_PWM12OFL6_POSN                  equ 0006h
PWM12OFL_PWM12OFL6_POSITION              equ 0006h
PWM12OFL_PWM12OFL6_SIZE                  equ 0001h
PWM12OFL_PWM12OFL6_LENGTH                equ 0001h
PWM12OFL_PWM12OFL6_MASK                  equ 0040h
PWM12OFL_PWM12OFL7_POSN                  equ 0007h
PWM12OFL_PWM12OFL7_POSITION              equ 0007h
PWM12OFL_PWM12OFL7_SIZE                  equ 0001h
PWM12OFL_PWM12OFL7_LENGTH                equ 0001h
PWM12OFL_PWM12OFL7_MASK                  equ 0080h
PWM12OFL_PWM12OFL_POSN                   equ 0000h
PWM12OFL_PWM12OFL_POSITION               equ 0000h
PWM12OFL_PWM12OFL_SIZE                   equ 0008h
PWM12OFL_PWM12OFL_LENGTH                 equ 0008h
PWM12OFL_PWM12OFL_MASK                   equ 00FFh

// Register: PWM12OFH
#define PWM12OFH PWM12OFH
PWM12OFH                                 equ 0DC8h
// bitfield definitions
PWM12OFH_OF_POSN                         equ 0000h
PWM12OFH_OF_POSITION                     equ 0000h
PWM12OFH_OF_SIZE                         equ 0008h
PWM12OFH_OF_LENGTH                       equ 0008h
PWM12OFH_OF_MASK                         equ 00FFh
PWM12OFH_PWM12OFH0_POSN                  equ 0000h
PWM12OFH_PWM12OFH0_POSITION              equ 0000h
PWM12OFH_PWM12OFH0_SIZE                  equ 0001h
PWM12OFH_PWM12OFH0_LENGTH                equ 0001h
PWM12OFH_PWM12OFH0_MASK                  equ 0001h
PWM12OFH_PWM12OFH1_POSN                  equ 0001h
PWM12OFH_PWM12OFH1_POSITION              equ 0001h
PWM12OFH_PWM12OFH1_SIZE                  equ 0001h
PWM12OFH_PWM12OFH1_LENGTH                equ 0001h
PWM12OFH_PWM12OFH1_MASK                  equ 0002h
PWM12OFH_PWM12OFH2_POSN                  equ 0002h
PWM12OFH_PWM12OFH2_POSITION              equ 0002h
PWM12OFH_PWM12OFH2_SIZE                  equ 0001h
PWM12OFH_PWM12OFH2_LENGTH                equ 0001h
PWM12OFH_PWM12OFH2_MASK                  equ 0004h
PWM12OFH_PWM12OFH3_POSN                  equ 0003h
PWM12OFH_PWM12OFH3_POSITION              equ 0003h
PWM12OFH_PWM12OFH3_SIZE                  equ 0001h
PWM12OFH_PWM12OFH3_LENGTH                equ 0001h
PWM12OFH_PWM12OFH3_MASK                  equ 0008h
PWM12OFH_PWM12OFH4_POSN                  equ 0004h
PWM12OFH_PWM12OFH4_POSITION              equ 0004h
PWM12OFH_PWM12OFH4_SIZE                  equ 0001h
PWM12OFH_PWM12OFH4_LENGTH                equ 0001h
PWM12OFH_PWM12OFH4_MASK                  equ 0010h
PWM12OFH_PWM12OFH5_POSN                  equ 0005h
PWM12OFH_PWM12OFH5_POSITION              equ 0005h
PWM12OFH_PWM12OFH5_SIZE                  equ 0001h
PWM12OFH_PWM12OFH5_LENGTH                equ 0001h
PWM12OFH_PWM12OFH5_MASK                  equ 0020h
PWM12OFH_PWM12OFH6_POSN                  equ 0006h
PWM12OFH_PWM12OFH6_POSITION              equ 0006h
PWM12OFH_PWM12OFH6_SIZE                  equ 0001h
PWM12OFH_PWM12OFH6_LENGTH                equ 0001h
PWM12OFH_PWM12OFH6_MASK                  equ 0040h
PWM12OFH_PWM12OFH7_POSN                  equ 0007h
PWM12OFH_PWM12OFH7_POSITION              equ 0007h
PWM12OFH_PWM12OFH7_SIZE                  equ 0001h
PWM12OFH_PWM12OFH7_LENGTH                equ 0001h
PWM12OFH_PWM12OFH7_MASK                  equ 0080h
PWM12OFH_PWM12OFH_POSN                   equ 0000h
PWM12OFH_PWM12OFH_POSITION               equ 0000h
PWM12OFH_PWM12OFH_SIZE                   equ 0008h
PWM12OFH_PWM12OFH_LENGTH                 equ 0008h
PWM12OFH_PWM12OFH_MASK                   equ 00FFh

// Register: PWM12TMRL
#define PWM12TMRL PWM12TMRL
PWM12TMRL                                equ 0DC9h
// bitfield definitions
PWM12TMRL_TMR_POSN                       equ 0000h
PWM12TMRL_TMR_POSITION                   equ 0000h
PWM12TMRL_TMR_SIZE                       equ 0008h
PWM12TMRL_TMR_LENGTH                     equ 0008h
PWM12TMRL_TMR_MASK                       equ 00FFh
PWM12TMRL_PWM12TMRL0_POSN                equ 0000h
PWM12TMRL_PWM12TMRL0_POSITION            equ 0000h
PWM12TMRL_PWM12TMRL0_SIZE                equ 0001h
PWM12TMRL_PWM12TMRL0_LENGTH              equ 0001h
PWM12TMRL_PWM12TMRL0_MASK                equ 0001h
PWM12TMRL_PWM12TMRL1_POSN                equ 0001h
PWM12TMRL_PWM12TMRL1_POSITION            equ 0001h
PWM12TMRL_PWM12TMRL1_SIZE                equ 0001h
PWM12TMRL_PWM12TMRL1_LENGTH              equ 0001h
PWM12TMRL_PWM12TMRL1_MASK                equ 0002h
PWM12TMRL_PWM12TMRL2_POSN                equ 0002h
PWM12TMRL_PWM12TMRL2_POSITION            equ 0002h
PWM12TMRL_PWM12TMRL2_SIZE                equ 0001h
PWM12TMRL_PWM12TMRL2_LENGTH              equ 0001h
PWM12TMRL_PWM12TMRL2_MASK                equ 0004h
PWM12TMRL_PWM12TMRL3_POSN                equ 0003h
PWM12TMRL_PWM12TMRL3_POSITION            equ 0003h
PWM12TMRL_PWM12TMRL3_SIZE                equ 0001h
PWM12TMRL_PWM12TMRL3_LENGTH              equ 0001h
PWM12TMRL_PWM12TMRL3_MASK                equ 0008h
PWM12TMRL_PWM12TMRL4_POSN                equ 0004h
PWM12TMRL_PWM12TMRL4_POSITION            equ 0004h
PWM12TMRL_PWM12TMRL4_SIZE                equ 0001h
PWM12TMRL_PWM12TMRL4_LENGTH              equ 0001h
PWM12TMRL_PWM12TMRL4_MASK                equ 0010h
PWM12TMRL_PWM12TMRL5_POSN                equ 0005h
PWM12TMRL_PWM12TMRL5_POSITION            equ 0005h
PWM12TMRL_PWM12TMRL5_SIZE                equ 0001h
PWM12TMRL_PWM12TMRL5_LENGTH              equ 0001h
PWM12TMRL_PWM12TMRL5_MASK                equ 0020h
PWM12TMRL_PWM12TMRL6_POSN                equ 0006h
PWM12TMRL_PWM12TMRL6_POSITION            equ 0006h
PWM12TMRL_PWM12TMRL6_SIZE                equ 0001h
PWM12TMRL_PWM12TMRL6_LENGTH              equ 0001h
PWM12TMRL_PWM12TMRL6_MASK                equ 0040h
PWM12TMRL_PWM12TMRL7_POSN                equ 0007h
PWM12TMRL_PWM12TMRL7_POSITION            equ 0007h
PWM12TMRL_PWM12TMRL7_SIZE                equ 0001h
PWM12TMRL_PWM12TMRL7_LENGTH              equ 0001h
PWM12TMRL_PWM12TMRL7_MASK                equ 0080h
PWM12TMRL_PWM12TMRL_POSN                 equ 0000h
PWM12TMRL_PWM12TMRL_POSITION             equ 0000h
PWM12TMRL_PWM12TMRL_SIZE                 equ 0008h
PWM12TMRL_PWM12TMRL_LENGTH               equ 0008h
PWM12TMRL_PWM12TMRL_MASK                 equ 00FFh

// Register: PWM12TMRH
#define PWM12TMRH PWM12TMRH
PWM12TMRH                                equ 0DCAh
// bitfield definitions
PWM12TMRH_TMR_POSN                       equ 0000h
PWM12TMRH_TMR_POSITION                   equ 0000h
PWM12TMRH_TMR_SIZE                       equ 0008h
PWM12TMRH_TMR_LENGTH                     equ 0008h
PWM12TMRH_TMR_MASK                       equ 00FFh
PWM12TMRH_PWM12TMRH0_POSN                equ 0000h
PWM12TMRH_PWM12TMRH0_POSITION            equ 0000h
PWM12TMRH_PWM12TMRH0_SIZE                equ 0001h
PWM12TMRH_PWM12TMRH0_LENGTH              equ 0001h
PWM12TMRH_PWM12TMRH0_MASK                equ 0001h
PWM12TMRH_PWM12TMRH1_POSN                equ 0001h
PWM12TMRH_PWM12TMRH1_POSITION            equ 0001h
PWM12TMRH_PWM12TMRH1_SIZE                equ 0001h
PWM12TMRH_PWM12TMRH1_LENGTH              equ 0001h
PWM12TMRH_PWM12TMRH1_MASK                equ 0002h
PWM12TMRH_PWM12TMRH2_POSN                equ 0002h
PWM12TMRH_PWM12TMRH2_POSITION            equ 0002h
PWM12TMRH_PWM12TMRH2_SIZE                equ 0001h
PWM12TMRH_PWM12TMRH2_LENGTH              equ 0001h
PWM12TMRH_PWM12TMRH2_MASK                equ 0004h
PWM12TMRH_PWM12TMRH3_POSN                equ 0003h
PWM12TMRH_PWM12TMRH3_POSITION            equ 0003h
PWM12TMRH_PWM12TMRH3_SIZE                equ 0001h
PWM12TMRH_PWM12TMRH3_LENGTH              equ 0001h
PWM12TMRH_PWM12TMRH3_MASK                equ 0008h
PWM12TMRH_PWM12TMRH4_POSN                equ 0004h
PWM12TMRH_PWM12TMRH4_POSITION            equ 0004h
PWM12TMRH_PWM12TMRH4_SIZE                equ 0001h
PWM12TMRH_PWM12TMRH4_LENGTH              equ 0001h
PWM12TMRH_PWM12TMRH4_MASK                equ 0010h
PWM12TMRH_PWM12TMRH5_POSN                equ 0005h
PWM12TMRH_PWM12TMRH5_POSITION            equ 0005h
PWM12TMRH_PWM12TMRH5_SIZE                equ 0001h
PWM12TMRH_PWM12TMRH5_LENGTH              equ 0001h
PWM12TMRH_PWM12TMRH5_MASK                equ 0020h
PWM12TMRH_PWM12TMRH6_POSN                equ 0006h
PWM12TMRH_PWM12TMRH6_POSITION            equ 0006h
PWM12TMRH_PWM12TMRH6_SIZE                equ 0001h
PWM12TMRH_PWM12TMRH6_LENGTH              equ 0001h
PWM12TMRH_PWM12TMRH6_MASK                equ 0040h
PWM12TMRH_PWM12TMRH7_POSN                equ 0007h
PWM12TMRH_PWM12TMRH7_POSITION            equ 0007h
PWM12TMRH_PWM12TMRH7_SIZE                equ 0001h
PWM12TMRH_PWM12TMRH7_LENGTH              equ 0001h
PWM12TMRH_PWM12TMRH7_MASK                equ 0080h
PWM12TMRH_PWM12TMRH_POSN                 equ 0000h
PWM12TMRH_PWM12TMRH_POSITION             equ 0000h
PWM12TMRH_PWM12TMRH_SIZE                 equ 0008h
PWM12TMRH_PWM12TMRH_LENGTH               equ 0008h
PWM12TMRH_PWM12TMRH_MASK                 equ 00FFh

// Register: PWM12CON
#define PWM12CON PWM12CON
PWM12CON                                 equ 0DCBh
// bitfield definitions
PWM12CON_MODE_POSN                       equ 0002h
PWM12CON_MODE_POSITION                   equ 0002h
PWM12CON_MODE_SIZE                       equ 0002h
PWM12CON_MODE_LENGTH                     equ 0002h
PWM12CON_MODE_MASK                       equ 000Ch
PWM12CON_POL_POSN                        equ 0004h
PWM12CON_POL_POSITION                    equ 0004h
PWM12CON_POL_SIZE                        equ 0001h
PWM12CON_POL_LENGTH                      equ 0001h
PWM12CON_POL_MASK                        equ 0010h
PWM12CON_OUT_POSN                        equ 0005h
PWM12CON_OUT_POSITION                    equ 0005h
PWM12CON_OUT_SIZE                        equ 0001h
PWM12CON_OUT_LENGTH                      equ 0001h
PWM12CON_OUT_MASK                        equ 0020h
PWM12CON_EN_POSN                         equ 0007h
PWM12CON_EN_POSITION                     equ 0007h
PWM12CON_EN_SIZE                         equ 0001h
PWM12CON_EN_LENGTH                       equ 0001h
PWM12CON_EN_MASK                         equ 0080h
PWM12CON_PWM12MODE0_POSN                 equ 0002h
PWM12CON_PWM12MODE0_POSITION             equ 0002h
PWM12CON_PWM12MODE0_SIZE                 equ 0001h
PWM12CON_PWM12MODE0_LENGTH               equ 0001h
PWM12CON_PWM12MODE0_MASK                 equ 0004h
PWM12CON_PWM12MODE1_POSN                 equ 0003h
PWM12CON_PWM12MODE1_POSITION             equ 0003h
PWM12CON_PWM12MODE1_SIZE                 equ 0001h
PWM12CON_PWM12MODE1_LENGTH               equ 0001h
PWM12CON_PWM12MODE1_MASK                 equ 0008h
PWM12CON_PWM12MODE_POSN                  equ 0002h
PWM12CON_PWM12MODE_POSITION              equ 0002h
PWM12CON_PWM12MODE_SIZE                  equ 0002h
PWM12CON_PWM12MODE_LENGTH                equ 0002h
PWM12CON_PWM12MODE_MASK                  equ 000Ch
PWM12CON_PWM12POL_POSN                   equ 0004h
PWM12CON_PWM12POL_POSITION               equ 0004h
PWM12CON_PWM12POL_SIZE                   equ 0001h
PWM12CON_PWM12POL_LENGTH                 equ 0001h
PWM12CON_PWM12POL_MASK                   equ 0010h
PWM12CON_PWM12OUT_POSN                   equ 0005h
PWM12CON_PWM12OUT_POSITION               equ 0005h
PWM12CON_PWM12OUT_SIZE                   equ 0001h
PWM12CON_PWM12OUT_LENGTH                 equ 0001h
PWM12CON_PWM12OUT_MASK                   equ 0020h
PWM12CON_PWM12EN_POSN                    equ 0007h
PWM12CON_PWM12EN_POSITION                equ 0007h
PWM12CON_PWM12EN_SIZE                    equ 0001h
PWM12CON_PWM12EN_LENGTH                  equ 0001h
PWM12CON_PWM12EN_MASK                    equ 0080h
PWM12CON_MODE0_POSN                      equ 0002h
PWM12CON_MODE0_POSITION                  equ 0002h
PWM12CON_MODE0_SIZE                      equ 0001h
PWM12CON_MODE0_LENGTH                    equ 0001h
PWM12CON_MODE0_MASK                      equ 0004h
PWM12CON_MODE1_POSN                      equ 0003h
PWM12CON_MODE1_POSITION                  equ 0003h
PWM12CON_MODE1_SIZE                      equ 0001h
PWM12CON_MODE1_LENGTH                    equ 0001h
PWM12CON_MODE1_MASK                      equ 0008h

// Register: PWM12INTE
#define PWM12INTE PWM12INTE
PWM12INTE                                equ 0DCCh
// bitfield definitions
PWM12INTE_PRIE_POSN                      equ 0000h
PWM12INTE_PRIE_POSITION                  equ 0000h
PWM12INTE_PRIE_SIZE                      equ 0001h
PWM12INTE_PRIE_LENGTH                    equ 0001h
PWM12INTE_PRIE_MASK                      equ 0001h
PWM12INTE_DCIE_POSN                      equ 0001h
PWM12INTE_DCIE_POSITION                  equ 0001h
PWM12INTE_DCIE_SIZE                      equ 0001h
PWM12INTE_DCIE_LENGTH                    equ 0001h
PWM12INTE_DCIE_MASK                      equ 0002h
PWM12INTE_PHIE_POSN                      equ 0002h
PWM12INTE_PHIE_POSITION                  equ 0002h
PWM12INTE_PHIE_SIZE                      equ 0001h
PWM12INTE_PHIE_LENGTH                    equ 0001h
PWM12INTE_PHIE_MASK                      equ 0004h
PWM12INTE_OFIE_POSN                      equ 0003h
PWM12INTE_OFIE_POSITION                  equ 0003h
PWM12INTE_OFIE_SIZE                      equ 0001h
PWM12INTE_OFIE_LENGTH                    equ 0001h
PWM12INTE_OFIE_MASK                      equ 0008h
PWM12INTE_PWM12PRIE_POSN                 equ 0000h
PWM12INTE_PWM12PRIE_POSITION             equ 0000h
PWM12INTE_PWM12PRIE_SIZE                 equ 0001h
PWM12INTE_PWM12PRIE_LENGTH               equ 0001h
PWM12INTE_PWM12PRIE_MASK                 equ 0001h
PWM12INTE_PWM12DCIE_POSN                 equ 0001h
PWM12INTE_PWM12DCIE_POSITION             equ 0001h
PWM12INTE_PWM12DCIE_SIZE                 equ 0001h
PWM12INTE_PWM12DCIE_LENGTH               equ 0001h
PWM12INTE_PWM12DCIE_MASK                 equ 0002h
PWM12INTE_PWM12PHIE_POSN                 equ 0002h
PWM12INTE_PWM12PHIE_POSITION             equ 0002h
PWM12INTE_PWM12PHIE_SIZE                 equ 0001h
PWM12INTE_PWM12PHIE_LENGTH               equ 0001h
PWM12INTE_PWM12PHIE_MASK                 equ 0004h
PWM12INTE_PWM12OFIE_POSN                 equ 0003h
PWM12INTE_PWM12OFIE_POSITION             equ 0003h
PWM12INTE_PWM12OFIE_SIZE                 equ 0001h
PWM12INTE_PWM12OFIE_LENGTH               equ 0001h
PWM12INTE_PWM12OFIE_MASK                 equ 0008h

// Register: PWM12INTF
#define PWM12INTF PWM12INTF
PWM12INTF                                equ 0DCDh
// bitfield definitions
PWM12INTF_PRIF_POSN                      equ 0000h
PWM12INTF_PRIF_POSITION                  equ 0000h
PWM12INTF_PRIF_SIZE                      equ 0001h
PWM12INTF_PRIF_LENGTH                    equ 0001h
PWM12INTF_PRIF_MASK                      equ 0001h
PWM12INTF_DCIF_POSN                      equ 0001h
PWM12INTF_DCIF_POSITION                  equ 0001h
PWM12INTF_DCIF_SIZE                      equ 0001h
PWM12INTF_DCIF_LENGTH                    equ 0001h
PWM12INTF_DCIF_MASK                      equ 0002h
PWM12INTF_PHIF_POSN                      equ 0002h
PWM12INTF_PHIF_POSITION                  equ 0002h
PWM12INTF_PHIF_SIZE                      equ 0001h
PWM12INTF_PHIF_LENGTH                    equ 0001h
PWM12INTF_PHIF_MASK                      equ 0004h
PWM12INTF_OFIF_POSN                      equ 0003h
PWM12INTF_OFIF_POSITION                  equ 0003h
PWM12INTF_OFIF_SIZE                      equ 0001h
PWM12INTF_OFIF_LENGTH                    equ 0001h
PWM12INTF_OFIF_MASK                      equ 0008h
PWM12INTF_PWM12PRIF_POSN                 equ 0000h
PWM12INTF_PWM12PRIF_POSITION             equ 0000h
PWM12INTF_PWM12PRIF_SIZE                 equ 0001h
PWM12INTF_PWM12PRIF_LENGTH               equ 0001h
PWM12INTF_PWM12PRIF_MASK                 equ 0001h
PWM12INTF_PWM12DCIF_POSN                 equ 0001h
PWM12INTF_PWM12DCIF_POSITION             equ 0001h
PWM12INTF_PWM12DCIF_SIZE                 equ 0001h
PWM12INTF_PWM12DCIF_LENGTH               equ 0001h
PWM12INTF_PWM12DCIF_MASK                 equ 0002h
PWM12INTF_PWM12PHIF_POSN                 equ 0002h
PWM12INTF_PWM12PHIF_POSITION             equ 0002h
PWM12INTF_PWM12PHIF_SIZE                 equ 0001h
PWM12INTF_PWM12PHIF_LENGTH               equ 0001h
PWM12INTF_PWM12PHIF_MASK                 equ 0004h
PWM12INTF_PWM12OFIF_POSN                 equ 0003h
PWM12INTF_PWM12OFIF_POSITION             equ 0003h
PWM12INTF_PWM12OFIF_SIZE                 equ 0001h
PWM12INTF_PWM12OFIF_LENGTH               equ 0001h
PWM12INTF_PWM12OFIF_MASK                 equ 0008h

// Register: PWM12CLKCON
#define PWM12CLKCON PWM12CLKCON
PWM12CLKCON                              equ 0DCEh
// bitfield definitions
PWM12CLKCON_CS_POSN                      equ 0000h
PWM12CLKCON_CS_POSITION                  equ 0000h
PWM12CLKCON_CS_SIZE                      equ 0002h
PWM12CLKCON_CS_LENGTH                    equ 0002h
PWM12CLKCON_CS_MASK                      equ 0003h
PWM12CLKCON_PS_POSN                      equ 0004h
PWM12CLKCON_PS_POSITION                  equ 0004h
PWM12CLKCON_PS_SIZE                      equ 0003h
PWM12CLKCON_PS_LENGTH                    equ 0003h
PWM12CLKCON_PS_MASK                      equ 0070h
PWM12CLKCON_PWM12CS0_POSN                equ 0000h
PWM12CLKCON_PWM12CS0_POSITION            equ 0000h
PWM12CLKCON_PWM12CS0_SIZE                equ 0001h
PWM12CLKCON_PWM12CS0_LENGTH              equ 0001h
PWM12CLKCON_PWM12CS0_MASK                equ 0001h
PWM12CLKCON_PWM12CS1_POSN                equ 0001h
PWM12CLKCON_PWM12CS1_POSITION            equ 0001h
PWM12CLKCON_PWM12CS1_SIZE                equ 0001h
PWM12CLKCON_PWM12CS1_LENGTH              equ 0001h
PWM12CLKCON_PWM12CS1_MASK                equ 0002h
PWM12CLKCON_PWM12CS2_POSN                equ 0002h
PWM12CLKCON_PWM12CS2_POSITION            equ 0002h
PWM12CLKCON_PWM12CS2_SIZE                equ 0001h
PWM12CLKCON_PWM12CS2_LENGTH              equ 0001h
PWM12CLKCON_PWM12CS2_MASK                equ 0004h
PWM12CLKCON_PWM12PS0_POSN                equ 0004h
PWM12CLKCON_PWM12PS0_POSITION            equ 0004h
PWM12CLKCON_PWM12PS0_SIZE                equ 0001h
PWM12CLKCON_PWM12PS0_LENGTH              equ 0001h
PWM12CLKCON_PWM12PS0_MASK                equ 0010h
PWM12CLKCON_PWM12PS1_POSN                equ 0005h
PWM12CLKCON_PWM12PS1_POSITION            equ 0005h
PWM12CLKCON_PWM12PS1_SIZE                equ 0001h
PWM12CLKCON_PWM12PS1_LENGTH              equ 0001h
PWM12CLKCON_PWM12PS1_MASK                equ 0020h
PWM12CLKCON_PWM12PS2_POSN                equ 0006h
PWM12CLKCON_PWM12PS2_POSITION            equ 0006h
PWM12CLKCON_PWM12PS2_SIZE                equ 0001h
PWM12CLKCON_PWM12PS2_LENGTH              equ 0001h
PWM12CLKCON_PWM12PS2_MASK                equ 0040h
PWM12CLKCON_PWM12CS_POSN                 equ 0000h
PWM12CLKCON_PWM12CS_POSITION             equ 0000h
PWM12CLKCON_PWM12CS_SIZE                 equ 0003h
PWM12CLKCON_PWM12CS_LENGTH               equ 0003h
PWM12CLKCON_PWM12CS_MASK                 equ 0007h
PWM12CLKCON_PWM12PS_POSN                 equ 0004h
PWM12CLKCON_PWM12PS_POSITION             equ 0004h
PWM12CLKCON_PWM12PS_SIZE                 equ 0003h
PWM12CLKCON_PWM12PS_LENGTH               equ 0003h
PWM12CLKCON_PWM12PS_MASK                 equ 0070h
PWM12CLKCON_CS0_POSN                     equ 0000h
PWM12CLKCON_CS0_POSITION                 equ 0000h
PWM12CLKCON_CS0_SIZE                     equ 0001h
PWM12CLKCON_CS0_LENGTH                   equ 0001h
PWM12CLKCON_CS0_MASK                     equ 0001h
PWM12CLKCON_CS1_POSN                     equ 0001h
PWM12CLKCON_CS1_POSITION                 equ 0001h
PWM12CLKCON_CS1_SIZE                     equ 0001h
PWM12CLKCON_CS1_LENGTH                   equ 0001h
PWM12CLKCON_CS1_MASK                     equ 0002h
PWM12CLKCON_CS2_POSN                     equ 0002h
PWM12CLKCON_CS2_POSITION                 equ 0002h
PWM12CLKCON_CS2_SIZE                     equ 0001h
PWM12CLKCON_CS2_LENGTH                   equ 0001h
PWM12CLKCON_CS2_MASK                     equ 0004h
PWM12CLKCON_PS0_POSN                     equ 0004h
PWM12CLKCON_PS0_POSITION                 equ 0004h
PWM12CLKCON_PS0_SIZE                     equ 0001h
PWM12CLKCON_PS0_LENGTH                   equ 0001h
PWM12CLKCON_PS0_MASK                     equ 0010h
PWM12CLKCON_PS1_POSN                     equ 0005h
PWM12CLKCON_PS1_POSITION                 equ 0005h
PWM12CLKCON_PS1_SIZE                     equ 0001h
PWM12CLKCON_PS1_LENGTH                   equ 0001h
PWM12CLKCON_PS1_MASK                     equ 0020h
PWM12CLKCON_PS2_POSN                     equ 0006h
PWM12CLKCON_PS2_POSITION                 equ 0006h
PWM12CLKCON_PS2_SIZE                     equ 0001h
PWM12CLKCON_PS2_LENGTH                   equ 0001h
PWM12CLKCON_PS2_MASK                     equ 0040h

