GopalSaraf/Practicals/PSDL/include/proc/pic16f1779.inc
#define RG2EN                            BANKMASK(PRG2CON0), 7
#define RG2FEDG                          BANKMASK(PRG2CON0), 5
#define RG2FPOL                          BANKMASK(PRG2CON1), 1
#define RG2FTSS0                         BANKMASK(PRG2FTSS), 0
#define RG2FTSS1                         BANKMASK(PRG2FTSS), 1
#define RG2FTSS2                         BANKMASK(PRG2FTSS), 2
#define RG2FTSS3                         BANKMASK(PRG2FTSS), 3
#define RG2GO                            BANKMASK(PRG2CON0), 0
#define RG2INS0                          BANKMASK(PRG2INS), 0
#define RG2INS1                          BANKMASK(PRG2INS), 1
#define RG2INS2                          BANKMASK(PRG2INS), 2
#define RG2INS3                          BANKMASK(PRG2INS), 3
#define RG2ISET0                         BANKMASK(PRG2CON2), 0
#define RG2ISET1                         BANKMASK(PRG2CON2), 1
#define RG2ISET2                         BANKMASK(PRG2CON2), 2
#define RG2ISET3                         BANKMASK(PRG2CON2), 3
#define RG2ISET4                         BANKMASK(PRG2CON2), 4
#define RG2MODE0                         BANKMASK(PRG2CON0), 2
#define RG2MODE1                         BANKMASK(PRG2CON0), 3
#define RG2OS                            BANKMASK(PRG2CON0), 1
#define RG2RDY                           BANKMASK(PRG2CON1), 2
#define RG2REDG                          BANKMASK(PRG2CON0), 4
#define RG2RPOL                          BANKMASK(PRG2CON1), 0
#define RG2RTSS0                         BANKMASK(PRG2RTSS), 0
#define RG2RTSS1                         BANKMASK(PRG2RTSS), 1
#define RG2RTSS2                         BANKMASK(PRG2RTSS), 2
#define RG2RTSS3                         BANKMASK(PRG2RTSS), 3
#define RG3EN                            BANKMASK(PRG3CON0), 7
#define RG3FEDG                          BANKMASK(PRG3CON0), 5
#define RG3FPOL                          BANKMASK(PRG3CON1), 1
#define RG3FTSS0                         BANKMASK(PRG3FTSS), 0
#define RG3FTSS1                         BANKMASK(PRG3FTSS), 1
#define RG3FTSS2                         BANKMASK(PRG3FTSS), 2
#define RG3FTSS3                         BANKMASK(PRG3FTSS), 3
#define RG3GO                            BANKMASK(PRG3CON0), 0
#define RG3INS0                          BANKMASK(PRG3INS), 0
#define RG3INS1                          BANKMASK(PRG3INS), 1
#define RG3INS2                          BANKMASK(PRG3INS), 2
#define RG3INS3                          BANKMASK(PRG3INS), 3
#define RG3ISET0                         BANKMASK(PRG3CON2), 0
#define RG3ISET1                         BANKMASK(PRG3CON2), 1
#define RG3ISET2                         BANKMASK(PRG3CON2), 2
#define RG3ISET3                         BANKMASK(PRG3CON2), 3
#define RG3ISET4                         BANKMASK(PRG3CON2), 4
#define RG3MODE0                         BANKMASK(PRG3CON0), 2
#define RG3MODE1                         BANKMASK(PRG3CON0), 3
#define RG3OS                            BANKMASK(PRG3CON0), 1
#define RG3RDY                           BANKMASK(PRG3CON1), 2
#define RG3REDG                          BANKMASK(PRG3CON0), 4
#define RG3RPOL                          BANKMASK(PRG3CON1), 0
#define RG3RTSS0                         BANKMASK(PRG3RTSS), 0
#define RG3RTSS1                         BANKMASK(PRG3RTSS), 1
#define RG3RTSS2                         BANKMASK(PRG3RTSS), 2
#define RG3RTSS3                         BANKMASK(PRG3RTSS), 3
#define RG4EN                            BANKMASK(PRG4CON0), 7
#define RG4FEDG                          BANKMASK(PRG4CON0), 5
#define RG4FPOL                          BANKMASK(PRG4CON1), 1
#define RG4FTSS0                         BANKMASK(PRG4FTSS), 0
#define RG4FTSS1                         BANKMASK(PRG4FTSS), 1
#define RG4FTSS2                         BANKMASK(PRG4FTSS), 2
#define RG4FTSS3                         BANKMASK(PRG4FTSS), 3
#define RG4GO                            BANKMASK(PRG4CON0), 0
#define RG4INS0                          BANKMASK(PRG4INS), 0
#define RG4INS1                          BANKMASK(PRG4INS), 1
#define RG4INS2                          BANKMASK(PRG4INS), 2
#define RG4INS3                          BANKMASK(PRG4INS), 3
#define RG4ISET0                         BANKMASK(PRG4CON2), 0
#define RG4ISET1                         BANKMASK(PRG4CON2), 1
#define RG4ISET2                         BANKMASK(PRG4CON2), 2
#define RG4ISET3                         BANKMASK(PRG4CON2), 3
#define RG4ISET4                         BANKMASK(PRG4CON2), 4
#define RG4MODE0                         BANKMASK(PRG4CON0), 2
#define RG4MODE1                         BANKMASK(PRG4CON0), 3
#define RG4OS                            BANKMASK(PRG4CON0), 1
#define RG4RDY                           BANKMASK(PRG4CON1), 2
#define RG4REDG                          BANKMASK(PRG4CON0), 4
#define RG4RPOL                          BANKMASK(PRG4CON1), 0
#define RG4RTSS0                         BANKMASK(PRG4RTSS), 0
#define RG4RTSS1                         BANKMASK(PRG4RTSS), 1
#define RG4RTSS2                         BANKMASK(PRG4RTSS), 2
#define RG4RTSS3                         BANKMASK(PRG4RTSS), 3
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SEN                              BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SLRD0                            BANKMASK(SLRCOND), 0
#define SLRD1                            BANKMASK(SLRCOND), 1
#define SLRD2                            BANKMASK(SLRCOND), 2
#define SLRD3                            BANKMASK(SLRCOND), 3
#define SLRD4                            BANKMASK(SLRCOND), 4
#define SLRD5                            BANKMASK(SLRCOND), 5
#define SLRD6                            BANKMASK(SLRCOND), 6
#define SLRD7                            BANKMASK(SLRCOND), 7
#define SLRE0                            BANKMASK(SLRCONE), 0
#define SLRE1                            BANKMASK(SLRCONE), 1
#define SLRE2                            BANKMASK(SLRCONE), 2
#define SMP                              BANKMASK(SSP1STAT), 7
#define SOSCR                            BANKMASK(OSCSTAT), 7
#define SPEN                             BANKMASK(RC1STA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CON), 6
#define T1CS1                            BANKMASK(T1CON), 7
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1ON                             BANKMASK(T1CON), 0
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T2CKPOL                          BANKMASK(T2HLT), 6
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CKSYNC                         BANKMASK(T2HLT), 5
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T2RSEL4                          BANKMASK(T2RST), 4
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3CS0                            BANKMASK(T3CON), 6
#define T3CS1                            BANKMASK(T3CON), 7
#define T3GE                             BANKMASK(T3GCON), 7
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GCON), 0
#define T3GSS1                           BANKMASK(T3GCON), 1
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3ON                             BANKMASK(T3CON), 0
#define T3OSCEN                          BANKMASK(T3CON), 3
#define T4CKPOL                          BANKMASK(T4HLT), 6
#define T4CKPS0                          BANKMASK(T4CON), 4
#define T4CKPS1                          BANKMASK(T4CON), 5
#define T4CKPS2                          BANKMASK(T4CON), 6
#define T4CKSYNC                         BANKMASK(T4HLT), 5
#define T4CS0                            BANKMASK(T4CLKCON), 0
#define T4CS1                            BANKMASK(T4CLKCON), 1
#define T4CS2                            BANKMASK(T4CLKCON), 2
#define T4CS3                            BANKMASK(T4CLKCON), 3
#define T4MODE0                          BANKMASK(T4HLT), 0
#define T4MODE1                          BANKMASK(T4HLT), 1
#define T4MODE2                          BANKMASK(T4HLT), 2
#define T4MODE3                          BANKMASK(T4HLT), 3
#define T4MODE4                          BANKMASK(T4HLT), 4
#define T4ON                             BANKMASK(T4CON), 7
#define T4OUTPS0                         BANKMASK(T4CON), 0
#define T4OUTPS1                         BANKMASK(T4CON), 1
#define T4OUTPS2                         BANKMASK(T4CON), 2
#define T4OUTPS3                         BANKMASK(T4CON), 3
#define T4PSYNC                          BANKMASK(T4HLT), 7
#define T4RSEL0                          BANKMASK(T4RST), 0
#define T4RSEL1                          BANKMASK(T4RST), 1
#define T4RSEL2                          BANKMASK(T4RST), 2
#define T4RSEL3                          BANKMASK(T4RST), 3
#define T4RSEL4                          BANKMASK(T4RST), 4
#define T5CKPS0                          BANKMASK(T5CON), 4
#define T5CKPS1                          BANKMASK(T5CON), 5
#define T5CS0                            BANKMASK(T5CON), 6
#define T5CS1                            BANKMASK(T5CON), 7
#define T5GE                             BANKMASK(T5GCON), 7
#define T5GGO_nDONE                      BANKMASK(T5GCON), 3
#define T5GPOL                           BANKMASK(T5GCON), 6
#define T5GSPM                           BANKMASK(T5GCON), 4
#define T5GSS0                           BANKMASK(T5GCON), 0
#define T5GSS1                           BANKMASK(T5GCON), 1
#define T5GTM                            BANKMASK(T5GCON), 5
#define T5GVAL                           BANKMASK(T5GCON), 2
#define T5ON                             BANKMASK(T5CON), 0
#define T5OSCEN                          BANKMASK(T5CON), 3
#define T6CKPOL                          BANKMASK(T6HLT), 6
#define T6CKPS0                          BANKMASK(T6CON), 4
#define T6CKPS1                          BANKMASK(T6CON), 5
#define T6CKPS2                          BANKMASK(T6CON), 6
#define T6CKSYNC                         BANKMASK(T6HLT), 5
#define T6CS0                            BANKMASK(T6CLKCON), 0
#define T6CS1                            BANKMASK(T6CLKCON), 1
#define T6CS2                            BANKMASK(T6CLKCON), 2
#define T6CS3                            BANKMASK(T6CLKCON), 3
#define T6MODE0                          BANKMASK(T6HLT), 0
#define T6MODE1                          BANKMASK(T6HLT), 1
#define T6MODE2                          BANKMASK(T6HLT), 2
#define T6MODE3                          BANKMASK(T6HLT), 3
#define T6MODE4                          BANKMASK(T6HLT), 4
#define T6ON                             BANKMASK(T6CON), 7
#define T6OUTPS0                         BANKMASK(T6CON), 0
#define T6OUTPS1                         BANKMASK(T6CON), 1
#define T6OUTPS2                         BANKMASK(T6CON), 2
#define T6OUTPS3                         BANKMASK(T6CON), 3
#define T6PSYNC                          BANKMASK(T6HLT), 7
#define T6RSEL0                          BANKMASK(T6RST), 0
#define T6RSEL1                          BANKMASK(T6RST), 1
#define T6RSEL2                          BANKMASK(T6RST), 2
#define T6RSEL3                          BANKMASK(T6RST), 3
#define T6RSEL4                          BANKMASK(T6RST), 4
#define T8CKPOL                          BANKMASK(T8HLT), 6
#define T8CKPS0                          BANKMASK(T8CON), 4
#define T8CKPS1                          BANKMASK(T8CON), 5
#define T8CKPS2                          BANKMASK(T8CON), 6
#define T8CKSYNC                         BANKMASK(T8HLT), 5
#define T8CS0                            BANKMASK(T8CLKCON), 0
#define T8CS1                            BANKMASK(T8CLKCON), 1
#define T8CS2                            BANKMASK(T8CLKCON), 2
#define T8CS3                            BANKMASK(T8CLKCON), 3
#define T8MODE0                          BANKMASK(T8HLT), 0
#define T8MODE1                          BANKMASK(T8HLT), 1
#define T8MODE2                          BANKMASK(T8HLT), 2
#define T8MODE3                          BANKMASK(T8HLT), 3
#define T8MODE4                          BANKMASK(T8HLT), 4
#define T8ON                             BANKMASK(T8CON), 7
#define T8OUTPS0                         BANKMASK(T8CON), 0
#define T8OUTPS1                         BANKMASK(T8CON), 1
#define T8OUTPS2                         BANKMASK(T8CON), 2
#define T8OUTPS3                         BANKMASK(T8CON), 3
#define T8PSYNC                          BANKMASK(T8HLT), 7
#define T8RSEL0                          BANKMASK(T8RST), 0
#define T8RSEL1                          BANKMASK(T8RST), 1
#define T8RSEL2                          BANKMASK(T8RST), 2
#define T8RSEL3                          BANKMASK(T8RST), 3
#define T8RSEL4                          BANKMASK(T8RST), 4
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 7
#define TMR3CS0                          BANKMASK(T3CON), 6
#define TMR3CS1                          BANKMASK(T3CON), 7
#define TMR3GE                           BANKMASK(T3GCON), 7
#define TMR3GIE                          BANKMASK(PIE4), 3
#define TMR3GIF                          BANKMASK(PIR4), 3
#define TMR3IE                           BANKMASK(PIE4), 2
#define TMR3IF                           BANKMASK(PIR4), 2
#define TMR3ON                           BANKMASK(T3CON), 0
#define TMR4IE                           BANKMASK(PIE4), 0
#define TMR4IF                           BANKMASK(PIR4), 0
#define TMR4ON                           BANKMASK(T4CON), 7
#define TMR5CS0                          BANKMASK(T5CON), 6
#define TMR5CS1                          BANKMASK(T5CON), 7
#define TMR5GE                           BANKMASK(T5GCON), 7
#define TMR5GIE                          BANKMASK(PIE4), 5
#define TMR5GIF                          BANKMASK(PIR4), 5
#define TMR5IE                           BANKMASK(PIE4), 4
#define TMR5IF                           BANKMASK(PIR4), 4
#define TMR5ON                           BANKMASK(T5CON), 0
#define TMR6IE                           BANKMASK(PIE4), 1
#define TMR6IF                           BANKMASK(PIR4), 1
#define TMR6ON                           BANKMASK(T6CON), 7
#define TMR8IE                           BANKMASK(PIE4), 6
#define TMR8IF                           BANKMASK(PIR4), 6
#define TMR8ON                           BANKMASK(T8CON), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TRISD0                           BANKMASK(TRISD), 0
#define TRISD1                           BANKMASK(TRISD), 1
#define TRISD2                           BANKMASK(TRISD), 2
#define TRISD3                           BANKMASK(TRISD), 3
#define TRISD4                           BANKMASK(TRISD), 4
#define TRISD5                           BANKMASK(TRISD), 5
#define TRISD6                           BANKMASK(TRISD), 6
#define TRISD7                           BANKMASK(TRISD), 7
#define TRISE0                           BANKMASK(TRISE), 0
#define TRISE1                           BANKMASK(TRISE), 1
#define TRISE2                           BANKMASK(TRISE), 2
#define TRISE3                           BANKMASK(TRISE), 3
#define TRMT                             BANKMASK(TX1STA), 1
